Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/basic-concepts.po
Languages: pt_br, ru, zh_cn

source: Basic concepts
pt_br: Conceitos básicos
ru: Основные понятия
zh_cn: 基本概念

source: Flatpak can be understood through a small number of key concepts. It is useful to be familiar with these before learning about how to use Flatpak from the command line, or using it to build applications.
pt_br: O Flatpak pode ser entendido através de um pequeno número de conceitos-chave. É útil estar familiarizado com isso antes de aprender sobre como usar o Flatpak na linha de comando ou usá-lo para criar aplicativos.
ru: Как использовать Flatpak можно понять с помощью небольшого количества ключевых терминов. Полезно ознакомиться с ними, прежде чем узнавать, как использовать Flatpak из командной строки или использовать его для создания приложений.
zh_cn: 可以通过很少的关键概念来理解Flatpak，在学习如何使用Flatpak的命令行或者用它构建应用之前熟悉他们是很有用的。

source: Runtimes
ru: Среда выполнения
zh_cn: 运行时

source: Runtimes provide the basic dependencies that are used by applications. Each application must be built against a runtime, and this runtime must be installed on a host system in order for the application to run (Flatpak can automatically install the runtime required by an application). Multiple different runtimes can be installed at the same time, including different versions of the same runtime.
pt_br: Os runtimes fornecem as dependências básicas usadas pelos aplicativos. Cada aplicativo deve ser construído em um runtime, o qual deve ser instalado em um sistema host para que o aplicativo seja executado (o Flatpak pode instalar automaticamente o runtime exigido por um aplicativo). Vários runtimes diferentes podem ser instalados ao mesmo tempo, incluindo versões diferentes do mesmo runtime.
ru: Среды выполнения предоставляют основные зависимости, которые используются приложениями. Каждое приложение должно быть построено на основе среды выполнения, и эта среда выполнения должна быть установлена в хост-системе, чтобы приложение могло работать (Flatpak может автоматически установить среду выполнения, требуемую приложением). Одновременно можно установить несколько разных сред выполнения, включая разные версии одной и той же среды выполнения.
zh_cn: 运行时提供应用程序使用的基本依赖项。每个应用程序都必须针对运行时构建，并且这个运行时必须安装在主机系统上，以便应用程序运行(Flatpak可以自动安装应用程序所需的运行时)。可以同时安装多个不同的运行时以及同一运行时的不同版本。

source: Runtimes are distribution agnostic and do not depend on particular distribution versions. This means that they provide a stable, cross-distribution base for applications, and allow applications to continue to work irrespective of operating system updates.
pt_br: Os runtimes não sem vinculam à distribuição e independem de versões específicas de distribuição. Isso significa que eles fornecem uma base estável entre diferentes distribuições para aplicativos e permitem que os aplicativos continuem funcionando independentemente das atualizações do sistema operacional.
ru: Среда выполнения не зависит от дистрибутива и не зависит от конкретной версии дистрибутива. Это означает, что они обеспечивают стабильную базу для перекрестного распространения приложений и позволяют приложениям продолжать работать независимо от обновлений операционной системы.
zh_cn: 运行时是发行版无关的，而且不依赖发行版的特定版本。这意味着他们为应用程序提供了一个稳定、跨发行版的基础，这使得应用程序可以不管操作系统的升级

source: Bundled libraries
pt_br: Bibliotecas empacotadas
ru: Связанные библиотеки
zh_cn: 捆绑库

source: If an application requires any dependencies that aren't in its runtime, they can be bundled as part of the application. This gives application developers flexibility regarding the dependencies that they use, including using:
pt_br: Se um aplicativo exigir dependências que não estejam em seu runtime, elas poderão ser agrupadas como parte do aplicativo. Isso oferece aos desenvolvedores de aplicativos flexibilidade em relação às dependências que eles usam, incluindo o uso de:
ru: Если приложению требуются какие-либо зависимости, которых нет во время выполнения, они могут быть объединены как часть приложения. Это дает разработчикам приложений гибкость в отношении используемых ими зависимостей, включая использование:
zh_cn: 如果一个应用程序要求的依赖不在他的运行时里，这些依赖可以作为应用程序的一部分。这给了应用程序开发人员关于他们使用的依赖关系的灵活性，包括使用：

source: libraries that aren't available in a runtime
pt_br: bibliotecas que não estão disponíveis em runtime
ru: библиотеки, которые недоступны в дистрибутиве или в среде выполнения

source: different versions of libraries from the ones that are in a runtime
pt_br: versões diferentes de bibliotecas daquelas que estão em runtime
ru: версии библиотек, отличные от тех, что находятся в дистрибутиве или в среде выполнения

source: patched versions of libraries
pt_br: versões corrigidas (com patch) das bibliotecas
ru: пропатченные версии библиотек
zh_cn: 某个库的补丁版本

source: Sandboxes
ru: Песочницы
zh_cn: 沙箱

source: With Flatpak, each application is built and run in an isolated environment, which is called the 'sandbox'. Each sandbox contains an application and its runtime. By default, the application can only access the contents of its sandbox. Access to user files, network, graphics sockets, subsystems on the bus and devices have to be explicitly granted. Access to other things, such as other processes, is deliberately not possible.
pt_br: Com o Flatpak, cada aplicativo é criado e executado em um ambiente isolado, chamado de “sandbox”. Cada sandbox contém um aplicativo e seu runtime. Por padrão, o aplicativo pode acessar apenas o conteúdo de seu sandbox. O acesso a arquivos do usuário, rede, soquetes gráficos, subsistemas no barramento e dispositivos deve ser concedido explicitamente. O acesso a outras coisas, como outros processos, é deliberadamente não possível.
ru: В Flatpak каждое приложение создается и запускается в изолированной среде, которая называется «песочницей». Каждая песочница содержит приложение и его среду выполнения. По умолчанию приложение может получить доступ только к содержимому своей песочницы. Доступ к пользовательским файлам, сети, графическим сокетам, подсистемам на шине и устройствам должен быть явно разрешен. Доступ к другим вещам, например, к другим процессам, намеренно невозможен.
zh_cn: 使用Flatpak，每个应用程序都构建和运行在被称为“沙箱”的独立环境。每个沙箱包含一个应用和它的运行时。默认的，这个应用只能访问沙箱里面的内容。要访问用户文件、网络、图形套接字、总线上的子系统和设备必须被显式地授权。访问其它的东西，比如其它进程，是故意被设计成不可能的

source: By necessity, some resources that are inside the sandbox need to be exposed outside, to be used by the host system. These are known as 'exports', since they are files that are exported out of the sandbox, and include things like the application's ``.desktop`` file and icon.
pt_br: Por necessidade, alguns recursos que estão dentro do sandbox precisam ser expostos do lado de fora, para serem utilizados pelo sistema host. Eles são conhecidos como “exportações”, pois são arquivos exportados do sandbox e incluem itens como o arquivo ``.desktop`` e ícone do aplicativo.
ru: По необходимости, некоторые ресурсы, находящиеся внутри песочницы, должны быть открыты снаружи, чтобы их могла использовать хост-система. Они известны как «экспорт», поскольку представляют собой файлы, которые экспортируются из песочницы и включают такие вещи, как файл и значок приложения ``.desktop``.
zh_cn: 一些沙箱的内部资源需要对外暴露，被主机操作系统使用。这些被称为“导出”，因为它们是从沙箱中导出的文件，包括应用程序的“.desktop”文件和图标

source: Portals
pt_br: Portais
ru: Порталы
zh_cn: 门户

source: Portals are a mechanism through which applications can interact with the host environment from within a sandbox. They give the ability to interact with data, files and services without the need to add sandbox permissions.
pt_br: Portais são um mecanismo através do qual os aplicativos podem interagir com o ambiente host a partir de um sandbox. Eles oferecem a capacidade de interagir com dados, arquivos e serviços sem a necessidade de adicionar permissões de sandbox.
ru: Порталы - это механизм, с помощью которого приложения могут взаимодействовать с хост-средой из песочницы. Они дают возможность взаимодействовать с данными, файлами и службами без необходимости добавлять разрешения песочницы.
zh_cn: 门户是一种机制，通过它，应用程序可以在沙箱中与主机环境进行交互。它们提供了与数据、文件和服务交互的能力，这不需要添加沙箱权限

source: Examples of capabilities that can be accessed through portals include opening files through a file chooser dialog, or printing. Interface toolkits can implement transparent support for portals, so access to resources outside of the sandbox will work securely and out of the box.
pt_br: Exemplos de recursos que podem ser acessados através de portais incluem a abertura de arquivos por meio de um diálogo de seleção de arquivos ou impressão. Os kits de ferramentas de interface podem implementar suporte transparente a portais, para que o acesso a recursos fora do sandbox funcione de maneira segura e imediata.
ru: Примеры возможностей, к которым можно получить доступ через порталы, включают открытие файлов через диалоговое окно выбора файлов или печать. Наборы инструментов интерфейса могут реализовать прозрачную поддержку порталов, поэтому доступ к ресурсам за пределами песочницы будет работать безопасно и из коробки.

source: More information about portals can be found in :doc:`sandbox-permissions`.
pt_br: Mais informações sobre portais podem ser encontradas em :doc:`sandbox-permissions`.
ru: Более подробную информацию о порталах можно найти в :doc:`sandbox-permissions`.
zh_cn: 更多关于门户的学习可以在:doc:`sandbox-permissions`找到

source: Repositories
pt_br: Repositórios
ru: Репозитории
zh_cn: 仓库

source: Flatpak applications and runtimes are typically stored and published using repositories, which behave very similarly to Git repositories. A Flatpak repository can contain a single object or multiple objects, and each object is versioned, which allows upgrading and even downgrading.
pt_br: Normalmente, os aplicativos e os runtimes do Flatpak são armazenados e publicados usando repositórios, que se comportam de maneira muito semelhante aos repositórios Git. Um repositório Flatpak pode conter um único objeto ou vários objetos, e cada objeto é versionado, o que permite a atualização e até a desatualização.
ru: Приложения и среды выполнения Flatpak обычно хранятся и публикуются с помощью репозиториев, которые очень похожи на репозитории Git. Репозиторий Flatpak может содержать один объект или несколько объектов, и каждый объект имеет версии, что позволяет обновлять и даже понижать версию.
zh_cn: Flatpak应用和运行时通常使用仓库存储和发布，这个仓库和git仓库类似。一个Flatpak仓库可以包含单个或者多个对象，而且每个对象都是版本化的，可以升级和降级。

source: Each system which is using Flatpak can be configured to access any number of remote repositories. Once a system has been configured to access a 'remote', the remote repository's content can be inspected and searched, and it can be used as the source of applications and runtimes.
pt_br: Cada sistema que está usando o Flatpak pode ser configurado para acessar qualquer número de repositórios remotos. Depois que um sistema é configurado para acessar um “remoto”, o conteúdo do repositório remoto pode ser inspecionado e pesquisado, e pode ser usado como fonte de aplicativos e runtimes.
ru: Каждую систему, использующую Flatpak, можно настроить для доступа к любому количеству удаленных репозиториев. После того, как система настроена для доступа к «удаленному», содержимое удаленного репозитория можно проверять и искать, и его можно использовать в качестве источника приложений и сред выполнения.
zh_cn: 每个使用Flatpak的系统都可以配置多个远程仓库。一旦一个系统被配置成可以访问某个远程仓库，这个远程仓库的内容就可以被检测和搜索，它也可以被用作应用和运行时的源

source: When an update is performed, new versions of installed applications and runtimes are downloaded from the relevant remotes. Like with Git, only the difference between versions is downloaded, which makes the process very efficient.
pt_br: Quando uma atualização é executada, novas versões dos aplicativos e runtimes instalados são baixados dos remotos relevantes. Como no Git, apenas a diferença entre as versões é baixada, o que torna o processo muito eficiente.
ru: При выполнении обновления новые версии установленных приложений и сред выполнения загружаются с соответствующих удалённых. Как и в случае с Git, загружается только разница между версиями, что делает процесс очень эффективным.

source: libraries that aren't available in a distribution or runtime
zh_cn: 某个发行版或运行时不可用的库

source: different versions of libraries from the ones that are in a distribution or runtime
zh_cn: 某个发行版或运行时包含的库的另一版本
