Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/building-simple-apps.po
Languages: de, fr, ko, ru

source: Building Simple Apps
de: Erstellen einfacher Apps
fr: Construction d'applications simples
ko: 간단한 응용 빌드하기
ru: Создание простых приложений

source: The ``flatpak`` utility provides a simple set of commands for building and distributing applications. These allow creating new Flatpaks, into which new or existing applications can be built.
de: Das ``flatpak``-Utility liefert ein einfaches Set von Kommandos, zur Erstellung und Verteilung von Applikationen. Diese ermöglichen es, neue Flatpaks zu erzeugen, in denen neue oder existierende Applikationen erzeugt werden können.
fr: L'utilitaire ``flatpak`` fournit un ensemble simple de commandes pour construire et distribuer des applications. Celles-ci permettent la création de nouveaux Flatpaks, à l'intérieur desquels des applications nouvelles ou existantes peuvent être construites.
ko: ``flatpak`` 도구는 응용프로그램을 빌드하고 배포하기 위한 간단한 명령어들을 제공한다. 이를 이용하여 새로운 응용프로그램이나 기존 응용프로그램을 바탕으로 새로운 플랫팩들을 생성할 수 있다.
ru: Утилита «flatpak» предоставляет простой набор команд для создания и Распространения приложений. Она позволяет создавать новые Flatpaks, в которые могут быть встроены новые или существующие приложения.

source: This section describes how to build a simple application which doesn't require any additional dependencies outside of the runtime it is built against. In order to complete the examples, you should have completed the steps in `Getting Setup <getting-setup.html>`_ first.
de: Dieser Abschnitt beschreibt, wie man eine einfache Anwendung erstellt, die keine weiteren Abhängigkeiten benötigt außerhalb der Runtime, gegen die es erstellt wurde. Um diese Beispiele auszuführen, sollten zuerst die Schritte unter `Die Einrichtung <getting-setup.html>`_ vervollständigt werden.
fr: Cette section descrit comment construire une application simple qui ne nécessite aucune dépendence additionnelle en-dehors du runtime avec lequel elle a été construite. Afin de terminer les exemples, vous devrez avoir terminé les étapes de `Getting Setup <getting-setup.html>`_ d'abord.
ko: 이 섹션은 간단한 응용프로그램을 빌드하는 방법에 관하여 설명한다. 이 응용프로그램은 빌드하고난 뒤에는 실행시간에 추가적인 의존자원을 필요로 하지 않는다. 예제 실행을 위해 `환경 설정 하기 <getting-setup.html>`_ 를 참조하여 환경을 설정한다.
ru: В этом разделе описывается, как создать простое приложение, не требующее никаких дополнительных зависимостей за пределами среды выполнения, для которой оно создано. Чтобы завершить примеры, вы должны сначала выполнить шаги, описанные в разделе `Начало установки <getting-setup.html>`_.

source: Creating an app
de: Vorbereitende Maßnahmen
fr: Création d'une application
ko: 응용프로그램 생성하기
ru: Создание приложения

source: To create an application, the first step is to use the ``build-init`` command. This creates a directory into which an application can be built, which contains the correct directory structure and a metadata file which contains information about the app. The format for build-init is::
de: Der erste Schritt, um eine Applikation zu erstellen, ist die Verwendung des ``build-init``-Kommandos. Dieses erstellt ein Verzeichnis, in dem eine Applikation erzeugt werden kann, das die korrekte Verzeichnisstruktur enthält und eine Metadatendatei, welche Informationen über die App bereithält. Das Format für ``build-init`` ist::
fr: Pour créer une application, la première étape est d'utiliser la commande ``build-init``. Cela créé un répertoire dans lequel l'application peut être construit, qui contient la structure de répertoire adéquate et un fichier metadata qui contient les informations à propos de l'application. Le format pour build-init est::
ko: 응용프로그램을 생성하기 위해 우선 필요한 작업은 ``build-init`` 명령을 실행하는 것이다. ``build-init`` 은 응용프로그램이 빌드될 때 사용할 디렉토리를 생성한다. 이 디렉토리 아래에는 응용프로그램에 관한 정보를 담은 메타데이터(metadata) 및 해당 프로그램 실행을 위한 디렉토리 구조가 들어간다. 명령어 형식은 다음과 같다::
ru: Чтобы создать приложение, первым делом нужно использовать команду ``build-init``. Это создает каталог, в котором может быть создано приложение, которое содержит правильную структуру каталогов и файл метаданных, содержащий информацию о приложении. Формат build-init::

source: DIRECTORY is the name of the directory that will be created to contain the application
de: DIRECTORY ist der Name des Verzeichnisses, das erstellt wird, um die Applikation zu beinhalten
fr: DIRECTORY est le nom du répertoire qui sera créé pour contenir l'application
ko: DIRECTORY는 응용프로그램을 담아두기 위해 생성할 디렉토리 이름
ru: DIRECTORY - это имя каталога, который будет создан, для размещения приложения

source: APPNAME is the D-Bus name of the application
de: APPNAME ist der D-Bus-Name der Applikation
fr: APPNAME est le nom D-Bus de l'application
ko: APPNAME은 응용프로그램의 D-Bus 이름
ru: APPNAME - это имя приложения на D-Bus

source: SDK is the name of the SDK that will be used to build the application
de: SDK ist der Name des SDK, das verwendet wird, um die Applikation zu erzeugen
fr: SDK est le nom du SDK qui sera utilisé pour construite l'application
ko: SDK는 응용프로그램 빌드 시 사용할 SDK의 이름
ru: SDK - это имя SDK, который будет использоваться для сборки приложения

source: RUNTIME is the name of the runtime that will be required by the application
de: RUNTIME ist der Name der Runtime, die benötigt wird seitens der Applikation
fr: RUNTIME est le nom du runtime qui sera requis par l'application
ko: RUNTIME은 응용프로그램 실행에 필요한 런타임의 이름
ru: RUNTIME - это имя среды выполнения, которая потребуется приложению

source: BRANCH is typically the version of the SDK and runtime that will be used
de: BRANCH ist normalerweise die Version des SDK und der Runtime, die verwendet wird
fr: BRANCH is typiquement la version du SDK et du runtime qui sera utilisé
ru: BRANCH - это обычно используемая версия SDK и среда выполнения

source: For example, to build the GNOME Dictionary application using the GNOME 3.22 SDK, the command would look like::
de: Zum Beispiel würde das Kommando, um unter Verwendung des GNOME 3.22 SDK die GNOME Dictionary App zu erzeugen, lauten::
fr: Par exemple, pour construire l'application Dictionnaire GNOME en utilisant le SDK GNOME 3.22, la commande ressemblerait à::
ko: 예를 들어, GNOME 3.22 SDK를 사용하는 GNOME 사전을 빌드하기 위해서는 다음과 같은 명령어가 필요하다::
ru: Например, для создания приложения GNOME Dictionary с использованием GNOME 3.22SDK команда будет выглядеть так::

source: You can try this command now. In the next step we will build an application inside the resulting dictionary directory.
de: Dieser Befehl kann jetzt einmal ausgeführt werden. Im nächsten Schritt wird dann eine Anwendung im erstellten Verzeichnis erzeugt.
fr: Vous pouvez essayer cette commande maintenant. À la prochaine étape nous construirons une application à l'intérieur du répertoire dictionnary résultant.
ko: 명령어를 지금 실행 해 봐도 좋다. 다음 해야 할 일은 결과물 디렉토리, 즉 ``dictionary`` 내에서 응용프로그램을 빌드하는 것이다.
ru: Вы можете попробовать эту команду сейчас. На следующем шаге мы создадим приложение в итоговом каталоге словарей.

source: Building
de: Erstellen der App
fr: Construction
ko: 응용프로그램 빌드
ru: Создание приложения

source: ``flatpak build`` is used to build an application using an SDK. This command is used to provide access to a sandbox. For example, the following will create a file inside the appdir sandbox (in the files directory)::
de: ``flatpak build`` wird verwendet, um eine Applikation, unter Verwendung eines SDK, zu erzeugen. Dieses Kommando wird verwendet, um Zugriff auf eine Sandbox zu erhalten. Zum Beispiel würde das Folgende eine Datei innerhalb der `appdir`-Sandbox im Dateiverzeichnis erstellen::
fr: ``flatpak build`` est utilisé pour construire une application à l'aide d'un SDK. Cette commande est utilisé pour fournir un accès au bac à sable. Par exemple, la suivante va créer un fichier à l'intérieur du répertoire d'application du bac à sable (dans le répertoire fichiers)::
ko: ``flatpak build`` 는 SDK를 이용하여 응용프로그램을 빌드할 때 사용한다. 이 명령은 샌드박스로의 접근을 제공한다. 예를 들어, 아래와 같은 명령을 입력하여 `files` 디렉토리 아래의 `appdir` 샌드박스 내에 파일을 생성할 수 있다. ::
ru: ``flatpak build`` используется для создания приложения с использованием SDK. Эта команда используется для предоставления доступа к песочнице. Например, следующий код создаст файл в изолированной программной среде appdir (в каталоге файлов)::

source: (It is best to remove this file before continuing.)
de: (Es ist empfehlenswert, diese Datei zu entfernen, bevor weitere Schritte durchgeführt werden.)
fr: (Il est préférable de supprimer ce fichier avant de continuer.)
ko: (다음 단계 시험을 위해 방금 위에서 생성한 파일은 지우는 것이 좋다)
ru: (Перед продолжением лучше удалить этот файл.)

source: The build command allows existing applications that have been made using the traditional configure, make, make install routine to be built inside a flatpak. You can try this using GNOME Dictionary. First, download the source files, extract them and switch to the resulting directory::
de: Das ``build``-Kommdando erlaubt existierenden Applikationen, die mittels der traditionellen ``configure``, ``make``, ``make install``-Routine erstellt wurden, innerhalb eines Flatpaks erzeugt zu werden. Man kann dies einmal mit dem GNOME Dictionary versuchen. Als Erstes werden die Quelldateien heruntergeladen und entpackt. Dann wird in das Ausgabeverzeichnis gewechselt::
fr: La commande build permet aux applications existantes construites à l'aide des routines traditionnelles configure, make, make install à l'intérieur d'un flatpak. Vous pouvez essayer cela à l'aide de Dictionnaire GNOME. Premièrement, téléchargez les fichiers sources, extrayez-les et déplacez-vous dans le répertoire résultant::
ko: 빌드 명령은 전통적인 빌드 방법(``configure``, ``make``, ``make install`` 루틴)을 사용하도록 개발된 기존 응용프로그램들을 플랫팩 내에서 빌드되도록 한다. GNOME 사전을 이용하여 시험해보자. 우선 소스파일을 다운받고 압축을 해제한 후 디렉토리로 이동하자::
ru: Команда ``build`` позволяет существующим приложениям, созданным с использованием традиционных процедур configure, make, make install, внутри файла flatpak. Вы можете попробовать это с помощью словаря GNOME. Сначала загрузите исходные файлы, распакуйте их и перейдите в полученный каталог::

source: Then you can use the build command to build and install the source inside the dictionary directory that was previously made::
de: Dann kann das ``build``-Kommando verwendet werden, um den Quellcode zu kompilieren und innerhalb des Dictionary-Verzeichnisses, das zuvor generiert wurde, zu installieren::
fr: Ainsi vous pouvez utiliser la commande build pour contruire et installer le code source dans le répertoire dictionnary qui a été précedemment créé::
ko: 위에서 생성한 dictionary 디렉토리 내에서, 소스코드 빌드와 설치를 위한 명령어를 사용 해 볼 수 있다::
ru: Затем вы можете использовать команду build для сборки и установки исходного кода внутри каталога словаря, который был ранее создан::

source: Since these are run in a sandbox, the compiler and other tools from the SDK are used to build and install, rather than those on the host system.
de: Da dies in einer Sandbox abläuft, werden der Compiler und andere Tools des SDK für die Erstellung und Installation verwendet – und nicht die des Host-Systems::
fr: Comme ils sont exécutes dans un bac-à-sable, le compilateur et les autres outils provenant du SDK sont utilisés pour construire et installer, plutôt que ceux du système hôte.
ko: 위의 명령어들은 샌드박스 내에서 실행되므로, 호스트 플랫폼이 제공하는 것이 아닌, SDK가 제공하는 컴파일러나 다른 도구들이 빌드와 설치에 사용된다.
ru: Поскольку они запускаются в песочнице, для сборки и установки используются компилятор и другие инструменты из SDK, а не в хост-системе.

source: Completing the build
de: Abschließende Maßnahmen
fr: Compléter la construction
ko: 빌드 완료
ru: Завершение сборки

source: Once an application has been built, the ``build-finish`` command needs to be used to specify access to different parts of the host, such as networking and graphics sockets. This command is also used to specify the command that is used to run the app (done by modifying the metadata file), and to create the application's exports directory. For example::
de: Sobald eine Applikation erzeugt wurde, muss das ``build-finish``-Kommando verwendet werden, um Zugriff auf verschiedene Teile des Host-Systems zu spezifizieren, sowie das Netzwerk und Grafik-Sockets. Dieser Befehl wird auch verwendet, um das Kommando zu spezifizieren, das verwendet wird, um die App auszuführen (hierfür wird die Metadatendatei modifiziert) und um das Exportverzeichnis der Anwendung zu generieren. Zum Beispiel::
fr: Une fois l'application construite, la commande ``build-finish`` doit être utilisé pour spécifier l'accès aux différentes parties de l'hôte, comme les sockets réseaux et graphiques. Cette commande est aussi utilisé pour spécifier la commande utilisée pour exécuter l'application (effectué en modifiant le fichier metadata), et pour créer le répertoire des exports pour l'application. Par exemple::
ko: 응용프로그램이 빌드되고난 후에는 ``build-finish`` 명령을 실행하여 네트워킹 그래픽 소켓 등 호스트의 각기 다른 부분에 관한 접근 규칙을 명세할 필요가 있다. 이 명령어는 또한 응용프로그램 실행을 위한 명령어를 명세하는데에 사용(메타데이터 파일에 변경이 일어난다)되고, 응용프로그램의 export 디렉토리도 생성한다::
ru: После сборки приложения необходимо использовать команду build-finish для указания доступа к различным частям хоста, таким как сетевые и графические сокеты. Эта команда также используется для указания команды, которая используется для запуска приложения (выполняется путем изменения файла метаданных) и для создания каталога экспорта приложения. Например::

source: At this point you have successfully built a flatpak and prepared it to be run. To test the app, you need to export the Dictionary to a repository, add that repository and then install and run the app::
de: An diesem Punkt wurde erfolgreich ein Flatpak erzeugt und lauffähig gemacht. Um die App zu testen, muss das GNOME Dictionary zu einem Repository exportiert werden. Dieses Repository wird dann hinzugefügt, danach kann die App installiert und ausgeführt werden::
fr: À ce moment, vous avez construit un flatpak avec succès et l'avez préparé à être exécuté. Pour tester l'application, vous devez exporter Dictionnaire vers un dépôt, et ajouter ce dépôt et ensuite installer et exécuter l'application::
ko: 여기까지 성공적으로 실행했다면 여러분은 플랫팩을 성공적으로 빌드하고 실행 준비를 마친 셈이다. 응용프로그램 테스트를 위해 Dictionary 응용프로그램을 저장소에 내보내고(export), 해당 저장소를 추가한 후 설치 및 실행 해 보자::
ru: На этом этапе вы успешно создали flatpak и подготовили егк запуску. Чтобы протестировать приложение, вам необходимо экспортировать словарь в репозиторий, добавить этот репозиторий, а затем установить и запустить приложение::

source: This exports the app, creates a repository called tutorial-repo, installs the Dictionary application in the per-user installation area and runs it.
de: Dies exportiert die App, erstellt ein Repository namens `tutorial-repo`, installiert die Dictionary-App im Installationsbereich des Benutzers und startet diese.
fr: Cela exporte l'application, créé un dépôt appelé tutorial-repo, installe l'application Dictionnaire dans une zone d'installation utilisateur, et l'exécute.
ko: 위 명령들은 응용프로그램을 저장소로 보내고, 개별 사용자용으로 `tutorial-repo` 라는 저장소를 생성하며, 개별 사용자 용으로 Dictionary 프로그램을 설치하고, 실행하는 명령어들이다.
ru: Это экспортирует приложение, создает репозиторий под названием tutorial-repo, устанавливает приложение "Словарь" в области установки для каждого пользователя и запускает его.
