Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/building-introduction.po
Languages: de, pt_br, zh_cn

source: Building Introduction
de: Einführung zum Erstellen von Flatpaks
pt_br: Introdução à compilação
zh_cn: 构建介绍

source: :doc:`first-build` has already provided a quick demonstration of how applications get built with Flatpak. This page provides an additional general overview of what's involved.
de: Der Abschnitt :doc:`first-build` beinhaltete bereits eine kurze Demonstration, wie man Anwendungen mit Flatpak erzeugt. Diese Seite bietet zusätzlich eine allgemeine Übersicht, was hierbei involviert ist.
pt_br: :doc:`first-build` já fornece uma demonstração rápida de como os aplicativos são compilados com o Flatpak. Esta página fornece uma visão geral geral adicional do que está envolvido.
zh_cn: 我们已在 :doc:`first-build` 一节中展示了如何使用Flatpak构建应用的简单案例。在本节中，我们将概述讨论构建过程涉及到的其他要素。

source: ``flatpak-builder`` is the primary tool for building Flatpak applications. It allows you to take the source files for an application and build it into a Flatpak application. It also allows multiple other dependencies to be built at the same time, which get bundled into the build.
de: ``flatpak-builder``ist das primäre Tool zum Erstellen von Flatpak-Anwendungen. Es erlaubt, die Quelldateien für eine Anwendung zu nehmen und diese in eine Flatpak-Anwendung einzubinden. Es erlaubt zudem, verschiedene weitere Abhängigkeiten parallel dazu aufzulösen, diese werden dann in dem erzeugten Build gebündelt.
pt_br: O ``flatpak-builder`` é a principal ferramenta para a compilação de aplicativos Flatpak. Ele permite que você pegue os arquivos fonte de um aplicativo e o compile em um aplicativo Flatpak. Ele também permite que várias outras dependências sejam compiladas ao mesmo tempo, que são agrupadas na compilação.
zh_cn: ``flatpak-builder`` 是构建Flatpak应用的基础工具. 它允许您获取应用程序的源文件，并将其构建为一个Flatpak应用程序。它还允许同时构建多个其他依赖项，这些依赖项被捆绑到构建中。

source: The input to ``flatpak-builder`` is a manifest file. This specifies the parameters for the application that will be built, such as its name and which runtime it will depend on. The manifest also lists all the modules that are to be built as part of the build process. A source for each module can be specified, including links to file archives or version control repositories. One of the modules (usually the last one) is the application code itself.
de: ``flatpak-builder`` erhält als Eingabe eine Manifest-Datei. Diese spezifiziert die Parameter für die Anwendung, die erstellt werden soll, so wie den Namen der Anwendung und von welcher Laufzeitumgebung es abhängig ist. Das Manifest listet zudem alle Module, die erzeugt werden als Teil des Build-Prozesses. Eine Quelle für jedes Modul kann benannt werden, dies beinhaltet auch Dateiarchive oder Repositorys mit Versionskontrolle. Eines der Module (gewöhnlich das Letzte) ist der Programmcode der Anwendung selbst.
pt_br: A entrada para ``flatpak-builder`` é um arquivo de manifesto. Este especifica os parâmetros para o aplicativo que será compilado, como seu nome e em qual runtime ele dependerá. O manifesto também lista todos os módulos que devem ser compilados como parte do processo de compilação. Um fonte para cada módulo pode ser especificado, incluindo links para arquivos ou repositórios de controle de versão. Um dos módulos (geralmente o último) é o próprio código do aplicativo.
zh_cn: 输入给 ``flatpak-builder`` 的是一个清单文件。它指定了要构建应用的参数，例如它的名字和依赖的运行时。这个清单还列出了作为构建过程的一部分构建的所有模块（不是很确定，译者注）。可以指定每个模块的源，包括指向文件存档或版本控制存储库的链接。某个模块（通常是最后一个）是应用代码它本身。

source: The basic format used to invoke ``flatpak-builder`` is::
de: Das zugrundeliegende Format für den Aufruf von ``flatpak-builder`` sieht so aus::
pt_br: O formato básico usado para chamar o ``flatpak-builder`` é::
zh_cn: 调用 ``flatpak-builder`` 的基本格式是:

source: Where ``<build-dir>`` is the path to the directory that the application will be built into, and ``<manifest>`` is the path to a manifest file. The contents of ``<build-dir>`` can be useful for testing and debugging purposes, but is generally treated as an artifact of the build process.
de: ``<build-dir>`` bezeichnet den Pfad zum Verzeichnis, in dem die Anwendung erzeugt wird und ``<manifest>`` entspricht dem Pfad zur Manifest-Datei. Der Inhalt von ``<build-dir>`` kann zum Testen und Debuggen nützlich sein, wird aber generell als Artefakt des Build-Prozesses behandelt.
pt_br: sendo ``<build-dir>`` o caminho para o diretório em que o aplicativo será incorporado e ``<manifest>`` o caminho para um arquivo de manifesto. O conteúdo de ``<build-dir>`` pode ser útil para fins de teste e depuração, mas geralmente é tratado como um artefato do processo de compilação.
zh_cn: 其中 ``<build-dir>`` 是构建应用程序的目标文件夹，``<manifest>`` 是清单文件的路径。``<build-dir>`` 中的内容可以被用来调试和测试应用程序，不过大多数情况下它只是构建过程的中间产物。

source: When ``flatpak-builder`` is run:
de: Das Ausführen von ``flatpak-builder`` setzt folgende Prozesse in Gang::
pt_br: Quando ``flatpak-builder`` é executado:
zh_cn: 当 ``flatpak-builder`` 运行的时候：

source: The build directory is created, if it doesn't already exist
de: Das Build-Verzeichnis wird erzeugt, sofern es noch nicht existiert.
pt_br: O diretório de compilação é criado, se ainda não existir
zh_cn: 构建目录如果不存在则进行创建

source: The source code for each module is downloaded and verified
de: Der Quellcode wird für jedes Modul heruntergeladen und verifiziert.
pt_br: O código-fonte de cada módulo é baixado e verificado
zh_cn: 下载和验证每个模块的源代码

source: The source code for each module is built and installed
de: Der Quellcode wird für jedes Modul kompiliert und installiert.
pt_br: O código-fonte de cada módulo é compilado e instalado
zh_cn: 构建和安装每个模块的源代码

source: The build is finished by setting sandbox permissions
pt_br: A compilação é concluída definindo permissões de sandbox

source: The build result is exported to a repository (which will be created if it doesn't exist already)
de: Das Resultat des Erstellungsprozesses wird zu einem Repository exportiert (welches erzeugt wird, wenn es nicht bereits existiert).
pt_br: O resultado da compilação é exportado para um repositório (que será criado se ele ainda não existir)
zh_cn: 构建结果会被导出到仓库（如果不存在将会被创建）

source: The application can then be installed from the repository and run.
de: Die Anwendung kann vom Repository aus installiert und anschließend gestartet werden.
pt_br: O aplicativo pode ser instalado a partir do repositório e executado.
zh_cn: 然后这个应用就可以从仓库进行安装和运行了

source: Software Development Kits (SDKs)
pt_br: Kit de desenvolvimento de software (SDKs)
zh_cn: 软件开发套件（SDKs）

source: Instead of being built using the host environment, Flatpak applications are built inside a separate environment, called an SDK.
de: Für den Erstellungsprozess wird nicht das Gastsystem verwendet, anstelle dessen werden Flatpak-Anwendungen innerhalb einer separaten Umgebung erzeugt, dem SDK.
pt_br: Em vez de serem criados usando o ambiente host, os aplicativos Flatpak são criados dentro de um ambiente separado, chamado SDK (do inglês, “Software Development Kit”).
zh_cn: Flatpak应用是在一个称作SDK的隔离环境中，而不是宿主的环境中构建的。

source: SDKs are like the regular runtime that applications run in. The difference is that SDKs also include all the development resources and tools that are required to build an application, such as build and packaging tools, header files, compilers and debuggers.
de: SDKs sind wie die regulären Laufzeitumgebungen in denen Anwendungen laufen. Der Unterschied ist, dass SDKs zusätzlich alle Entwicklungs-Ressourcen beinhalten und Tools, die benötigt werden, um eine Anwendung zu erzeugen, sowie Tools für die Erstellung und Paketierung, Header-Dateien, Compiler und Debugger.
pt_br: Os SDKs são como runtimes comuns nos quais os aplicativos são executados. A diferença é que os SDKs também incluem todos os recursos e ferramentas de desenvolvimento necessários para compilar um aplicativo, como ferramentas de compilação e empacotamento, arquivos de cabeçalho, compiladores e depuradores.
zh_cn: 这些SDK类似与应用所运行在的常规运行时。不同的是，这些SDK还包含了构建一个应用需要的所有开发资源和工具，例如构建和打包工具、头文件、编译器和调试器

source: Each runtime has an accompanying SDK. For example, there is both a GNOME 3.26 runtime and a GNOME 3.26 SDK. Applications that use the runtime are built with the matching SDK.
pt_br: Cada runtime possui um SDK que o acompanha. Por exemplo, existe um runtime do GNOME 3.26 e um SDK do GNOME 3.26. Os aplicativos que usam o runtime são criados com o SDK correspondente.

source: Like runtimes, SDKs will sometimes be automatically installed for you, but if you do need to manually install them, they are installed in the same way as applications and runtimes, such as::
pt_br: Como os runtimes, às vezes os SDKs serão automaticamente instalados para você, mas se você precisar instalá-los manualmente, eles serão instalados da mesma maneira que os aplicativos e os runtimes, como::
