Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/conventions.po
Languages: pt_br, ru, zh_cn

source: Qt: provides access to XDG base directories with the `QStandardPaths Class <https://doc.qt.io/qt-5/qstandardpaths.html>`_
pt_br: Qt: fornece acesso aos diretórios base XDG com a `classe QStandardPaths <https://doc.qt.io/qt-5/qstandardpaths.html>`_
ru: Qt: предоставляет доступ к базовым каталогам XDG с помощью QStandardPaths <https://doc.qt.io/qt-5/qstandardpaths.html>`_

source: However, applications that aren't using one of these toolkits can expect to find their XDG base directories in the following locations:
pt_br: No entanto, os aplicativos que não estão usando um desses kits de ferramentas podem esperar encontrar seus diretórios base XDG nos seguintes locais:
ru: Однако приложения, которые не используют один из этих наборов инструментов, могут найти свои базовые каталоги XDG в следующих местах:
zh_cn: 如果应用没有使用上述工具包，也可以通过下面的方式找到XDG基本目录：

source: Base directory
pt_br: Diretório base
ru: Базовый каталог
zh_cn: 基本目录

source: Usage
pt_br: Uso
ru: Применение
zh_cn: 用途

source: Default location
pt_br: Local padrão
ru: Местоположение по умолчанию
zh_cn: 默认位置

source: User-specific configuration files
pt_br: Arquivos de configuração específicos do usuário
ru: Пользовательские файлы конфигурации
zh_cn: 具体用户配置文件

source: User-specific data
pt_br: Dados específicos do usuário
ru: Пользовательские данные
zh_cn: 具体用户数据

source: Non-essential user-specific data
pt_br: Dados não essenciais específicos do usuário
ru: Несущественные пользовательские данные
zh_cn: Non-essential user-specific data（非基本具体用户数据，译者注）

source: State data such as undo history
pt_br: Dados de estado, tais como histórico de desfazimento
ru: Данные состояния, такие как история отмен

source: For example, GNOME Dictionary will store user-specific data in::
pt_br: Por exemplo, Dicionário do GNOME vai armazenar dados específicos do usuário em::
ru: Например, словарь GNOME будет хранить пользовательские данные в::
zh_cn: 举个例子，GNOME Dictionary会把具体用户数据存放在::

source: Note that applications can be configured to use non-default base directory locations (see :doc:`sandbox-permissions`).
pt_br: Observe que os aplicativos podem ser configurados para usar locais de diretório base diferente do padrão (consulte :doc:`sandbox-permissions`).
ru: Обратите внимание, что приложения могут быть настроены на использование базовых каталогов не по умолчанию (см. :doc:`разрешения для песочницы`).
zh_cn: 注意应用可以被配置成使用非默认基本目录（见 :doc:`sandbox-permissions`)。

source: Note that ``$XDG_STATE_HOME`` is only supported by Flatpak 1.13 and later. If your app needs to work on earlier versions of Flatpak, you can use the ``--persist=.local/state`` and ``--unset-env=XDG_STATE_HOME`` finish args so the app will use the correct directory, even after Flatpak is later upgraded to >1.13.
ru: Обратите внимание, что ``$XDG_STATE_HOME`` поддерживается только Flatpak 1.13 и более поздними версиями. Если вашему приложению необходимо работать с более ранними версиями Flatpak, вы можете использовать аргументы завершения ``--persist=.local/state`` и ``--unset-env=XDG_STATE_HOME``, чтобы приложение использовало правильный каталог. , даже после того, как Flatpak позже был обновлен до > 1.13.

source: ``org.example.desktop``
pt_br: ``org.exemplo.desktop``

source: ~/.var/app/<app-id>/config
pt_br: ~/.var/app/<id-aplicativo>/config

source: ~/.var/app/<app-id>/data
pt_br: ~/.var/app/<id-aplicativo>/data

source: ~/.var/app/<app-id>/cache
pt_br: ~/.var/app/<id-aplicativo>/cache

source: ~/.var/app/<app-id>/.local/state
pt_br: ~/.var/app/<id-aplicativo>/.local/state

source: AppData files provide metadata about applications, which is used by application stores (such as Flathub, GNOME Software and KDE Discover). The `Freedesktop AppStream specification <https://www.freedesktop.org/software/appstream/docs/>`_ provides a complete reference for providing AppData.
zh_cn: APPData文件提供了应用的元数据，可以被应用商店使用（例如Flathub、GNOME Software和KDE Discover）。 `Freedesktop AppStream specification <https://www.freedesktop.org/software/appstream/docs/>`_ （APPStream规范）提供了一个AppData的完整参考。

source: AppData files should be named with the application ID and the ``.appdata.xml`` file extension, and should be placed in ``/app/share/metainfo/``. For example::
zh_cn: AppData文件应该以应用的ID命名，并以 ``.appdata.xml`` 为文件扩展名，应该放在 ``/app/share/metainfo/`` 。举个例子::

source: Applications are expected to provide an application icon, which is used for their application launcher. These icons should be provided in accordance with the `Freedesktop icon specification <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_.
zh_cn: 应用需要提供一个图标，用于应用启动器。这些图标应当与 `Freedesktop icon specification <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_ （Freedesktop图标规范）一致。

source: Desktop files are used to provide the desktop environment with information about each application. The `Freedesktop specification <https://standards.freedesktop.org/desktop-entry-spec/latest/>`_ provides a complete reference for writing desktop files, and `additional information about them <https://wiki.archlinux.org/index.php/desktop_entries>`_ is available online.
zh_cn: desktop文件用于向桌面环境报告每个应用程序的相关信息。`Freedesktop specification <https://standards.freedesktop.org/desktop-entry-spec/latest/>`_ 提供了编写desktop文件的完整指南，您也可以在 `ArchLinux Wiki <https://wiki.archlinux.org/index.php/desktop_entries>`_ 上找到更多信息。

source: `XDG base directories <https://standards.freedesktop.org/basedir-spec/basedir-spec-latest.html>`_ are standard locations for user-specific application data. Popular toolkits provide convenience functions for accessing XDG base directories. These include:
zh_cn: `XDG基本目录 <https://standards.freedesktop.org/basedir-spec/basedir-spec-latest.html>`_ 指定用户应用数据的位置标准。很多工具包都提供了访问XDG基本目录的快捷方法。如:
