Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/conventions.po
Languages: pt_br, ru, zh_cn

source: Requirements & Conventions
pt_br: Requisitos & convenções
ru: Требования и соглашения
zh_cn: 要求与规范

source: Flatpak deliberately makes as few requirements of applications as possible. However, a small number of standard Linux desktop conventions are expected, primarily to ensure that applications integrate with Linux desktops and app centers. Developers might also encounter a small number of Linux technical conventions.
pt_br: O Flatpak deliberadamente possui o menor número de requisitos de aplicativos possível. No entanto, é esperado um pequeno número de convenções padrão de desktops Linux, principalmente para garantir que os aplicativos se integrem aos desktops e centros de aplicativos Linux. Os desenvolvedores também podem encontrar um pequeno número de convenções técnicas do Linux.
ru: Flatpak сознательно делает как можно меньше требований к приложениям. Однако ожидается небольшое количество стандартных соглашений о рабочих столах Linux, в первую очередь для обеспечения интеграции приложений с рабочими столами Linux и центрами приложений. Разработчики также могут столкнуться с небольшим количеством технических соглашений Linux.
zh_cn: Flatpak尽可能不对应用程序作出限制。不过，开发者应当尽可能遵循标准Linux桌面的规范，这主要是为了应用程序能更好地集成到Linux桌面和应用中心（App Center）。开发者也应尽可能遵循Linux技术规范。

source: Information on further desktop integration options can be found in :doc:`desktop-integration`.
pt_br: Informações sobre outras opções de integração de desktop podem ser encontradas em :doc:`desktop-integration`.
ru: Информацию о дополнительных возможностях интеграции с рабочим столом можно найти в :doc:`desktop-integration`.
zh_cn: 更多有关桌面集成的选项可以参考 :doc:`desktop-integration`。

source: Expected Standards
pt_br: Padrões esperados
ru: Ожидаемые стандарты
zh_cn: 应当遵循的标准

source: Applications that use Flatpak are generally expected to comply with the following standards. Applications that have previously targeted the Linux desktop will typically need to make very few (if any) changes to do this.
pt_br: Geralmente, espera-se que os aplicativos que usam o Flatpak cumpram os seguintes padrões. Os aplicativos que já tinham como alvo a área de trabalho Linux normalmente precisam fazer muito poucas alterações (se houver) para fazer isso.
ru: Обычно ожидается, что приложения, использующие Flatpak, будут соответствовать следующим стандартам. Приложениям, которые ранее были ориентированы на рабочий стол Linux, для этого обычно потребуется внести очень мало изменений (если они вообще будут внесены).
zh_cn: 使用Flatpak构建的应用应当遵循下列标准。一般而言，为Linux桌面设计的应用程序只需做少数改动即可符合这些标准。

source: Application IDs
pt_br: IDs de aplicativo
ru: Идентификаторы приложений
zh_cn: 应用ID

source: As described in :doc:`using-flatpak`, Flatpak requires each application to have a unique identifier, which has a form such as ``org.gnome.Dictionary``.
ru: Как описано в :doc:`using-flatpak`, Flatpak требует, чтобы каждое приложение имело уникальный идентификатор, который имеет такую форму, как ``org.gnome.Dictionary``.

source: The format is in reverse-DNS style so the first section should be a domain controlled by the project and the trailing section represents the specific project. There are some exceptions to this, such as extensions using the base application-id of the project they extend rather than their own.
pt_br: O formato está no estilo DNS reverso, portanto, a primeira seção deve ser um domínio controlado pelo projeto e a seção final representa o projeto específico. Existem algumas exceções a isso, como extensões que usam o ID de aplicativo base do projeto que elas estendem em vez de suas próprias.
ru: Формат выполнен в стиле обратного DNS, поэтому первый раздел должен быть доменом, контролируемым проектом, а завершающий раздел представляет конкретный проект. Есть некоторые исключения из этого, такие как расширения, использующие базовый идентификатор приложения проекта, который они расширяют, а не свой собственный.

source: As will be seen below and in future sections, this ID is expected to be used in a number of places. Developers must follow the standard `D-Bus naming conventions for bus names <https://dbus.freedesktop.org/doc/dbus-specification.html#message-protocol-names>`_ when creating their own IDs. This format is already recommended by the `Desktop File specification <https://specifications.freedesktop.org/desktop-entry-spec/desktop-entry-spec-latest.html#file-naming>`_ and `Appstream specification <https://www.freedesktop.org/software/appstream/docs/chap-Metadata.html#sect-Metadata-GenericComponent>`_ also.
pt_br: Como será visto abaixo e em seções futuras, espera-se que esse ID seja usado em vários lugares. Os desenvolvedores devem seguir as `convenções de nomenclatura D-Bus padrão para nomes de barramento <https://dbus.freedesktop.org/doc/dbus-specification.html#message-protocol-names>`_ ao criar seus próprios IDs. Este formato já é recomendado pela `especificação do arquivo de desktop <https://specifications.freedesktop.org/desktop-entry-spec/desktop-entry-spec-latest.html#file-naming>`_ e pela `especificação do Appstream <https ://www.freedesktop.org/software/appstream/docs/chap-Metadata.html#sect-Metadata-GenericComponent>`_ também.
ru: Как будет показано ниже и в следующих разделах, ожидается, что этот идентификатор будет использоваться в ряде мест. Разработчики должны следовать стандартным соглашениям об именах D-Bus для имен шин <https://dbus.freedesktop.org/doc/dbus-specification.html#message-protocol-names>`_ при создании своих собственных идентификаторов. Этот формат уже рекомендован `Спецификацией файла рабочего стола <https://specifications.freedesktop.org/desktop-entry-spec/desktop-entry-spec-latest.html#file-naming>`_ и `Спецификацией потока приложений <https ://www.freedesktop.org/software/appstream/docs/chap-Metadata.html#sect-Metadata-GenericComponent>`_.

source: For some practical examples of bad IDs
pt_br: Para alguns exemplos práticos de IDs inválidos
ru: Некоторые практические примеры плохих идентификаторов

source: This is a bad ID because the Appstream standard for legacy reasons treats IDs ending with ``.desktop`` as a special case causing inconsistency. For this same reason, ``.Desktop`` suffixes should not be used for newly named applications. Don't hesitate to repeat the application name even if it already is part of the domain name section of the identifier (eg. ``org.example.Example``).
pt_br: Esse é um ID incorreto porque o padrão Appstream por motivos legados trata os IDs que terminam com ``.desktop`` como um caso especial que causa inconsistência. Por esse mesmo motivo, os sufixos ``.Desktop`` não devem ser usados para aplicativos recém-nomeados. Não hesite em repetir o nome do aplicativo, mesmo que ele já faça parte da seção de nomes de domínio do identificador (por exemplo, ``org.exemplo.Exemplo``).
ru: Это неправильный идентификатор, поскольку стандарт Appstream по устаревшим причинам рассматривает идентификаторы, оканчивающиеся на ``.desktop``, как особый случай, вызывающий несогласованность. По этой же причине суффиксы ``.Desktop`` не следует использовать для новых названий приложений. Не стесняйтесь повторять имя приложения, даже если оно уже является частью раздела доменного имени идентификатора (например, ``org.example.Example``).

source: This is problematic because while ``foo.github.io`` may be unique to your project, it does not include a project-specific identifier. This may cause issues if another project creates ``io.github.Foo-Bar`` which should be its own namespace but areas of ``flatpak`` may treat them similar. A better ID would be ``io.github.foo.Foo`` even if it is redundant.
ru: Это проблематично, потому что, хотя ``foo.github.io`` может быть уникальным для вашего проекта, он не включает в себя идентификатор проекта. Это может вызвать проблемы, если другой проект создаст io.github.Foo-Bar, который должен быть собственным пространством имен, но области flatpak могут относиться к ним одинаково. Лучшим идентификатором будет io.github.foo.Foo, даже если он избыточен.

source: This ID is not valid according to the DBus specification. You can use ``org.example_site.Foo`` instead.
ru: Этот идентификатор недействителен в соответствии со спецификацией DBus. Вместо этого вы можете использовать org.example_site.Foo.

source: While a project may be hosted on GitHub or GitLab it does not have any control over the ``github.com`` or ``gitlab.com`` domain. Instead you should use ``io.github`` or ``io.gitlab`` as shown above.
pt_br: Embora um projeto possa estar hospedado no GitHub ou GitLab, ele não tem controle sobre o domínio ``github.com`` ou ``gitlab.com``. Em vez disso, você deve usar o ``io.github`` ou ``io.gitlab`` como mostrado acima.
ru: Хотя проект может быть размещен на GitHub или GitLab, он не имеет никакого контроля над доменом ``github.com`` или ``gitlab.com``. Вместо этого вы должны использовать ``io.github`` или ``io.gitlab`` как показано выше.

source: AppData files
ru: Файлы AppData
zh_cn: AppData文件

source: AppData files provide metadata about applications, which is used by application stores (such as Flathub, GNOME Software and KDE Discover). The `Freedesktop AppStream specification <https://www.freedesktop.org/software/appstream/docs/>`_ provides a complete reference for providing AppData. You can use the online `AppStream MetaInfo Creator <https://www.freedesktop.org/software/appstream/metainfocreator/>`_ to generate a basic file.
ru: Файлы AppData предоставляют метаданные о приложениях, которые используются магазинами приложений (такими как Flathub, GNOME Software и KDE Discover). `Спецификация Freedesktop AppStream <https://www.freedesktop.org/software/appstream/docs/>`_ содержит полный справочник по предоставлению AppData. Вы можете использовать онлайн-редактор AppStream MetaInfo Creator <https://www.freedesktop.org/software/appstream/metainfocreator/>`_ для создания базового файла.

source: AppData files should be named with the application ID and the ``.metainfo.xml`` file extension, and should be placed in ``/app/share/metainfo/``. For example::
ru: Файлы AppData должны называться с идентификатором приложения и расширением файла ``.metainfo.xml`` и должны быть помещены в ``/app/share/metainfo/``. Например::

source: A legacy convention of having the ``.appdata.xml`` installed in ``/app/share/appdata`` is also accepted as well, and ``flatpak-builder`` will check either directory with either extension.
pt_br: Uma convenção legada de ter o ``.appdata.xml`` instalado em ``/app/share/appdata`` também é aceita, e o ``flatpak-builder`` verificará qualquer diretório com qualquer extensão.
ru: Устаревшее соглашение об установке ``.appdata.xml`` в ``/app/share/appdata`` также принимается, и ``flatpak-builder`` будет проверять любой каталог с любым расширением.

source: The ``appstream-util validate-relax`` command can be used to check AppData files for errors.
ru: Команду ``appstream-util validate-relax `` можно использовать для проверки файлов AppData на наличие ошибок.
zh_cn: ``appstream-util vlidate-relax`` 命令可以用于检查AppData文件的错误

source: Application icons
pt_br: Ícones de aplicativo
ru: Значки приложений
zh_cn: 应用图标

source: Applications are expected to provide an application icon, which is used for their application launcher. These icons should be provided in accordance with the `Freedesktop icon specification <https://specifications.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_.
pt_br: Espera-se que os aplicativos forneçam um ícone de aplicativo, usado para seu iniciador. Esses ícones devem ser fornecidos de acordo com a `especificação do ícones do Freedesktop <https://specifications.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_.
ru: Ожидается, что приложения будут предоставлять значок приложения, который используется для запуска их приложений. Эти значки должны предоставляться в соответствии со спецификацией значков Freedesktop <https://specifications.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_.

source: Icons should be named with the application's ID, be in either PNG or SVG format, and must be placed in the standard location::
pt_br: Os ícones devem ser nomeados com o ID do aplicativo, estar no formato PNG ou SVG e devem ser colocados no local padrão::
ru: Иконки должны называться с идентификатором приложения, быть в формате PNG или SVG и должны быть размещены в стандартном месте::
zh_cn: 图标应该以应用ID命名，以PNG或者SVG格式，而且必须放在标准的位置::

source: For example, the path to the 128✕128px version of GNOME Dictionary's icon is::
pt_br: Por exemplo, o caminho para a versão 128✕128px do ícone do Dicionário do GNOME é::
ru: Например, путь к версии значка GNOME Dictionary размером 128✕128 пикселей::
zh_cn: 举个例子，128x128px版本的GNOME Dictionary的图标的路径应该是：

source: Icons must be square shaped, ie their width and height must be the same. The maximum size allowed by the specification is 512x512px. SVG icons are of size ``scalable``::
pt_br: Ícones devem estar em formato de quadrados, ou seja, sua largura e sua altura devem ser iguais. O tamanho máximo permitido pela especificação é 512x512px. Ícones SVG têm o tamanho ``scalable``::
ru: Иконки должны быть квадратной формы, т.е. их ширина и высота должны быть одинаковыми. Максимальный размер, разрешенный спецификацией, составляет 512x512px. SVG иконки имеют размер ``масштабируемый``::

source: Desktop files
pt_br: Arquivos desktop
ru: Файлы рабочего стола
zh_cn: desktop文件

source: Desktop files are used to provide the desktop environment with information about each application. The `Freedesktop specification <https://specifications.freedesktop.org/desktop-entry-spec/latest/>`_ provides a complete reference for writing desktop files, and `additional information about them <https://wiki.archlinux.org/title/desktop_entries>`_ is available online.
pt_br: Os arquivos desktop são usados para fornecer ao ambiente informações sobre cada aplicativo. A `especificação do Freedesktop <https://specifications.freedesktop.org/desktop-entry-spec/latest/>`_ fornece uma referência completa para a escrita de arquivos desktop e `informações adicionais sobre eles <https://wiki.archlinux. org/title/Entradas_de_desktop>`_ está disponível online.
ru: Файлы рабочего стола используются для предоставления среде рабочего стола информации о каждом приложении. `Спецификация Freedesktop <https://specifications.freedesktop.org/desktop-entry-spec/latest/>`_ предоставляет полный справочник по написанию файлов рабочего стола и `дополнительную информацию о них <https://wiki.archlinux.org/title/desktop_entries>`_ доступен онлайн.

source: Desktop files should be named with the application's ID, followed by the ``.desktop`` file extension, and should be placed in ``/app/share/applications/``. For example::
pt_br: Os arquivos desktop devem ser nomeados com o ID do aplicativo, seguido pela extensão do arquivo ``.desktop``, e devem ser colocados em ``/app/share/applications/``. Por exemplo::
ru: Файлы рабочего стола должны называться с идентификатором приложения, за которым следует расширение файла ``.desktop``, и должны быть помещены в ``/app/share/applications/``. Например::
zh_cn: desktop文件应该以应用的ID命名，以 ``.desktop`` 为文件扩展名，而且应该放在 ``/app/share/applications/`` 。举个例子::

source: A minimal desktop file should contain at least the application's *name*, *exec* command, *type*, *icon* name and *categories*::
pt_br: Um arquivo desktop mínimo deve conter pelo menos o comando *name*, *exec* do aplicativo, *type*, nome do ícone em *icon* e *categories*::
ru: Минимальный файл рабочего стола должен содержать как минимум *имя* приложения, команду *exec*, *тип*, *имя значка* и *категории*::
zh_cn: 一个desktop文件应当至少包含以下字段： *name*（应用程序名）、*exec*（启动命令）、*type*（类型）、*icon*（图标名）和 *categories* （所属分类）：

source: The ``desktop-file-validate`` command can be used to check for errors in desktop files.
pt_br: O comando ``desktop-file-validate`` pode ser usado para verificar erros nos arquivos desktop.
ru: Команду ``desktop-file-validate`` можно использовать для проверки наличия ошибок в файлах рабочего стола.
zh_cn: ``desktop-file-validate`` 命令可以用来检测desktop文件的错误。

source: Exporting through extra-data
pt_br: Exportando através de extra-data
ru: Экспорт через "дополнительные данные"

source: Files downloaded through ``extra-data`` are only downloaded when installing, as such they aren't yet available for ``flatpak-builder`` to automatically export during the build process.
pt_br: Os arquivos baixados através de ``extra-data`` são baixados apenas durante a instalação, pois ainda não estão disponíveis para o ``flatpak-builder`` exportar automaticamente durante o processo de compilação.
ru: Файлы, загруженные через «extra-data», загружаются только при установке, поэтому они еще недоступны для «flatpak-builder» для автоматического экспорта в процессе сборки.

source: When using ``extra-data``, place any files that must be exported under this location::
pt_br: Ao usar ``extra-data``, coloque todos os arquivos que devem ser exportados neste local::
ru: При использовании «extra-data» поместите все файлы, которые необходимо экспортировать, в это место::

source: For example, if GNOME Dictionary used ``extra-data`` to download a 96x96 icon this would be its path::
pt_br: Por exemplo, se o Dicionário do GNOME usasse ``extra-data`` para baixar um ícone de 96x96, este seria o seu caminho::
ru: Например, если словарь GNOME использовал «extra-data» для загрузки значка 96x96, это будет его путь:

source: Technical conventions
pt_br: Convenções técnicas
ru: Технические соглашения
zh_cn: 技术规范

source: The following are standard technical conventions used by Flatpak and Linux desktops. Those with Linux experience will likely already be aware of them. However, developers who are new to Linux might find some of this information useful.
pt_br: A seguir, são apresentadas convenções técnicas padrão usadas pelos desktops Flatpak e Linux. Aqueles com experiência em Linux provavelmente já estarão cientes deles. No entanto, os desenvolvedores que são novos no Linux podem achar algumas dessas informações úteis.
ru: Ниже приведены стандартные технические соглашения, используемые рабочими столами Flatpak и Linux. Те, у кого есть опыт работы с Linux, вероятно, уже знают о них. Однако разработчикам, которые не знакомы с Linux, часть этой информации может оказаться полезной.
zh_cn: Flatpak和多数Linux桌面都遵循下列标准技术规范。有Linux使用经验的用户对此可能已有了解。首次使用Linux的开发者同样可以在这里找到有用的信息。

source: D-Bus is the standard IPC framework used on Linux desktops. A lot of applications won't need to use it, but it is supported by Flatpak should it be required.
pt_br: D-Bus é o framework IPC padrão usada em desktops Linux. Muitos aplicativos não precisarão usá-lo, mas o Flatpak fornece suporte a ele, caso seja necessário.
ru: D-Bus — это стандартная структура IPC, используемая на настольных компьютерах Linux. Многим приложениям не нужно его использовать, но Flatpak поддерживает его, если это необходимо.
zh_cn: D-Bus是Linux桌面使用的标准IPC（进程间通讯，译者注）框架。大多数应用程序并不会用到D-Bus；但如果需要，Flatpak也同样提供D-Bus支持。

source: D-Bus can be used for application launching and communicating with some system services. Applications can also provide their own D-Bus services (when doing this, the D-Bus service name is expected to be the same as the application ID).
pt_br: O D-Bus pode ser usado para iniciar e se comunicar com alguns serviços do sistema. Os aplicativos também podem fornecer seus próprios serviços D-Bus (ao fazer isso, o nome do serviço D-Bus deve ser o mesmo que o ID do aplicativo).
ru: D-Bus можно использовать для запуска приложений и связи с некоторыми системными службами. Приложения также могут предоставлять свои собственные службы D-Bus (при этом ожидается, что имя службы D-Bus будет таким же, как идентификатор приложения).
zh_cn: D-Bus可用于启动应用程序，以及系统服务之间的交互。应用程序也可以实现它们自己的D-Bus服务（此时，D-Bus服务的名称必须与应用程序的ID一致）。

source: Filesystem layout
pt_br: Layout de sistema de arquivos
ru: Схема файловой системы
zh_cn: Filesystem layout（文件系统布局，译者注）

source: Each Flatpak sandbox, which is the environment in which an application is run, contains the filesystem of the application's runtime. This follows `standard Linux filesystem conventions <https://en.wikipedia.org/wiki/Filesystem_Hierarchy_Standard>`_.
pt_br: Cada sandbox do Flatpak, que é o ambiente em que um aplicativo é executado, contém o sistema de arquivos do runtime do aplicativo. Isto segue as `convenções padrão do sistema de arquivos Linux <https://pt.wikipedia.org/wiki/Filesystem_Hierarchy_Standard>`_.
ru: Каждая песочница Flatpak, представляющая собой среду, в которой запускается приложение, содержит файловую систему среды выполнения приложения. Это соответствует `стандартным соглашениям о файловой системе Linux <https://en.wikipedia.org/wiki/Filesystem_Hierarchy_Standard>`_.
zh_cn: 每个Flatpak沙箱，一个应用运行的环境，包含这个应用的运行时的文件系统。这个准守 `standard Linux filesystem conventions <https://en.wikipedia.org/wiki/Filesystem_Hierarchy_Standard>`_ （标准Linux文件系统约定，译者注）。

source: For example, the root of the sandbox contains the ``/etc`` directory for configuration files and ``/usr`` for multi-user utilities and applications. In addition to this, each sandbox contains a top-level ``/app`` directory, which is where the application's own files are located.
pt_br: Por exemplo, a raiz do sandbox contém o diretório ``/etc`` para arquivos de configuração e ``/usr`` para utilitários e aplicativos multiusuário. Além disso, cada sandbox contém um diretório ``/app`` de nível superior, onde os arquivos do aplicativo estão localizados.
ru: Например, корень песочницы содержит каталог ``/etc`` для файлов конфигурации и ``/usr`` для многопользовательских утилит и приложений. В дополнение к этому каждая песочница содержит каталог верхнего уровня ``/app``, в котором находятся собственные файлы приложения.
zh_cn: 举个例子，沙箱根目录包含 ``/etc`` 用于配置文件和 ``/usr`` 用于多用户utilities和应用。除此之外，每个沙箱包含一个顶级 ``/app/`` 目录，用于应用自己文件的存放。

source: XDG base directories
pt_br: Diretórios base XDG
ru: Базовые каталоги XDG
zh_cn: XDG基本目录

source: `XDG base directories <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`_ are standard locations for user-specific application data. Popular toolkits provide convenience functions for accessing XDG base directories. These include:
pt_br: `Diretórios base XDG <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`_ são locais padrão para dados de aplicativos específicos do usuário. Os kits de ferramentas populares fornecem funções de conveniência para acessar os diretórios base do XDG. Esses incluem:
ru: `Базовые каталоги XDG <https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html>`_ являются стандартными расположениями для данных приложений, специфичных для пользователя. Популярные наборы инструментов предоставляют удобные функции для доступа к базовым каталогам XDG. К ним относятся:

source: Electron: XDG base directories can be accessed with ``app.getPath``
pt_br: Electron: os diretórios base XDG podem ser acessados com ``app.getPath``
ru: Electron: доступ к базовым каталогам XDG можно получить с помощью ``app.getPath``
zh_cn: Electron: 使用 ``app.getPath`` 访问XDG基本目录

source: Glib: provides access to the XDG base directories through the ``g_get_user_cache_dir ()``, ``g_get_user_data_dir ()``, ``g_get_user_config_dir ()`` functions
pt_br: Glib: fornece acesso aos diretórios base XDG através das funções ``g_get_user_cache_dir ()``, ``g_get_user_data_dir ()`` e ``g_get_user_config_dir ()``
ru: Glib: обеспечивает доступ к базовым каталогам XDG через функции ``g_get_user_cache_dir()``, ``g_get_user_data_dir()``, ``g_get_user_config_dir()``
zh_cn: Glib: 通过 ``g_get_user_cache_dir ()``, ``g_get_user_data_dir ()``, ``g_get_user_config_dir ()`` 函数访问XDG基本目录
