Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/debugging.po
Languages: pt_br, ru

source: Debugging
pt_br: Depuração
ru: Отладка

source: This section includes documentation on how to debug Flatpak apps.
pt_br: Esta seção inclui documentação sobre como depurar aplicativos Flatpak.
ru: Этот раздел включает документацию по отладке приложений Flatpak.

source: Running debugging tools
pt_br: Executando ferramentas de depuração
ru: Запуск инструментов отладки

source: Because Flatpak runs each application inside a sandbox, debugging tools can't be used in the usual way, and must instead be run from inside the sandbox. To get a shell inside an application's sandbox, it can be run with the ``--command`` option::
pt_br: Como o Flatpak executa cada aplicativo dentro de um sandbox, as ferramentas de depuração não podem ser usadas da maneira usual e, em vez disso, devem ser executadas de dentro do sandbox. Para colocar um shell na sandbox de um aplicativo, ele pode ser executado com a opção ``--command``::
ru: Поскольку Flatpak запускает каждое приложение в песочнице, инструменты отладки нельзя использовать обычным способом, и вместо этого их нужно запускать из песочницы. Чтобы поместить оболочку в песочницу приложения, ее можно запустить с параметром ``--command``::

source: This creates a sandbox for the application with the given ID and, instead of running the application, runs a shell inside the sandbox. From the shell prompt, it is then possible to run the application. This can also be done using any debugging tools that you want to use. For example, to run the application with ``gdb``::
pt_br: Isso cria um sandbox para o aplicativo com o ID fornecido e, em vez de executá-lo, executa um shell dentro do sandbox. No prompt do shell, é possível executar o aplicativo. Isso também pode ser feito usando as ferramentas de depuração que você deseja usar. Por exemplo, para executar o aplicativo com ``gdb``::
ru: Это создает песочницу для приложения с заданным идентификатором и вместо запуска приложения запускает оболочку внутри песочницы. Затем из командной строки можно запустить приложение. Это также можно сделать с помощью любых инструментов отладки, которые вы хотите использовать. Например, чтобы запустить приложение с ``gdb``::

source: This works because the ``--devel`` option tells Flatpak to use the SDK as the runtime, which includes debugging tools like ``gdb``. The ``--devel`` option also adjusts the sandbox setup to enable debugging.
pt_br: Isso funciona porque a opção ``--devel`` diz ao Flatpak para usar o SDK como runtime, o que inclui ferramentas de depuração como ``gdb``. A opção ``--devel`` também ajusta a configuração da sandbox para ativar a depuração.
ru: Это работает, потому что опция ``--devel`` указывает Flatpak использовать SDK в качестве среды выполнения, которая включает инструменты отладки, такие как ``gdb``. Параметр ``--devel`` также регулирует настройку песочницы для включения отладки.

source: The Freedesktop SDK (on which many others are based), includes a range of debugging tools, such as ``gdb``, ``strace``, ``nm``, ``dbus-send``, ``dconf``, and many others.
pt_br: O SDK do Freedesktop (no qual muitos outros se baseiam) inclui uma variedade de ferramentas de depuração, como ``gdb``, ``strace``, ``nm``, ``dbus-send``, ``dconf `` e muitos outros.
ru: Freedesktop SDK (на котором основаны многие другие) включает ряд инструментов отладки, таких как ``gdb``, ``strace``, ``nm``, ``dbus-send``, ``dconf`` и многие другие.

source: ``gdb`` is much more useful when it has access to debug information for the application and the runtime it is using. Flatpak splits this information off into debug extensions, which you should install before debugging an application::
pt_br: ``gdb`` é muito mais útil quando ele tem acesso a informações de depuração para o aplicativo e o runtime que está usando. O Flatpak divide essas informações em extensões de depuração, que você deve instalar antes de depurar um aplicativo::
ru: ``gdb`` гораздо более полезен, когда у него есть доступ к отладочной информации для приложения и используемой среды выполнения. Flatpak разделяет эту информацию на отладочные расширения, которые вы должны установить перед отладкой приложения::

source: When the ``--devel`` option is used, Flatpak will automatically use any matching debug extensions that it finds.
pt_br: Quando a opção ``--devel`` é usada, o Flatpak automaticamente usa as extensões de depuração correspondentes que encontrar.
ru: Когда используется параметр ``--devel``, Flatpak автоматически использует любые подходящие расширения отладки, которые он находит.

source: It is also possible to get a shell inside an application sandbox without having to install it. This is done using ``flatpak-builder``'s ``--run`` option::
pt_br: Também é possível obter um shell dentro de um sandbox de aplicativos sem precisar instalá-lo. Isso é feito usando a opção ``--run`` do ``flatpak-builder``::
ru: Также возможно получить оболочку внутри песочницы приложения без ее установки. Это делается с помощью параметра ``flatpak-builder``'s ``--run``::

source: This sets up a sandbox that is populated with the build results found in the build directory, and runs a shell inside it.
pt_br: Isso configura um sandbox que é preenchido com os resultados da compilação encontrados no diretório de compilação e executa um shell dentro dele.
ru: Это устанавливает песочницу, которая заполняется результатами сборки, найденными в каталоге сборки, и запускает оболочку внутри нее.

source: Creating a .Debug extension
pt_br: Criando uma extensão .Debug
ru: Создание расширения .Debug

source: Like many other packaging systems, Flatpak separates bulky debug information from regular content and ships it separately, in what is called a ``.Debug`` extension.
pt_br: Como muitos outros sistemas de empacotamento, o Flatpak separa informações volumosas de depuração do conteúdo normal e as envia separadamente, no que é chamado de extensão ``.Debug``.
ru: Как и многие другие системы упаковки, Flatpak отделяет объемную отладочную информацию от обычного контента и отправляет ее отдельно в так называемом расширении .Debug.

source: When an application is built, ``flatpak-builder`` automatically creates a ``.Debug`` extension. This can be disabled with the ``no-debuginfo`` option.
pt_br: Quando um aplicativo é compilado, o ``flatpak-builder`` cria automaticamente uma extensão ``.Debug``. Isso pode ser desativado com a opção ``no-debuginfo``.
ru: Когда приложение построено, ``flatpak-builder`` автоматически создает расширение ``.Debug``. Это можно отключить с помощью опции ``no-debuginfo``.

source: Overriding sandbox permissions
pt_br: Sobrepondo permissões de sandbox
ru: Переопределение разрешений песочницы

source: It is sometimes useful to have extra permissions in a sandbox when debugging. This can be achieved using the various sandbox options that are accepted by the run command. For example::
pt_br: Às vezes, é útil ter permissões extras em uma sandbox durante a depuração. Isso pode ser alcançado usando as várias opções de sandbox que são aceitas pelo comando de execução. Por exemplo::
ru: Иногда бывает полезно иметь дополнительные разрешения в песочнице при отладке. Этого можно добиться с помощью различных параметров песочницы, которые принимает команда запуска. Например::

source: This command runs a shell in the sandbox for the given application, granting it system bus access to the bus name owned by logind.
pt_br: Este comando executa um shell na sandbox para o aplicativo fornecido, concedendo a ele acesso ao barramento do sistema ao nome do barramento pertencente a logind.
ru: Эта команда запускает оболочку в изолированной программной среде для данного приложения, предоставляя ему доступ к системной шине с именем шины, принадлежащим logind.

source: Inspecting portal permissions
pt_br: Inspecionando permissões do portal
ru: Переопределение разрешений песочницы

source: Flatpak has a number of commands that allow to manage portal permissions for applications.
pt_br: O Flatpak possui vários comandos que permitem gerenciar permissões do portal para aplicativos.
ru: Flatpak имеет ряд команд, позволяющих управлять разрешениями портала для приложений.

source: To see all portal permissions of an application, use::
pt_br: Para ver todas as permissões de portal de um aplicativo, use::
ru: Чтобы увидеть все права доступа приложения к порталу, используйте::

source: To reset all portal permissions of an application, use::
pt_br: Para redefinir todas as permissões do portal de um aplicativo, use::
ru: Чтобы сбросить все права доступа приложения к порталу, используйте::

source: Interacting with running sandboxes
pt_br: Interagindo com sandboxes em execução
ru: Взаимодействие с запущенными песочницами

source: You can see all the apps that are currently running in Flatpak sandboxes (since 1.2)::
pt_br: Você pode ver todos os aplicativos atualmente em execução nos sandboxes do Flatpak (desde a versão 1.2)::
ru: Вы можете увидеть все приложения, которые в настоящее время работают в песочницах Flatpak (начиная с версии 1.2)::

source: And, if you need to, you can terminate one by force (since 1.2)::
pt_br: E, se necessário, você pode encerrar um à força (desde a versão 1.2)::
ru: И, при необходимости, вы можете прекратить его принудительно (начиная с версии 1.2)::
