Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/dependencies.po
Languages: pt_br, ru, zh_cn

source: Dependencies
pt_br: Dependências
ru: Зависимости
zh_cn: 依赖

source: Flatpak provides a number of different options for how applications can depend on other software. When setting out to build an application with Flatpak for the first time, it is therefore necessary to decide how application dependencies will be organized.
pt_br: O Flatpak fornece várias opções diferentes de como os aplicativos podem depender de outro software. Ao se preparar para criar um aplicativo com o Flatpak pela primeira vez, é necessário decidir como as dependências do aplicativo serão organizadas.
ru: Flatpak предоставляет несколько различных вариантов того, как приложения могут зависеть от другого программного обеспечения. Поэтому, собираясь создать приложение с помощью Flatpak в первый раз, необходимо решить, как будут организованы зависимости приложения.
zh_cn: Flatpak为应用程序如何依赖于其他软件提供了许多不同的选项。在首次开始使用Flatpak构建应用程序时，因此有必要决定如何组织应用程序依赖关系。

source: This page outlines what the options are, and provides guidance on when to use each one.
pt_br: Esta página descreve quais são as opções e fornece orientações sobre quando usar cada uma.
ru: На этой странице описаны возможные варианты и даны инструкции о том, когда их использовать.
zh_cn: 此页面概括了这些选项是什么和在何时使用他们。

source: Runtimes
ru: Среда выполнения
zh_cn: 运行时

source: As was described in :doc:`basic-concepts`, runtimes provide basic dependencies that can be used by applications. They also provide the environment that applications run in. Flatpak requires each application to specify a runtime. Therefore, one of the first decisions you need to make when building an application with Flatpak, is which runtime it will use.
pt_br: Como foi descrito em :doc:`basic-concepts`, os runtimes fornecem dependências básicas que podem ser usadas pelos aplicativos. Eles também fornecem o ambiente em que os aplicativos são executados. O Flatpak requer que cada aplicativo especifique um tunrime. Portanto, uma das primeiras decisões que você precisa tomar ao criar um aplicativo com o Flatpak é qual runtime será usado.
ru: Как было описано в :doc:`basic-concepts`, среды выполнения предоставляют базовые зависимости, которые могут использоваться приложениями. Они также обеспечивают среду, в которой работают приложения. Flatpak требует, чтобы каждое приложение указывало среду выполнения. Следовательно, одно из первых решений, которое вам необходимо принять при создании приложения с помощью Flatpak, - это то, какую среду выполнения оно будет использовать.
zh_cn: 如 :doc:`basic-concepts` 中描述的，运行时提供了应用可以使用的基本依赖。他们提供了应用的运行环境。Flatpack要求每个应用需要指明一个运行时。因此，用Flatpack构建一个应用最先要确定的就是，应用要使用什么运行时。

source: An overview of the runtimes that are available can be found in the :doc:`available-runtimes` page. There are deliberately only a small number of runtimes to choose from. Typically, runtimes are picked on the basis of which dependencies an application requires. If a runtime exists that provides libraries that you plan on using, this is usually the correct runtime to use!
pt_br: Uma visão geral dos runtimes disponíveis pode ser encontrada na página :doc:`available-runtimes`. Deliberadamente, há apenas um pequeno número de runtimes para escolher. Normalmente, os runtimes são escolhidos com base nas dependências requeridas por um aplicativo. Se existe um runtime que fornece bibliotecas que você planeja usar, esse geralmente é o runtime correto a ser usado!
ru: Обзор доступных сред выполнения можно найти на странице :doc:`available-runtimes`. Намеренно сделано так, что есть только небольшое количество сред выполнения на выбор. Обычно среды выполнения выбираются на основе того, какие зависимости требуются приложению. Если существует среда выполнения, которая предоставляет библиотеки, которые вы планируете использовать, обычно это правильная среда выполнения!
zh_cn: 我们可以在 :doc:`available-runtimes` 页面找到可用运行时的概览。有意地，只有少量运行时可供选择。通常，运行时是根据应用程序所需的依赖项来选择的。如果存在一个提供您计划使用的库的运行时，这通常是正确的运行时!

source: Runtimes require regular maintenance, and application developers should generally not consider creating their own.
pt_br: Os runtimes exigem manutenção regular e os desenvolvedores de aplicativos geralmente não devem considerar criar seus próprios.
ru: Среды выполнения требуют регулярного обслуживания, и разработчикам приложений, как правило, не следует создавать собственные.
zh_cn: 运行时需要定期维护，应用程序开发人员通常不应该考虑创建自己的运行时。

source: Runtimes are automatically installed for users when they install an application, and build tools can also automatically install them for you (``flatpak-builder``'s ``--install-deps-from`` option is useful for this). However, if you do need to manually install your chosen runtime, this can be done in the same way as installing an application, with the ``flatpak install`` command. For example, the command to install the GNOME 3.26 runtime is::
pt_br: Os runtimes são instalados automaticamente para os usuários quando eles instalam um aplicativo, e as ferramentas de compilação também podem instalá-los automaticamente para você (a opção ``--install-deps-from`` do ``flatpak-builder`` é útil para isso). No entanto, se você precisar instalar manualmente o runtime escolhido, isso poderá ser feito da mesma maneira que a instalação de um aplicativo, com o comando ``flatpak install``. Por exemplo, o comando para instalar o runtime do GNOME 3.26 é::
ru: Среды выполнения автоматически устанавливаются для пользователей, когда они устанавливают приложение, и инструменты сборки также могут автоматически устанавливать их для вас (для этого полезна опция ``--install-deps-from'' в ``flatpak-builder''). Однако, если вам действительно нужно вручную установить выбранную среду выполнения, это можно сделать так же, как и установку приложения, с помощью команды flatpak install. Например, команда для установки среды выполнения GNOME 3.26::

source: Bundling
pt_br: Empacotamento
ru: Объединение
zh_cn: 构建

source: One of the key advantages of Flatpak is that it allows application authors to bundle whatever libraries or dependencies that they want. This means that developers aren't constrained by which libraries are available through Linux distributions.
pt_br: Uma das principais vantagens do Flatpak é que ele permite que os autores do aplicativo agrupem as bibliotecas ou dependências que desejarem. Isso significa que os desenvolvedores não são limitados pelas bibliotecas disponíveis nas distribuições Linux.
ru: Одним из ключевых преимуществ Flatpak является то, что он позволяет авторам приложений объединять любые библиотеки или зависимости, которые они хотят. Это означает, что разработчики не ограничены тем, какие библиотеки доступны в дистрибутивах Linux.
zh_cn: Flatpak的关键优势之一是它允许应用程序作者捆绑任何他们想要的库或依赖。这意味着开发人员不受某些库只在特定Linux发行版可用的约束。

source: When it comes to building an application for the first time, you will need to decide which dependencies to bundle. This can include:
pt_br: Quando se trata de criar um aplicativo pela primeira vez, você precisa decidir quais dependências pretende agrupar. Isso pode incluir:
ru: Когда дело доходит до создания приложения в первый раз, вам нужно будет решить, какие зависимости нужно связать. Это может включать:
zh_cn: 当首次构建应用的时候，你需要确定绑定哪些依赖。这包括：

source: libraries that aren't in your chosen runtime
pt_br: bibliotecas que não estão no runtime escolhido
ru: библиотеки, которых нет в выбранной вами среде выполнения
zh_cn: 所选运行时不包含的库

source: different versions of libraries that are in your chosen runtime
pt_br: diferentes versões de bibliotecas que estão no runtime escolhido
ru: разные версии библиотек, которые находятся в выбранной вами среде выполнения
zh_cn: 所选运行时库的另一版本

source: patched versions of libraries
pt_br: versões corrigidas (com patches) de bibliotecas
ru: пропатченные версии библиотек
zh_cn: 打了补丁的库

source: data or other resources that form part of the application
pt_br: dados ou outros recursos que fazem parte do aplicativo
ru: данные или другие ресурсы, являющиеся частью приложения
zh_cn: 作为应用一部分的数据或者资源

source: As will be seen, bundled dependencies can be automatically downloaded as part of the build process. It is also possible to apply patches and perform other transformations.
pt_br: Como será visto, as dependências agrupadas podem ser baixadas automaticamente como parte do processo de compilação. Também é possível aplicar patches e executar outras transformações.
ru: Как будет показано ниже, связанные зависимости могут быть автоматически загружены как часть процесса сборки. Также возможно применять патчи и выполнять другие преобразования.
zh_cn: 可以看到，作为构建过程的一部分，捆绑的依赖关系可以自动下载。开发者也可以对他们打补丁，或者作其他的更改。

source: While bundling is very powerful and flexible, it also places a greater maintenance burden on the application developer. Therefore, while it is possible to bundle as much as you would like, it is generally recommended to try and keep the number of bundled modules as low as possible. If a dependency is available as part of a runtime, it is generally better to use that version rather than bundle it yourself.
pt_br: Embora o empacotamento seja muito poderoso e flexível, também impõe uma carga maior de manutenção ao desenvolvedor do aplicativo. Portanto, embora seja possível agrupar o quanto você quiser, geralmente é recomendável tentar manter o número de módulos agrupados o mais baixo possível. Se uma dependência estiver disponível como parte de um runtime, geralmente é melhor usar essa versão do que agrupá-la você mesmo.
ru: Несмотря на то, что объединение является очень мощным и гибким, оно также возлагает большую нагрузку на разработчика приложения. Поэтому, хотя можно объединить столько модулей, сколько захотите, обычно рекомендуется стараться поддерживать как можно меньшее количество связанных модулей. Если зависимость доступна как часть среды выполнения, обычно лучше использовать эту версию, чем связывать ее самостоятельно.
zh_cn: 虽然捆绑非常强大和灵活，但它也给应用程序开发人员带来了更大的维护负担。因此，尽管可以尽可能多地进行打包，但通常建议尽量减少打包模块的数量。如果依赖项作为运行时的一部分并是可用的，通常最好使用该版本，而不是自己打包。

source: The specifics of how to bundle libraries is covered in the :doc:`manifests` section.
pt_br: Os detalhes de como agrupar bibliotecas são abordados na seção :doc:`manifests`.
ru: Специфика объединения библиотек описана в разделе :doc:`manifest`.
zh_cn: 如何捆绑库的细节在 :doc:`mainifests` 可以找到。

source: Base apps
pt_br: Aplicativos base
ru: Базовые приложения
zh_cn: 框架应用

source: Runtimes and bundling are the two main ways in which dependencies are handled with Flatpak. They allow applications to rely on stable collections of dependencies on the one hand, and to have flexibility and control on the other.
ru: Среда выполнения и связывание - два основных способа обработки зависимостей с помощью Flatpak. Они позволяют приложениям полагаться на стабильные наборы зависимостей, с одной стороны, и иметь гибкость и контроль, с другой.

source: However, in some cases, dependencies come as part of a bigger framework or toolkit, which doesn't fit into a runtime but which is also cumbersome to manually bundle as a series of individual modules. This is where *base apps* come in.
pt_br: No entanto, em alguns casos, as dependências são parte de um framework ou kit de ferramentas maior, que não se encaixa em um runtime, mas também é complicado de agrupar manualmente como uma série de módulos individuais. É aqui que entram os aplicativos básicos.
ru: Однако в некоторых случаях зависимости являются частью более крупной структуры или набора инструментов, которые не вписываются в среду выполнения, но также являются громоздкими для ручного объединения в виде серии отдельных модулей. Вот тут-то и пригодятся *base apps*.
zh_cn: 可是，在某些情况下，依赖是一个更大的框架或者工具集，它不适合放进运行时，但手工捆绑成一系列单独的模块也很麻烦。所以有了 *base apps* 。

source: Base apps contain collections of bundled dependencies which can then be bundled as part of an application. They don't get rebuilt as part of the build process, which makes building faster (particularly when bundling large dependencies). And because each base app is only built once, it is guaranteed to be identical wherever it is used, so it will only be saved once on disk.
ru: Базовые приложения содержат коллекции связанных зависимостей, которые затем могут быть объединены как часть приложения. Они не перестраиваются в процессе сборки, что ускоряет сборку (особенно при объединении больших зависимостей). А поскольку каждое базовое приложение создается только один раз, оно гарантированно будет идентичным, где бы оно ни использовалось, поэтому оно будет сохранено на диске только один раз.

source: Base apps are a relatively specialized concept and only some applications need to use them (the most common base app is used for `Electron applications <https://github.com/flathub/io.atom.electron.BaseApp>`_). However, if your application uses a large, complex or specialized framework, it is a good idea to check for available base apps before you start building.
pt_br: Aplicativos base são um conceito relativamente especializado e apenas alguns aplicativos precisam usá-los (o aplicativo base mais comum é usado para aplicativos `Electron <https://github.com/flathub/io.atom.electron.BaseApp>`_). No entanto, se o seu aplicativo usar um framework grande, complexo ou especializado, é uma boa ideia verificar os aplicativos básicos disponíveis antes de começar a compilá-lo.
ru: Базовые приложения - это относительно специализированная концепция, и только некоторые приложения должны их использовать (наиболее распространенное базовое приложение используется для `Electron applications <https://github.com/flathub/io.atom.electron.BaseApp>`_). Однако, если ваше приложение использует большую, сложную или специализированную структуру, рекомендуется проверить доступные базовые приложения, прежде чем начинать сборку.
zh_cn: base apps是一个相对专业的概念，只有一些应用需要使用他们（最常用的base app是用于 `Electron applications <https://github.com/flathub/io.atom.electron.BaseApp>`_ ）。但是，如果你的应用使用一个巨大的，复杂的或者专用的框架，在开始构建的时候检查是否有可用的base apps是一个好主意。
