Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/desktop-integration.po
Languages: pt_br, ru

source: Desktop Integration
pt_br: Integração de desktop
ru: Интеграция с рабочим столом

source: :doc:`conventions` covers the essential aspects of Linux desktop integration. This page provides further information on optional desktop integration features. It also provides guidance on how applications can ensure that their user interfaces fit into the whole range of Linux desktops and distributions.
pt_br: :doc:`conventions` cobre os aspectos essenciais da integração de desktop Linux. Esta página fornece mais informações sobre os recursos opcionais de integração de desktop. Ele também fornece orientação sobre como os aplicativos podem garantir que suas interfaces com o usuário se ajustem a toda a gama de desktops e distribuições Linux.
ru: :doc:`conventions` охватывает основные аспекты интеграции рабочего стола Linux. На этой странице представлена дополнительная информация о дополнительных функциях интеграции с рабочим столом. Он также предоставляет руководство о том, как приложения могут гарантировать, что их пользовательские интерфейсы подходят для всего диапазона настольных компьютеров и дистрибутивов Linux.

source: This information is primarily intended for developers who are new to Linux. However it is also relevant to desktop-specific Linux applications who wish to target a broader range of Linux environments.
pt_br: Essas informações são destinadas principalmente a desenvolvedores que são novos no Linux. No entanto, também é relevante para aplicativos Linux específicos de desktop que desejam atingir uma gama mais ampla de ambientes Linux.
ru: Эта информация в первую очередь предназначена для разработчиков, которые плохо знакомы с Linux. Однако это также актуально для настольных приложений Linux, которые хотят ориентироваться на более широкий спектр сред Linux.

source: While targeting the Linux desktop ecosystem might seem challenging, the existence of common standards, in combination with these guidelines, means that supporting the full range of Linux environments needn't be difficult.
pt_br: Embora visar o ecossistema de desktop Linux possa parecer desafiador, a existência de padrões comuns, combinada com essas diretrizes, significa que não é difícil oferecer suporte a toda a gama de ambientes Linux.
ru: Хотя нацеливание на экосистему настольных компьютеров Linux может показаться сложной задачей, наличие общих стандартов в сочетании с этими рекомендациями означает, что поддержка всего диапазона сред Linux не должна быть сложной.

source: Locale detection
pt_br: Detecção de localidade
ru: Определение локали

source: Application toolkits, such as Electron, GTK and Qt, provide built-in support for detecting which locale to use. Otherwise, the ``setlocale`` function can be used.
pt_br: Os kits de ferramentas de aplicativos, como Electron, GTK e Qt, fornecem suporte interno para a detecção de qual localidade usar. Caso contrário, a função ``setlocale`` pode ser usada.
ru: Наборы прикладных инструментов, такие как Electron, GTK и Qt, предоставляют встроенную поддержку для определения того, какой языковой стандарт использовать. В противном случае можно использовать функцию ``setlocale``.

source: Portals
pt_br: Portais
ru: Порталы

source: Portals are the framework for securely accessing resources from outside an application sandbox. They provide a range of common features to applications, including:
pt_br: Portais são o framework para acessar com segurança os recursos de fora de um sandbox de aplicativos. Eles fornecem uma variedade de recursos comuns para aplicativos, incluindo:
ru: Порталы - это платформа для безопасного доступа к ресурсам за пределами изолированной программной среды приложения. Они предоставляют приложениям ряд общих функций, в том числе:

source: Determining network status
pt_br: Determinar status de rede
ru: Определение статуса сети

source: Opening a file with a file chooser
pt_br: Abrir um arquivo com um seletor de arquivos
ru: Открытие файла с помощью средства выбора файла

source: Opening URIs
pt_br: Abrir URIs
ru: Открытие URIs

source: Preventing the device from suspend/sleep/powering off
pt_br: Evitar que o dispositivo suspenda/hiberne/desligue
ru: Предотвращение перехода устройства в режим ожидания/сна/выключения

source: Printing
pt_br: Imprimir
ru: Печать

source: Sending email
pt_br: Enviar e-mail
ru: Отправка электронной почты

source: Showing notifications
pt_br: Mostrar notificações
ru: Отображение уведомлений

source: Taking screenshots and screencasts
pt_br: Obter capturas de tela e fazer gravação de tela
ru: Создание скриншотов и скринкастов

source: Toolkits like GTK and Qt provide transparent support for portals:
pt_br: Kits de ferramentas como GTK e Qt fornecem suporte transparente para portais:

source: If you are not using one of these toolkits, it is possible to access the portals API directly. See the `Portals API documentation <https://flatpak.github.io/xdg-desktop-portal/portal-docs.html>`_ for more information.
pt_br: Se você não estiver usando um desses kits de ferramentas, é possível acessar diretamente a API dos portais. Consulte a `documentação da API de portais <https://flatpak.github.io/xdg-desktop-portal/portal-docs.html>`_ para obter mais informações.
ru: Если вы не используете один из этих наборов инструментов, можно получить прямой доступ к API порталов. См. Документацию по API порталов Дополнительную информацию см. В `документации API порталов: <https://flatpak.github.io/xdg-desktop-portal/portal-docs.html>`_ .

source: Notifications
pt_br: Notificações
ru: Уведомления

source: A number of toolkits and frameworks provide transparent support for Linux desktop notifications. This includes Electron, GTK, KDE and QML.
pt_br: Vários kits de ferramentas e frameworks fornecem suporte transparente a notificações de desktop Linux. Isso inclui Electron, GTK, KDE e QML.
ru: Ряд наборов инструментов и фреймворков обеспечивает прозрачную поддержку уведомлений.

source: Status icons
pt_br: Ícones de status
ru: Значки состояния

source: Status icons are the same concept as the system tray or the taskbar on Windows, or menu bar icons on Mac. These are supported on most Linux distributions, through libappindicator.
pt_br: Os ícones de status são o mesmo conceito que a área de notificação ou a barra de tarefas no Windows ou os ícones da barra de menus no Mac. Eles são suportados na maioria das distribuições Linux, através do libappindicator.
ru: Значки состояния аналогичны значкам на панели задач или панели задач в Windows или значкам строки меню на Mac. Они поддерживаются в большинстве дистрибутивов Linux через libappindicator.

source: A number of Linux distributions don't show status icons. It is still possible to provide a status icon, and it will be shown in some distributions. However, in order to ensure compatibility, it is recommended to only use status icons in a supplementary manner, and not to rely on them as the only mechanism for providing status information or access to particular features. This includes "minimize to tray" (or equivalent) functionality.
pt_br: Várias distribuições Linux não mostram ícones de status. Ainda é possível fornecer um ícone de status, que será mostrado em algumas distribuições. No entanto, para garantir a compatibilidade, é recomendável usar apenas ícones de status de maneira suplementar e não confiar neles como o único mecanismo para fornecer informações de status ou acessar recursos específicos. Isso inclui a funcionalidade “minimizar para a área de notificação” (ou equivalente).
ru: В некоторых дистрибутивах Linux не отображаются значки состояния. По-прежнему можно указать значок состояния, и он будет отображаться в некоторых дистрибутивах. Однако для обеспечения совместимости рекомендуется использовать значки состояния только в качестве дополнительных средств и не полагаться на них как на единственный механизм для предоставления информации о состоянии или доступа к определенным функциям. Это включает в себя функцию «свернуть в трей» (или аналогичную).

source: XEmbed style icons will function with the ``x11`` permission but all other status icon interfaces require extra permissions to escape the sandbox and these services are not designed to be robust against untrusted software.
pt_br: Os ícones de estilo XEmbed funcionarão com a permissão ``x11``, mas todas as outras interfaces de ícones de status requerem permissões extras para escapar da área restrita e esses serviços não foram projetados para serem robustos contra softwares não confiáveis.
ru: Значки стиля XEmbed будут работать с разрешением ``x11``, но для всех других интерфейсов значков состояния требуются дополнительные разрешения для выхода из песочницы, и эти службы не предназначены для защиты от ненадежного программного обеспечения.

source: System search
pt_br: Pesquisa do sistema
ru: Системный поиск

source: GNOME-based distributions, like CentOS, Fedora, Red Hat Enterprise Linux and Ubuntu, provide the option to integrate with system search, by providing a `search provider <https://developer.gnome.org/SearchProvider/>`_. This allows application-provided search results to appear in the Activities Overview.
pt_br: Distribuições baseadas no GNOME, como CentOS, Fedora, Red Hat Enterprise Linux e Ubuntu, oferecem a opção de integração com a pesquisa do sistema, fornecendo um `provedor de pesquisa <https://developer.gnome.org/SearchProvider/>`_. Isso permite que os resultados da pesquisa fornecidos pelo aplicativo apareçam no panorama de atividades.

source: Window controls
pt_br: Controles de janela
ru: Окно управления

source: Window controls are the buttons used to close, maximize and minimize windows. These do vary across Linux desktops, particularly in terms of which controls are shown. Whether applications attempt to follow these variations is up to their discretion. Providing the exact same controls as used by a particular desktop environment should not be seen as a hard requirement.
pt_br: Controles de janela são os botões usados para fechar, maximizar e minimizar janelas. Eles variam entre os desktops Linux, principalmente em termos de quais controles são mostrados. Se os aplicativos tentam seguir essas variações fica a seu critério. Fornecer exatamente os mesmos controles usados por um ambiente de área de trabalho específico não deve ser visto como um requisito rígido.
ru: Оконные элементы управления - это кнопки, используемые для закрытия, развертывания и минимизации окон. Они действительно различаются для разных рабочих столов Linux, особенно в том, какие элементы управления отображаются. Пытаются ли приложения следовать этим вариантам, остается на их усмотрение. Предоставление тех же элементов управления, которые используются в конкретной среде рабочего стола, не следует рассматривать как жесткое требование.

source: From a user experience perspective, it is important to ensure that window controls appear on the same side of the window as other desktops. On Linux this is the right side of the window (like Windows).
pt_br: Da perspectiva da experiência do usuário, é importante garantir que os controles de janela apareçam no mesmo lado da janela que outras áreas de trabalho. No Linux, este é o lado direito da janela (como o Windows).
ru: С точки зрения взаимодействия с пользователем важно убедиться, что элементы управления окнами отображаются на той же стороне окна, что и другие рабочие столы. В Linux это правая часть окна (как в Windows).

source: On X11 applications can rely on system-provided titlebars if they don't want to draw their own window controls. For a consistent Wayland experience applications must always provide their own. Typically toolkits handle this but raw wayland clients can use `libdecor <https://gitlab.gnome.org/jadahl/libdecor>`_ for a general solution.
pt_br: No X11, os aplicativos podem contar com barras de título fornecidas pelo sistema se não quiserem desenhar seus próprios controles de janela. Para uma experiência consistente com Wayland, os aplicativos devem sempre fornecer os seus próprios. Normalmente, os kits de ferramentas lidam com isso, mas os clientes mais simples de wayland podem usar `libdecor <https://gitlab.gnome.org/jadahl/libdecor>`_ para uma solução geral.
ru: В X11 приложения могут полагаться на предоставленные системой панели заголовков, если они не хотят рисовать свои собственные элементы управления окнами. Для согласованного использования Wayland приложения всегда должны предоставлять свои собственные. Обычно с этим справляются наборы инструментов, но необработанные клиенты wayland могут использовать `libdecor <https://gitlab.gnome.org/jadahl/libdecor>`_ для общего решения.

source: Window decorations
pt_br: Decorações de janela
ru: Оконные украшения

source: If your application uses a dark visual style as well as system-provided window decorations, the ``GTK_THEME_VARIANT=dark`` X11 window property should be used, to ensure that window decorations match the rest of the application window. This can be done by running::
pt_br: Se seu aplicativo usar um estilo visual escuro, bem como decorações de janela fornecidas pelo sistema, a propriedade de janela X11 ``GTK_THEME_VARIANT=dark`` deve ser usada para garantir que as decorações de janelas correspondam ao restante da janela do aplicativo. Isso pode ser feito executando::
ru: Если ваше приложение использует темный визуальный стиль, а также предоставляемые системой декорации окна, следует использовать свойство окна X11 ``GTK_THEME_VARIANT=dark``, чтобы гарантировать, что оформление окна соответствует остальной части окна приложения. Это можно сделать, запустив::

source: Global menus
pt_br: Menus globais
ru: Глобальные меню

source: If your application uses `Gtk.Application:menubar <https://docs.gtk.org/gtk4/class.Application.html#properties>`_ or `QMenuBar <https://doc.qt.io/qt-6/qmenubar.html>`_ it will work as expected from within a sandboxed application.
pt_br: Se seu aplicativo usa `Gtk.Application:menubar <https://docs.gtk.org/gtk4/class.Application.html#properties>`_ ou `QMenuBar <https://doc.qt.io/qt-6 /qmenubar.html>`_ funcionará como esperado de dentro de um aplicativo em área restrita.
ru: Если ваше приложение использует `Gtk.Application:menubar <https://docs.gtk.org/gtk4/class.Application.html#properties>`_ или `QMenuBar <https://doc.qt.io/qt-6 /qmenubar.html>`_ он будет работать должным образом из изолированного приложения.

source: Theming
pt_br: Temas
ru: Тематика

source: Flatpak applications cannot directly use the system theme. This happens because flatpaks do not have the ability to use data files or libraries in ``/usr`` (where system themes are typically located). The solution to this was to package themes as Flatpaks, as relying upon the host to have the correct version for every flatpak defeats the portability benefits it provides. These themes are provided as `extensions <https://github.com/flatpak/flatpak/wiki/Extensions>`_, to the Freedesktop runtime when the extension point is Gtk, and to the KDE runtime when the extension point is Qt.
pt_br: Os aplicativos Flatpak não podem usar diretamente o tema do sistema. Isso acontece porque os flatpaks não têm a capacidade de usar arquivos de dados ou bibliotecas em ``/usr`` (onde os temas do sistema estão normalmente localizados). A solução para isso foi empacotar temas como Flatpaks, pois confiar no host para ter a versão correta para cada flatpak anula os benefícios de portabilidade que ele oferece. Esses temas são fornecidos como `extensões <https://github.com/flatpak/flatpak/wiki/Extensions>`_, para o runtime do Freedesktop quando o ponto de extensão é Gtk e para o runtime do KDE quando o ponto de extensão é Qt.
ru: Приложения Flatpak не могут напрямую использовать системную тему. Это происходит потому, что у flatpaks нет возможности использовать файлы данных или библиотеки в ``/usr`` (где обычно находятся системные темы). Решением было упаковать темы как Flatpaks, поскольку надежда на то, что хост будет иметь правильную версию для каждого Flatpak, лишает его преимуществ переносимости. Эти темы предоставляются как `расширения <https://github.com/flatpak/flatpak/wiki/Extensions>`_, для среды выполнения Freedesktop, когда точкой расширения является Gtk, и для среды выполнения KDE, когда точкой расширения является Qt.

source: The theming system requires Flatpak 0.8.4+ and applications using up to date ``org.gnome.Platform`` 3.24+, or ``org.freedesktop.Platform`` 1.6+, or ``org.kde.Platform`` 5.9+.
pt_br: O sistema de temas requer Flatpak 0.8.4+ e aplicativos usando ``org.gnome.Platform`` 3.24+ ou ``org.freedesktop.Platform`` 1.6+ ou ``org.kde.Platform`` 5,9+ atualizados.
ru: Система тем требует Flatpak 0.8.4+ и приложений, использующих последнюю версию org.gnome.Platform 3.24+, org.freedesktop.Platform 1.6+ или org.kde.Platform. 5.9+.

source: Installing themes
pt_br: Instalando temas
ru: Установка тем

source: Instructions for Gtk
pt_br: Instruções para Gtk
ru: Инструкции для Gtk

source: The current Gtk themes are packaged in the `flathub <https://flathub.org/>`_ repository which you can add (if it's not already added) by running::
pt_br: Os temas Gtk atuais são empacotados no repositório `flathub <https://flathub.org/>`_ que você pode adicionar (se ainda não estiver adicionado) executando::
ru: Текущие темы Gtk упакованы в репозиторий `flathub <https://flathub.org/>`_ который вы можете добавить (если он еще не добавлен), запустив::

source: To see a list of currently packaged themes you can use the command ``flatpak search gtk3theme`` (available since Flatpak version 0.10.1). In case you use an older version of Flatpak than that, you can use the command ``flatpak remote-ls flathub | grep org.gtk.Gtk3theme``. The difference in output between these two commands is that the first prints the application ID, the remote from which the theme comes and the theme's description, while the second prints only the full name of the theme's flatpak package.
pt_br: Para ver uma lista de temas atualmente empacotados você pode usar o comando ``flatpak search gtk3theme`` (disponível desde a versão 0.10.1 do Flatpak). Caso você use uma versão mais antiga do Flatpak, você pode usar o comando ``flatpak remote-ls flathub | grep org.gtk.Gtk3theme``. A diferença na saída entre esses dois comandos é que o primeiro imprime o ID do aplicativo, o controle remoto de onde vem o tema e a descrição do tema, enquanto o segundo imprime apenas o nome completo do pacote flatpak do tema.
ru: Чтобы просмотреть список упакованных тем, вы можете использовать команду flatpak search gtk3theme (доступно, начиная с версии Flatpak 0.10.1). Если вы используете более старую версию Flatpak, вы можете использовать команду ``flatpak remote-ls flathub | grep org.gtk.Gtk3theme``. Разница в выводе между этими двумя командами заключается в том, что первая выводит идентификатор приложения, удаленное устройство, с которого поступает тема, и описание темы, а вторая выводит только полное имя пакета темы flatpak.

source: You can install themes with the command ``flatpak install flathub org.gtk.Gtk3theme.Foo``, replacing ``Foo`` with the name of the desired theme.
pt_br: Você pode instalar temas com o comando ``flatpak install flathub org.gtk.Gtk3theme.Foo``, substituindo ``Foo`` pelo nome do tema desejado.
ru: Вы можете установить темы с помощью команды ``flatpak install flathub org.gtk.Gtk3theme.Foo``, заменив `Foo` на имя желаемой темы.

source: Instructions for Qt
pt_br: Instruções para Qt
ru: Инструкции для Qt

source: For the Qt theming to work, the flatpak packages kstyle and platformtheme must be installed. These are packed in the kdeapps repository which you can add by running::
pt_br: Para que o tema Qt funcione, os pacotes flatpak kstyle e platformtheme devem ser instalados. Eles estão empacotados no repositório kdeapps que você pode adicionar executando::
ru: Чтобы темы Qt работали, должны быть установлены пакеты flatpak kstyle и platformtheme. Они упакованы в репозиторий kdeapps, который вы можете добавить, запустив::

source: Afterwards the two packages can be installed with the following commands::
pt_br: Depois os dois pacotes podem ser instalados com os seguintes comandos::
ru: После этого два пакета можно установить с помощью следующих команд::

source: Applying themes
pt_br: Aplicando temas
ru: Применение тем

source: There is no ideal way to specify the theme Flatpak applications use. The applications will try to match the system theme currently being used, if it corresponds to any of the Flatpak themes installed, and will fall back to Adwaita (if they use Gtk2 or Gtk3) or the default Qt theme (if they use Qt) if a corresponding theme isn't detected.
pt_br: Não existe uma maneira ideal de especificar o tema que os aplicativos Flatpak usam. Os aplicativos tentarão corresponder ao tema do sistema que está sendo usado no momento, se corresponder a algum dos temas Flatpak instalados, e retornarão ao Adwaita (se usarem Gtk2 ou Gtk3) ou ao tema padrão Qt (se usarem Qt) se um tema correspondente não é detectado.
ru: Не существует идеального способа указать тему, используемую приложениями Flatpak. Приложения будут пытаться соответствовать используемой в настоящее время системной теме, если она соответствует какой-либо из установленных тем Flatpak, и будут использовать Adwaita (если они используют Gtk2 или Gtk3) или тему Qt по умолчанию (если они используют Qt), если соответствующая тема не обнаружена.

source: As of Flatpak 0.10.1, the Flatpak system can detect whether the system themes available correspond to any Flatpak themes available in the repositories, and, if so, will automatically install found themes at update time based upon the ``gtk-theme`` Dconf key. This key however can contain only one value, the one of the currently being used theme, which means that the Flatpak versions of matching themes that aren't currently being used aren't installed until those themes are enabled. If none of the corresponding system themes are currently being used, the applications will fall back to Adwaita or the default Qt theme.
pt_br: A partir do Flatpak 0.10.1, o sistema Flatpak pode detectar se os temas do sistema disponíveis correspondem a quaisquer temas Flatpak disponíveis nos repositórios e, se sim, instalará automaticamente os temas encontrados no momento da atualização com base no ``gtk-theme`` Chave Dconf. Essa chave, no entanto, pode conter apenas um valor, o do tema usado no momento, o que significa que as versões Flatpak dos temas correspondentes que não estão sendo usados no momento não são instaladas até que esses temas sejam habilitados. Se nenhum dos temas de sistema correspondentes estiver sendo usado no momento, os aplicativos retornarão ao Adwaita ou ao tema padrão do Qt.
ru: Начиная с Flatpak 0.10.1, система Flatpak может определять, соответствуют ли доступные системные темы каким-либо темам Flatpak, доступным в репозиториях, и, если да, автоматически устанавливает найденные темы во время обновления на основе `` gtk-theme`` Ключ dconf. Однако этот ключ содержать только одно значение, одно из используемых в настоящее время тем, что означает, что версии Flatpak совпадающих тем, которые в настоящее время не используются, не устанавливаются, пока эти темы не будут включены. Если ни одна из соответствующих системных тем в настоящее время не используются, приложения вернутся к Adwaita или теме Qt по умолчанию.
