Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/desktop-integration.po
Languages: pt_br, ru

source: On X11, Gtk3 picks up the themes via XSettings. Specifically, the GNOME XSettings daemon ``gsd-xsettings`` reads the DConf values and converts them into the XSettings values. For this to work, you need an xsettings daemon that is correctly configured. Gtk3 on Wayland picks up themes directly via Dconf. For this to work, you can either use KDE (with ``kde-gtk-config`` > 5.11.95), GNOME, which works out of the box, or manually configure the dconf keys under ``/org/gnome/desktop/interface/``. For the DConf option to work on Wayland the application must also be configured to have DConf access.
pt_br: No X11, o Gtk3 pega os temas via XSettings. Especificamente, o daemon ``gsd-xsettings`` do GNOME XSettings lê os valores DConf e os converte nos valores XSettings. Para que isso funcione, você precisa de um daemon xsettings que esteja configurado corretamente. Gtk3 em Wayland pega temas diretamente via Dconf. Para que isso funcione, você pode usar o KDE (com ``kde-gtk-config`` > 5.11.95), GNOME, que funciona imediatamente, ou configurar manualmente as chaves dconf em ``/org/gnome/desktop/interface/``. Para que a opção DConf funcione no Wayland o aplicativo também deve estar configurado para ter acesso ao DConf.
ru: На X11 Gtk3 подбирает темы через XSettings. В частности, демон GNOME XSettings ``gsd-xsettings`` считывает значения DConf и преобразует их в значения XSettings. Чтобы это работало, вам нужен правильно настроенный демон xsettings. Gtk3 на Wayland подбирает темы напрямую через Dconf. Чтобы это работало, вы можете использовать KDE (``kde-gtk-config`` > 5.11.95), GNOME, который работает из коробки, или вручную, или вручную настроить ключи dconf в ``/org/gnome/desktop/interface/``. Чтобы опция DConf работала в Wayland, приложение также должно быть настроено для доступа к DConf.

source: Other notes on theming
pt_br: Outras notas sobre temas
ru: Другие примечания по тематике

source: In regards to icon themes, since Flatpak 0.8.8 the host icons are exposed to the guest, so that there is usually no need for the presence of Flatpak icon themes.
pt_br: Em relação aos temas de ícones, desde o Flatpak 0.8.8 os ícones do host são expostos ao convidado, de modo que geralmente não há necessidade da presença de temas de ícones do Flatpak.
ru: Что касается тем значков, начиная с Flatpak 0.8.8 значки хоста отображаются для гостя, поэтому обычно нет необходимости в наличии тем значков Flatpak.

source: If you use the *Global Dark Theme* option (removed in GNOME-Tweaks 3.28) in ``gnome-tweak-tool`` it will not work as that simply writes to ``settings.ini`` which isn’t available in the sandbox. Use dark versions of themes instead if they exist.
pt_br: Se você usar a opção *Tema escuro global* (removida no GNOME-Tweaks 3.28) em ``gnome-tweak-tool`` ela não funcionará porque simplesmente grava em ``settings.ini`` que não está disponível em a caixa de areia. Use versões escuras de temas, se existirem.
ru: Если вы используете параметр *Global Dark Theme* (удален в GNOME-Tweaks 3.28) в gnome-tweak-tool, он не будет работать, так как он просто записывает в ``settings.ini``, который недоступен в песочница. Вместо этого используйте темные версии тем, если они существуют.

source: Toolkits like GTK and Qt provide transparent support for portals.
ru: Такие инструменты, как GTK и Qt, обеспечивают прозрачную поддержку порталов.

source: GNOME-based distributions, like CentOS, Fedora, Red Hat Enterprise Linux and Ubuntu, provide the option to integrate with system search, by providing a `search provider <https://developer-old.gnome.org/SearchProvider/>`_. This allows application-provided search results to appear in the Activities Overview.
ru: Дистрибутивы на основе GNOME, такие как CentOS, Fedora, Red Hat Enterprise Linux и Ubuntu, предоставляют возможность интеграции с системным поиском, предоставляя `поискового провайдера <https://developer-old.gnome.org/SearchProvider/>`_ . Это позволяет отображать результаты поиска, предоставленные приложением, в обзоре операций.
