Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/distributing-applications.po
Languages: de, fr, kr

source: Distributing Applications
de: Verteilen von Applikationen
fr: Distribution d'applications
kr: 응용프로그램 배포

source: Flatpak provides several ways to distribute applications. The primary method is to host a repository. This is relatively simple (although there are some important details to be aware of) and allows application updates to be distributed.
de: Flatpak bietet verschiedene Wege, Anwendungen zu verteilen. Die primäre Methode ist es, ein Repository zu hosten. Das ist relativ einfach zu handhaben (allerdings sollte man sich einiger wichtiger Details bewusst sein) und erlaubt es, Aktualisierungen für Anwendungen zu verteilen.
fr: Flatpak fournit plusieurs façon de distribuer des applications. La méthode principale est d'héberger un dépôt. Cela est relativement simple (néanmoins il y a certains détails important qu'il faut connaître) et permet aux mises à jour d'applications d'être distribuées.
kr: 플랫팩은 응용프로그램 배포를 위한 몇 가지 방법을 제공한다. 첫째, 저장소를 직접 운영(hosting) 하는 것이다. 이 방법은 상대적으로 간단하고 (주의 해야 할 사항이 몇 가지 있지만) 배포한 응용프로그램들을 쉽게 업데이트할 수 있도록 지원한다.

source: It is also possible to distribute Flatpaks as single file bundles, which can be useful in some situations.
de: Es ist ebenso möglich, Flatpaks als Einzeldateipakete zu verteilen, was in einigen Situationen nützlich sein kann.
fr: Il est aussi possible de distribuer des flatpaks comme de simples paquets de fichiers, qui peut être utile dans certaines situations.
kr: 플랫팩을 하나의 파일 묶음, 즉 단일 파일 번들로 배포할 수도 있다. 이러한 방식이 유용할 때도 있다.

source: Hosting a repository
de: Hosten eines Repositorys
fr: Héberger un dépôt
kr: 저장소 운영

source: The previous sections of this guide describe how to generate repositories using ``build-export`` or ``flatpak-builder``. The resulting OSTree repository can be hosted on a web server for consumption by users.
de: Die vorherigen Abschnitte dieser Anleitung beschreiben, wie man Repositorys generiert mittels ``build-export`` oder ``flatpak-builder``. Für die Verteilung an Anwender, kann das resultierende OSTree-Repository auf einem Webserver gehosted werden.
fr: La section précédente de ce guide décrit comment générer les dépôts à l'aide de ``build-export`` ou ``flatpak-builder``. Le dépôt OSTree en résultant peut être hébergé sur un serveur web pour usage par les utilisateurs.
kr: 이 가이드의 이전 장에서 ``build-export`` 또는 ``flatpak-builder`` 를 이용하여 저장소를 생성하는 방법을 설명했다. 그 결과물인 OSTree 저장소를 웹 서버 상에서 호스팅하여 다른 사용자들이 접근하여 사용토록 할 수 있다.

source: Important details
de: Wichtige Details
fr: Détails importants
kr: 중요한 세부사항들

source: OSTree repositories use archive-z2, meaning that they contain a single file for each file in the application. This means that pull operations will do a lot of HTTP requests. Since new requests are slow, it is important to enable HTTP keep-alive on the web server.
de: OSTree-Repositorys benutzen `archive-z2`, dies bedeutet, dass sie eine einzelne Datei für jede Datei in der Applikation enthalten. Daraus resultiert, dass Pull-Operationen eine Menge HTTP-Anfragen generieren. Da neue Anfragen langsam sind, ist es wichtig `HTTP Keep-alive` auf dem Webserver zu aktivieren.
fr: Les dépôts OSTree utilisent articles-z2, ce qui signifie qu'ils contiennent un seul fichier pour chaque fichier dans l'application. Les opérations de récupération feront donc beaucoup de requêtes HTTP. Comment la création de requête prend du temps, il est important d'activer la fonctionnalité HTTP keep-alive sur le serveur web.
kr: OSTree 저장소는 `archive-z2`를 사용하므로, 응용프로그램 내 각 파일에 일대일 대응되는 파일들을 포함하고 있다. 따라서 pull 연산은 많은 HTTP 요청을 야기한다. 새로운 요청은 느리게 처리되므로, 웹서버 상에서 HTTP가 지속적으로 가용하도록 만드는 것이 중요하다.

source: OSTree supports something called static deltas. These are single files in the repo that contains all the data needed to go between two revisions (or from nothing to a revision). Creating such deltas will take up more space on the server, but will make downloads much faster. This can be done with the ``build-update-repo --generate-static-deltas`` option.
de: OSTree supportet etwas, das statische Deltas genannt wird. Dies sind einzelne Dateien im Repo, die alle Daten enthalten, die benötigt werden zwischen zwei Revisionen (oder von nichts zu einer Revision). Solche Deltas zu erstellen wird mehr Platz auf dem Server beanspruchen, dafür aber Downloads beschleunigen. Dies kann durchgeführt werden mittels der ``build-update-repo --generate-static-deltas``-Option.
fr: OSTree supporte quelque-chose appelé deltas statiques. Ce sont de simples fichiers dans le dépôt qui contiennent toutes les données pour passer entre deux révisions (ou pour partir de zero). Créer de tels deltas prendra plus d'espace sur le serveur, mais accélerera les téléchargements. Cela peut être avec l'option ``build-update-repo --generate-static-deltas``.
kr: OSTree는 정젹 변량(static deltas)이라는 것을 지원한다. 정적 변량이란, 저장소 내에서 한 revision으로부터 다른 revision까지의 데이터변화를 담고 있는 파일들의 집합이다. 이러한 변량 데이터들을 생성하개되면 서버의 저장공간을 차지하는 대신, 다운로드 속도를 향상시킨다. 이러한 기능을 사용하려면 ``build-update-repo —generate-static-deltas`` 과 같은 옵션을 사용한다.

source: GPG signatures
de: GPG-Signaturen
fr: Signatures GPG
kr: GPG 서명

source: OSTree uses GPG to verify the identity of repositories. This requires that every commit to a repository uses a GPG signature, as well as when repository summary files are modified.
de: OSTree verwendet GPG um die Identität von Repositorys zu verifizieren. Dies setzt voraus, dass jedes Commit zu einem Repository GPG-Signaturen verwendet, ebenso wenn Summarydateien des Repositorys modifiziert werden.
fr: OSTree utilises GPG pour vérifier l'identité des dépôts. Cela requiert que chaque commit sur le dépôt utilise une signature GPG, ainsi que lorsque les fichiers sommaires du dépôt sont modifiés.
kr: OSTree는 저장소의 식별자를 검증하기 위해 GPG를 사용한다. 저장소로 커밋할 때마다, 저장소 요약 파일(repository summary files)이 변경될 때에도 마찬가지로, GPG 서명을 사용한다.

source: To do this, a GPG key needs to be passed to the ``build-update-repo`` and ``build-export`` commands, as well as ``flatpak-builder`` if it is being used to modify or create a repository. (If you don't already have a key, `it is easy to generate one <https://help.github.com/articles/generating-a-new-gpg-key/>`_.) For example::
de: Um dies zu tun, muss ein GPG-Schlüssel weitergereicht werden zu den ``build-update-repo``- und ``build-export``-Kommandos. Ebenso zu ``flatpak-builder``, wenn dieses Kommando verwendet wird, um ein Repository zu modifizieren oder zu erstellen. (Wenn noch kein Schlüssel vorhanden ist, `ist es einfach, einen zu generieren <https://help.github.com/articles/generating-a-new-gpg-key/>`_). Zum Beispiel::
fr: Pour cela, une clé GPG doit être passée aux commandes ``build-update-repo`` et ``build-export``, ainsi qu'à ``flatpak-builder`` si elle est utilisée pour modifier ou créer un dépôt. (Si vous n'avez pas déjà une clé, `il est aisé d'en générer une <https://help.github.com/articles/generating-a-new-gpg-key/>`_.) Par exemple::
kr: 이를 위해 GPG키를 ``build-update-repo``, ``build-export`` 의 매개변수로 넘겨주어야 하며, 저장소를 생성하거나 수정할 때에는 ``flatpak-builder`` 명령의 매개변수로 넘겨주어야 한다 (키가 없다면 `쉽게 생성할 수 있다 <https://help.github.com/articles/generating-a-new-gpg-key/>`_). 예를 들면::

source: Here ``--gpg-homedir`` is optional, and allows specifying the home directory of the key to be used.
de: Hier ist ``--gpg-homedir`` optional und erlaubt das Heimverzeichnis des verwendeten Schlüssels zu spezifizieren.
fr: Ici ``--gpg-homedir`` est optionnel, et permet de spécifier le répertoire personnel de la clé à utiliser.
kr: 여기서 ``—gpg-homedir`` 는 사용할 키의 홈디렉토리를 지정하기 위한 옵션이다.

source: Though it generally isn't recommended, it is possible to disable GPG verification of OSTree repositories. To do this, the ``--no-gpg-verify`` option can be used when a remote is added. GPG verification can also be disabled on an existing remote using ``flatpak remote-modify``.
de: Obwohl es generell nicht empfohlen ist, ist es möglich die GPG-Verifizierung von OSTree-Repositorys zu deaktivieren. Um dies zu tun, kann die ``--no-gpg-verify``-Option verwendet werden, wenn ein entferntes Repository hinzugefügt wird. GPG-Verifizierung kann ebenso auf einem existierenden Remote mittels ``flatpak remote-modify`` deaktiviert werden.
fr: Bien que ca ne soit pas généralement recommandé, il est possible de désactiver les vérifications GPG des dépôts OSTree. Pour cela, l'option ``--no-gpg-verify`` doit être passé quand le serveur distant est ajouté. La vérification GPG peut aussi être désactivée sur un serveur distant existant en utilisant ``flatpak remote-modify``.
kr: 일반적으로 추천하지는 않지만, OSTree 저장소의 GPG 검증을 비활성화하는 것도 가능하다. 이를 위해서는 저장소를 추가할 때 ``—no-gpg-verify`` 옵션을 사용한다. 기존 저장소의 GPG 검증을 비활성화하려면 ``flatpak remote-modify`` 명령을 사용한다.

source: Note that it is necessary to become root in order to update a remote that does not have GPG verification enabled.
de: Es ist zu beachten, dass es notwendig ist Root zu werden, um ein externes Repository zu aktualisieren, das keine GPG-Verifizierung aktiviert hat.
fr: Notez qu'il est nécessaire de devenir root pour mettre à jour un serveur distant qui n'a pas la vérification GPG activé.
kr: 단, GPG 검증이 활성화되지 않은 저장소 정보를 갱신하려면 관리자 권한(root)이 필요하다.

source: Referring to repositories
de: Referenzieren auf ein Repository
fr: Se référer aux dépôts
kr: 저장소 지정

source: A convenient way to point users to the repository containing your application is to provide a ``.flatpakrepo`` file that they can download and install. To install a ``.flatpakrepo`` file manually, use the command::
de: Eine praktische Variante Benutzer auf ein Repository zu lenken, das die Applikation enthält, ist es, eine `.flatpakrepo`-Datei zur Verfügung zu stellen, die heruntergeladen und installiert werden kann. Um die `.flatpakrepo`-Datei manuell zu installieren, verwendet man folgendes Kommando::
fr: Une façon pratique de diriger les utilisateurs vers le dépôt contenant votre application est de fournir un fichier ``.flatpakrepo`` qu'ils peuvent télécharger et installer. Pour installer un fichier ``.flatpakrepo`` manuellement, utilisez la commande::
kr: 응용프로그램을 올려둔 저장소를 다른 사용자로 하여금 편리하게 지정하도록 하는 방법은 ``.flatpakrepo`` 을 내려받아 설치하고 사용하도록 하는 것이다. ``.flatpakrepo`` 파일을 수동으로 설치하는 명령은 다음과 같다::

source: A typical ``.flatpakrepo`` file looks like this::
de: Eine typische `.flatpakrepo`-Datei sieht so aus::
fr: Un fichier ``.flatpakrepo`` typique ressemble à cela::
kr: 전형적인 ``.flatpakrepo`` 파일의 생김새는 다음과 같다::

source: If your repository contains just a single application, it may be more convenient to use a .flatpakref file instead, which contains enough information to add the repository and install the application at the same time. To install a ``.flatpakref`` file manually, use the command::
de: Wenn das Repository lediglich eine einzige Anwendung enthält, ist es möglicherweise sinnvoller, eine `.flatpakref`-Datei zu verwenden. Diese enthält genügend Informationen, das Repository hinzuzufügen und die Applikation zur gleichen Zeit zu installieren. Um eine `.flatpakref`-Datei manuell zu installieren, verwendet man folgendes Kommando::
fr: Si votre dépôt contient juste une seule application, il serait plus pratique d'utiliser un fichier .flatpakref à la place, qui contient assez d'information pour ajouter le dépôt et installer l'application en même temps. Pour installer un fichier ``.flatpakref`` manuellement, utilisez la commande::
kr: 하나의 응용프로그램만 저장하고 있는 저장소의 경우, 저장소를 추가하는 데에 필요한 정보와 응용프로그램을 설치하기 위한 정보를 모두 담고 있는 .flatpakref 파일을 사용하는 게 더 편할 수 있다. ``.flatpakref`` 파일은 다음과 같이 수동으로 설치할 수 있다::

source: A typical ``.flatpakref`` file looks like this::
de: Eine typische `.flatpakref`-Datei sieht so aus::
fr: Un fichier ``.flatpakref`` typique resulting à cela::
kr: 전형적인 ``.flatpakref`` 파일은 다음과 같은 형태이다::

source: Note that the GPGKey key in these files contains the base64-encoded GPG key, which you can get with the following command::
de: Zu beachten ist, dass der GPG-Schlüssel in diesen Dateien den base64-codierten GPG-Schlüssel enthält, welchen man mit dem folgenden Kommando erhalten kann::
fr: Notez que la clé GPGKey dans ces fichiers contient la clé GPG encodé en base64, que vous pouvez récupérer avec la commande suivante::
kr: 이들 파일들의 GPGKey 키는 base64 인코딩된 GPG key를 담고 있으며, 다음과 같이 얻을 수 있다::

source: Single-file bundles
de: Einzeldateipakete
fr: Paquets de fichier-seul
kr: 단일 파일 번들

source: Hosting a repository is the preferred way to distribute an application, but sometimes a single-file bundle that you can make available from a website or send as an email attachment is more convenient. Flatpak supports this with the ``build-bundle`` and ``build-import-bundle`` commands to convert an application in a repository to a bundle and back::
de: Ein Repository zu hosten ist die bevorzugte Methode eine Applikation zu verteilen. Allerdings ist es manchmal angebrachter ein Einzeldateipaket über eine Website oder als Email-Anhang zur Verfügung zu stellen. Flatpak unterstützt dies mit den ``build-bundle``- und ``build-import-bundle``-Kommandos, mittels derer eine Anwendung in einem Repository zu einem Paket und zurück konvertiert werden kann::
fr: Héberger un dépôt est la façon préféree pour distribuer une application, mais parfois un paquet de fichier-seul que vous pouvez rendre disponible à partir d'un site web ou à envoyer comme pièce-jointe d'un courrier électronique est plus pratique. Flatpak supporte cela avec les commandes ``build-bundle`` et ``build-import-bundle`` pour convertir une application d'un dépôt vers un paquet et inversement.
kr: 저장소를 호스팅하는 것도 응용프로그램을 배포하기 위한 좋은 방법이지만, 어떤 경우 웹사이트에서 다운로드 하거나 이메일에 첨부하기 쉬운 단일 파일 번들이 더 편리할 수 있다. ``build-bundle`` 또는 ``build-import-bundle`` 명령을 통해 저장소의 응용프로그램을 번들로 변환하거나, 역변환할 수 있다.::

source: For example, to create a bundle named `dictionary.flatpak` containing the GNOME dictionary app from the repository at ~/repositories/apps, run::
de: Zum Beispiel, um ein Paket namens `dictionary.flatpak` zu erstellen, dass die GNOME Dictionary App aus dem Repository `~/repositories/apps` enthält, startet man::
fr: Par exemple, pour créer un paquet nommé `dictionary.flatpak` contenant l'application GNOME dictionnary du dépôt situé à ~/repositories/apps, lancez::
kr: 예를 들어, `~/repositories/apps` 로부터 GNOME 사전 응용프로그램을 포함하고 있는 `dictionary.flatpak` 이름의 번들을 생성하려면, 다음과 같이 실행한다::

source: To import the bundle into a repository on another machine, run::
de: Um das Paket in ein Repository auf einer anderen Maschine zu importieren, führt man folgendes Kommando aus::
fr: Pour importer un paquet dans un dépôt d'une autre machine, lancez::
kr: 다른 머신 상의 저장소로 번들을 읽어들이려면(Import), 다음과 같이 실행한다::

source: Note that bundles have some drawbacks, compared to repositories. For example, distributing updates is much more convenient with a hosted repository, since users can just run ``flatpak update``.
de: Zu beachten ist, das Pakete einige Nachteile mit sich bringen, verglichen mit Repositorys. Zum Beispiel ist es wesentlich einfacher mit einem gehosteten Repository Aktualisierungen zu verteilen, da Benutzer einfach ``flatpak update`` ausführen können.
fr: Notez que les paquets ont certains désavantages comparés aux dépôts. Par exemple, la distribution de mises à jour est plus pratique avec un dépôt hébergé, comme les utilisateur ont juste à lancer ``flatpak update``.
kr: 저장소와 비해 번들이 가지는 단점도 있다. 업데이트를 배포하는 작업은 저장소를 호스팅하는 편이 편리하다. 사용자는 ``flatpak update`` 명령만 실행하면 된다.
