Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/electron.po
Languages: pt_br, ru, zh_cn

source: Due to the nature of Electron, building Electron applications as Flatpaks requires a few extra steps compared with other applications. Thankfully, several tools and resources are available which make this much easier.
pt_br: Devido à natureza do Electron, a criação de aplicativos Electron como Flatpaks requer algumas etapas extras em comparação com outros aplicativos. Felizmente, várias ferramentas e recursos estão disponíveis, o que facilita muito isso.
ru: Из-за природы Electron создание приложений Electron в виде Flatpaks требует нескольких дополнительных шагов по сравнению с другими приложениями. К счастью, доступно несколько инструментов и ресурсов, которые значительно упрощают эту задачу.
zh_cn: 由于Electron的性质，与其他应用相比，将Electron应用构建为Flatpak应用需要一些额外的步骤。值得庆幸的是，有几种工具和资源可以使这些步骤更容易。

source: This guide provides information on how building Electron applications differs from other applications. It also includes information on the tooling for building Electron applications and how to use it.
pt_br: Este guia fornece informações sobre como a compilação de aplicativos Electron difere de outros aplicativos. Ele também inclui informações sobre as ferramentas para a compilação de aplicativos Electron e como usá-lo.
ru: В этом руководстве представлена информация о том, чем создание приложений Electron отличается от других приложений. Он также включает информацию об инструментах для создания приложений Electron и о том, как их использовать.
zh_cn: 本教程提供有关如何构建Electron应用程序与其他应用程序不同的信息。 它还包括有关构建Electron应用程序的工具以及如何使用它的信息。

source: The guide walks through the `manifest file <https://github.com/flathub/electron-sample-app/blob/master/flatpak/org.flathub.electron-sample-app.yml>`_ of the `sample Electron Flatpak application <https://github.com/flathub/electron-sample-app>`_. Before you start, it is a good idea to take a look at this, either online or by downloading the application.
pt_br: O guia percorre o `arquivo de manifesto <https://github.com/flathub/electron-sample-app/blob/master/flatpak/org.flathub.electron-sample-app.yml>`_ do `aplicativo de amostra Electron de Flatpak <https://github.com/flathub/electron-sample-app>`_. Antes de começar, é uma boa ideia dar uma olhada nisso, online ou baixando o aplicativo.
ru: В руководстве рассматривается файл манифеста <https://github.com/flathub/electron-sample-app/blob/master/flatpak/org.flathub.electron-sample-app.yml>`_ образца Electron Приложение Flatpak <https://github.com/flathub/electron-sample-app>`_. Прежде чем начать, рекомендуется взглянуть на это в Интернете или загрузив приложение.

source: Building the sample application
pt_br: Compilando o aplicativo de amostra
ru: Сборка образца приложения
zh_cn: 构建示例应用程序

source: While it isn't strictly necessary, you might want to try building and running the sample application yourself.
pt_br: Embora não seja estritamente necessário, convém tentar compilar e executar o aplicativo de amostra.
ru: Хотя в этом нет строгой необходимости, вы можете попробовать создать и запустить образец приложения самостоятельно.
zh_cn: 虽然并非绝对必要，但最好自己尝试构建和运行示例应用程序。

source: To get setup for the build, download or clone the sample app from GitHub, and navigate to the ``/flatpak`` directory in the terminal. You must also install the Electron base app and the Node.js SDK extension::
pt_br: Para obter a configuração para a compilação, baixe ou clone o aplicativo de exemplo no GitHub e navegue até o diretório ``/flatpak`` no terminal. Você também deve instalar o aplicativo base Electron e a extensão de SDK Node.js::
ru: Чтобы настроить сборку, загрузите или клонируйте образец приложения с GitHub и перейдите в каталог ``/flatpak`` в терминале. Вы также должны установить базовое приложение Electron::

source: Then you can run the build::
pt_br: Então, você pode executar a compilação::
ru: Затем вы можете запустить сборку::
zh_cn: 然后运行构建命令：

source: Finally, the application can be run with::
pt_br: Finalmente, o aplicativo pode ser executado com::
ru: Наконец, приложение можно запустить с::
zh_cn: 最后，运行应用：

source: Basic configuration
pt_br: Configuração básica
ru: Базовая конфигурация
zh_cn: 基本配置

source: The first part of the sample application's manifest specifies the application's ID. It also configures the runtime and SDK:
pt_br: A primeira parte do manifesto do aplicativo de amostra especifica o ID do aplicativo. Ele também configura o runtime e o SDK:
ru: В первой части манифеста демонстрационного приложения указывается идентификатор приложения. Он также настраивает среду выполнения и SDK:
zh_cn: 示例应用清单文件的第一部分指定了应用ID、runtime和SDK：

source: The Freedesktop runtime is generally the best runtime to use with Electron applications, since it is the most minimal runtime, and other dependencies will be specific to Electron itself.
pt_br: O runtime do Freedesktop é geralmente o melhor runtime para uso com aplicativos Electron, já que ele é o mais mínimo de todos e outras dependências serão específicas do próprio Electron.
ru: Среда выполнения Freedesktop, как правило, является лучшей средой выполнения для использования с приложениями Electron, поскольку это минимальная среда выполнения, а другие зависимости будут специфичными для самого Electron.
zh_cn: Freedesktop运行时通常是与Electron应用程序一起使用的最佳运行时，因为它是最小的运行时，其他依赖项将特定于Electron本身。

source: The Electron base app
pt_br: O aplicativo base Electron
ru: Базовое приложение Electron
zh_cn: Electron base应用

source: Next, the manifest specifies that the Electron base app should be used, by specifying the ``base`` and ``base-version`` properties in the application manifest:
pt_br: Em seguida, o manifesto especifica que o aplicativo base Electron deve ser usado, especificando as propriedades ``base`` e ``base-version`` no manifesto do aplicativo::
ru: Затем в манифесте указано, что следует использовать базовое приложение Electron, указав свойства base и base-version в манифесте приложения:

source: Base apps are described in :doc:`dependencies`. Using the Electron base app is much faster and more convenient than manually building Electron dependencies. It also has the advantage of reducing the amount of duplication on users' machines, since it means that Electron is only saved once on disk.
pt_br: Os aplicativos base estão descritos em :doc:`dependencies`. Usar o aplicativo base Electron é muito mais rápido e mais conveniente do que compilar manualmente as dependências do Electron. Ele também tem a vantagem de reduzir a quantidade de duplicação nas máquinas dos usuários, pois significa que o Electron é salvo apenas uma vez no disco.
ru: Базовые приложения описаны в :doc:`building-basics`. Использование базового приложения Electron намного быстрее и удобнее, чем создание Electron и его зависимостей вручную. Это также имеет преимущество в уменьшении количества дублирования на машинах пользователей, поскольку это означает, что Electron сохраняется на диске только один раз.

source: The Node.js SDK extension
pt_br: A extensão de SDK Node.js
ru: Расширение SDK для Node.js

source: In order to build Electron-based apps, you need Node.js available at build time. Flathub provides Node.js LTS versions as extensions for the SDK, so you can install one of them and add it in your apps' manifest:
pt_br: Para criar aplicativos baseados em Electron, você precisa do Node.js disponível no momento da compilação. O Flathub fornece versões LTS do Node.js como extensões para o SDK, para que você possa instalar uma delas e adicioná-la no manifesto de seus aplicativos:
ru: Чтобы создавать приложения на основе Electron, вам понадобится Node.js, доступный во время сборки. Flathub предоставляет версии LTS для Node.js в качестве расширений для SDK, поэтому вы можете установить одну из них и добавить ее в манифест приложений:

source: Enable the extension by adding it to ``PATH``:
pt_br: Habilite a extensão adicionando-a a ``PATH``:
ru: Включите расширение, добавив его в «PATH»:

source: Note that the extension name (last portion of reverse-dns notation, ``node18`` in this example) must be the same in ``sdk-extensions`` and ``append-path``.
pt_br: Observe que o nome da extensão (última parte da notação de DNS reverso, ``node18`` neste exemplo) deve ser o mesmo em ``sdk-extensions`` e ``append-path``.

source: The ``command`` property indicates that a script called ``run.sh`` is to be executed to run the application. This will be explained in further detail later.
pt_br: A propriedade ``command`` indica que um script chamado ``run.sh`` deve ser executado para executar o aplicativo. Isso será explicado em mais detalhes posteriormente.
ru: Свойство ``command``указывает, что для запуска приложения должен быть выполнен сценарий с именем ``run.sh``. Это будет объяснено более подробно позже.
zh_cn: 这个 ``command`` 表明执行一个名为 ``run.sh`` 的脚本用来运行这个应用。这会在后续详细介绍。

source: Sandbox permissions
pt_br: Permissões de sandbox
ru: Разрешения песочницы
zh_cn: 沙箱权限

source: The standard guidelines on sandbox permissions apply to Electron applications. However, Electron does not currently support Wayland, so for display access, only X11 should be used. The sample app also configures pulseaudio for sound and enables network access:
pt_br: As diretrizes padrão sobre permissões de sandbox se aplicam aos aplicativos Electron. No entanto, o Electron atualmente não possui suporte a Wayland, portanto, para acesso à exibição, apenas o X11 deve ser usado. O aplicativo de amostra também configura o pulseaudio para som e permite o acesso à rede:
ru: Стандартные рекомендации по разрешениям песочницы применяются к приложениям Electron. Однако Electron в настоящее время не поддерживает Wayland, поэтому для доступа к дисплею следует использовать только X11. Пример приложения также настраивает pulseaudio для звука и обеспечивает доступ к сети:
zh_cn: 标准的指南可以用于Electron应用。可是Electron还不支持Wayland，所以只能使用X11进行显示。示例的应用也为声音配置了pulseaudio和开启了网络的访问：

source: Build options
pt_br: Opções de compilação
ru: Варианты сборки
zh_cn: 构建选项

source: These build options aren't strictly necessary, but can be useful if something goes wrong. ``env`` allows setting an array of environment variables, in this case we set ``NPM_CONFIG_LOGLEVEL`` to ``info`` so that ``npm`` gives us more detailed error messages.
pt_br: Essas opções de compilação não são estritamente necessárias, mas podem ser úteis se algo der errado. ``env`` permite definir uma matriz de variáveis de ambiente; nesse caso, definimos ``NPM_CONFIG_LOGLEVEL`` para ``info``, para que ``npm`` nos forneça mensagens de erro mais detalhadas.
ru: Эти параметры сборки не являются обязательными, но могут быть полезны, если что-то пойдет не так. ``env`` позволяет установить массив переменных среды, в этом случае мы устанавливаем ``NPM_CONFIG_LOGLEVEL`` на ``info``, чтобы ``npm`` давал нам более подробные сообщения об ошибках.
zh_cn: 构建选项不是必要的，但是在发生一些错误的时候很有用。 ``env`` 允许设置一个环境变量数组，这时将 ``NPM_CONFIG_LOGLEVEL`` 设置为 ``info`` 可以让 ``npm`` 给我们更多关于错误的详情。

source: The application module
pt_br: O módulo do aplicativo
ru: Модуль приложения
zh_cn: 应用模块

source: The final section of the manifest defines how the application module should be built. This is where some of the additional logic for Electron and Node.js can be found.
pt_br: A seção final do manifesto define como o módulo do aplicativo deve ser compilado. É aqui que algumas das lógicas adicionais para Electron e Node.js podem ser encontradas.
ru: Последний раздел манифеста определяет, как должен быть построен модуль приложения. Здесь можно найти дополнительную логику для Electron и Node.js.
zh_cn: 清单文件的最后一部分是定义应用模块如何构建。可以找到一些Electron和Node.js的一些附加逻辑。

source: By default, ``flatpak-builder`` doesn't allow build tools to access the network. This means that tools which rely on downloading sources will not work. Therefore, Node.js packages must be downloaded prior to running the build. Setting the ``electron_config_cache`` environment variable means that these will be found when it comes to the build.
pt_br: Por padrão, o ``flatpak-builder`` não permite que ferramentas de compilação acessem a rede. Isso significa que as ferramentas que dependem do download de fontes não funcionarão. Portanto, os pacotes Node.js devem ser baixados antes da execução da compilação. Definir a variável de ambiente ``electron_config_cache`` significa que elas serão encontradas quando se trata da compilação.
ru: По умолчанию flatpak-builder не разрешает инструментам сборки доступ к сети. Это означает, что инструменты, которые полагаются на источники загрузки, не будут работать. Поэтому пакеты Node.js необходимо загрузить до запуска сборки. Установка переменной окружения ``electronic_config_cache`` означает, что они будут найдены при сборке.
zh_cn: ``flatpak-builder`` 默认不能访问网络。这意味着依赖于下载资源的工具无法工作。因此，Node.js包必须在构建之前提前下载好。设置环境变量 ``electron_config_cache`` 表明这些包会在构建的时候被找到。

source: The next part of the manifest describes how the application should be built. The simple buildsystem option is used, which allows a sequence of commands to be specified, which are used for the build. The download location and hash of the application are also specified.
pt_br: A próxima parte do manifesto descreve como o aplicativo deve ser criado. A opção ``buildsystem`` definida com ``simple`` é usada, o que permite que uma sequência de comandos seja especificada, que são usados para a compilação. O local do download e o hash do aplicativo também são especificados.
ru: Следующая часть манифеста описывает, как должно быть создано приложение. Используется опция simple buildsystem, которая позволяет указать последовательность команд, используемых для сборки. Также указывается место загрузки и хеш приложения.
zh_cn: 清单文件的下一部分描述了怎样构建应用。使用了简单构建系统的选项，允许指定一系列命令来构建。下载地址和应用的hash也会进行指定。

source: Bundling NPM packages
pt_br: Empacotando pacotes NPM
ru: Объединение пакетов NPM
zh_cn: 绑定NPM包

source: The next line is how NPM modules get bundled as part of Flatpaks:
pt_br: A próxima linha é como os módulos NPM são empacotados como parte de Flatpaks:
ru: В следующей строке показано, как модули NPM объединяются как часть Flatpaks:
zh_cn: 下一行是NPM模块如何作为flatpak的一部分进行绑定：

source: Since even simple Node.js applications depend on dozens of packages, it would be impractical to specify all of them as part of a manifest file. A `Python script <https://github.com/flatpak/flatpak-builder-tools/tree/master/node>`__ has therefore been developed to download Node.js packages with NPM or Yarn and include them in an application's sources.
pt_br: Como até mesmo aplicativos simples do Node.js dependem de dezenas de pacotes, seria impraticável especificar todos eles como parte de um arquivo de manifesto. Um `script em Python <https://github.com/flatpak/flatpak-builder-tools/tree/master/node>`__ foi, portanto, desenvolvido para baixar pacotes Node.js com o NPM ou Yarn e inclui-los nas fontes do aplicativo.
ru: Поскольку даже простые приложения Node.js зависят от десятков пакетов, было бы непрактично указывать их все как часть файла манифеста. Поэтому был разработан сценарий Python <https://github.com/flatpak/flatpak-builder-tools/tree/master/npm>`__ для загрузки пакетов Node.js с NPM и включения их в исходные коды приложения.

source: The Python script requires a ``package-lock.json`` (or ``yarn.lock``) file. This file contains information about the packages that an application depends on, and can be generated by running ``npm install --package-lock-only`` from an application's root directory. The script is then run as follows::
pt_br: O script Python requer um arquivo ``package-lock.json`` (ou ``yarn.lock``). Este arquivo contém informações sobre os pacotes dos quais um aplicativo depende e pode ser gerado executando ``npm install --package-lock-only`` no diretório raiz de um aplicativo. O script é então executado da seguinte maneira::
ru: Скрипту Python требуется файл ``package-lock.json`` (или ``yarn.lock``). Он содержит информацию о пакетах, от которых зависит приложение, и может быть сгенерирован путем запуска ``npm install --package-lock-only`` из корневого каталога приложения. Затем сценарий запускается следующим образом::

source: This generates the manifest JSON needed to build the NPM/Yarn packages for the application, which are outputted to a file called ``generated-sources.json``. The content of this file can be copied to the application's manifest but, because it is often very long, it is often best to link to it from the main manifest, which is done by adding ``generated-source.json`` as a line in the manifest section, as seen above.
pt_br: Isso gera o manifesto JSON necessário para compilar os pacotes NPM/Yarn para o aplicativo, que são gerados em um arquivo chamado ``generated-sources.json``. O conteúdo desse arquivo pode ser copiado para o manifesto do aplicativo, mas, como geralmente é muito longo, é melhor vinculá-lo a partir do manifesto principal, o que é feito adicionando ``generated-source.json`` como um linha na seção do manifesto, como visto acima.
ru: Это генерирует манифест JSON, необходимый для создания пакетов NPM/Yarn для приложения, которые выводятся в файл с именем ``generated-sources.json``. Содержимое этого файла можно скопировать в манифест приложения, но, поскольку он часто бывает очень длинным, лучше всего связать его из основного манифеста, для чего в качестве файла нужно добавить файл ``generated-source.json``. в разделе манифеста, как показано выше.

source: Launching the app
pt_br: Iniciando o aplicativo
ru: Запуск приложения
zh_cn: 启动应用

source: The Electron app is run through a simple script. This can be given any name but must be specified in the manifest's ``"command":`` property. See below a sample wrapper for launching app:
pt_br: O aplicativo Electron é executado através de um script simples. Isso pode receber qualquer nome, mas deve ser especificado na propriedade ``"command":`` do manifesto. Veja abaixo um exemplo de wrapper para iniciar um aplicativo:
ru: Приложение Electron запускается с помощью простого скрипта. Этому можно присвоить любое имя, но оно должно быть указано в свойстве ``"command":`` манифеста.См. Ниже образец оболочки для запуска приложения:

source: Build commands
pt_br: Comandos de compilação
ru: Команды сборки
zh_cn: 构建命令

source: Last but not least, since the simple build option is being used, a list of build commands must be provided. As can be seen, ``npm`` is run with the ``npm_config_offline=true`` environment variable, installing dependencies from packages that have already been cached. These are copied to ``/app/main/``. Finally the ``run.sh`` script is installed to ``/app/bin/`` so that it will be on ``$PATH``:
pt_br: Por último, mas não menos importante, como a opção de compilação simples está sendo usada, uma lista de comandos de compilação deve ser fornecida. Como pode ser visto, ``npm`` é executado com a variável de ambiente ``npm_config_offline=true``, instalando dependências de pacotes que já foram armazenados em cache. Estes são copiados para ``/app/main/``. Finalmente, o script ``run.sh`` é instalado em ``/app/bin/`` para que ele esteja em ``$PATH``:
ru: И последнее, но не менее важное: поскольку используется вариант простой сборки, необходимо предоставить список команд сборки. Как видно, ``npm`` запускается с параметром ``npm_config_offline=true``, устанавливая зависимости из уже кэшированных пакетов. Они копируются в ``/app/main/``. Они копируются в ``/app/main/``. Наконец, скрипт ``run.sh`` устанавливается в``/app/bin/``, так что он будет в ``$PATH``:

source: Note that if the application you are trying to package contains a ``build`` block in ``package.json`` with instructions for Linux, this can cause ``electron-builder`` to try to fetch additional binaries at build-time (Even if `--dir` option is used). The following example shows a configuration that will try to download AppImage binaries:
pt_br: Note que se o aplicativo que você está tentando empacotar contiver um bloco ``build`` no ``package.json`` com instruções para Linux, isso pode fazer com que o ``electron-builder`` tente buscar binários adicionais em tempo de compilação (Mesmo se a opção `--dir` for usada). O exemplo a seguir mostra uma configuração que tentará baixar os binários do AppImage:
ru: Обратите внимание: если приложение, которое вы пытаетесь упаковать, содержит блок build в package.json с инструкциями для Linux, это может привести к тому, что electronic-builder попытается получить дополнительные двоичные файлыво время сборки. (Даже если используется опция `--dir`). В следующем примере показана конфигурация, которая попытается загрузить двоичные файлы AppImage:

source: The preferred way of fixing this, is not a patch, but a build-time edit using ``jq``. The following command will replace ``"target": "AppImage"`` with ``"target": "dir"``:
pt_br: A maneira preferida de corrigir isso não é um patch, mas uma edição em tempo de construção usando ``jq``. O comando a seguir substituirá ``"target": "AppImage"`` por ``"target": "dir"``:
ru: Предпочтительный способ исправить это - не патч, а редактирование во время сборки с использованием ``jq``. Следующая команда заменит ``"target": "AppImage"`` с ``"target": "dir"``:

source: Note that the extension name (last portion of reverse-dns notation, ``node14`` in this example) must be the same in ``sdk-extensions`` and ``append-path``.
ru: Обратите внимание, что имя расширения (последняя часть нотации обратного DNS, «node14» в этом примере) должно быть одинаковым в «sdk-extensions» и «append-path».

source: Command
zh_cn: 命令
