Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/elements-of-a-flatpak-app.po
Languages: de, es, fr, kr, ru

source: Elements of a Flatpak Application
de: Elemente einer Flatpak-Anwendung
es: Elementos de una aplicación Flatpak
fr: Élements d'une application Flatpak
kr: 플랫팩 응용프로그램의 구성요소
ru: Элементы приложения Flatpak

source: Flatpak expects applications to follow standard Linux desktop conventions. These are supplemented with a small number of Flatpak-specific elements that are used to distribute, install and run applications.
de: Flatpak erwartet von Anwendungen, dass sie den maßgebenden Konventionen des Linux-Desktops folgen. Diese werden um eine kleine Anzahl von Flatpak-spezifischen Elementen ergänzt. Diese werden benötigt, um die Applikationen zu verteilen, zu installieren und auszuführen.
es: Flatpak espera que las aplicaciones sigan las convenciones del estándar del escritorio Linux. Éstas son suplementadas con una pequeña cantidad de elementos específicos de Flatpak que se usan para distribuir, instalar y lanzar las aplicaciones.
fr: Flatpak s'attend à ce que les applications suivent les conventions des environnements de bureau Linux standards. Ils sont complétées par un petit nombre d'éléments spécifiques à Flatpak qui sont utilisés pour distribuer, installer and lancer les applications.
kr: 플랫팩은 응용프로그램이 표준 리눅스 데스크탑 형상을 따른다고 가정한다. 이러한 형상을 플랫팩 고유의 요소로 대체하여 응용프로그램을 배포하고 설치하고 실행한다.
ru: Flatpak ожидает, что приложения будут следовать стандартным соглашениям рабочего стола Linux. Они дополняются небольшим количеством специфичных для элементов Flatpak, которые используются для распространения, установки и запуска приложений.

source: Standard application elements
de: Standardelemente einer Anwendung
es: Elementos estándar de la aplicación
fr: Éléments d'une application standard
kr: 표준 응용프로그램 구성요소
ru: Стандартные элементы приложения

source: The following are some of the Linux desktop conventions that are supported and expected by Flatpak. Application developers are encouraged to use them.
de: Im Folgenden einige Konventionen des Linux-Desktops, die von Flatpak supportet und erwartet werden. Applikationsentwicklern wird empfohlen, diese zu verwenden.
es: Las siguientes son algunas de las convenciones del escritorio Linux consideradas y esperadas por Flatpak. Se anima a los desarrolladores de aplicaciones a usarlas.
fr: Les éléments suivants font partis des conventions des environnements de bureau Linux qui sont supportés et attendus par Flatpak. Les développeurs d'application sont encouragés à les utiliser.
kr: 플랫팩이 가정하고 지원하는 리눅스 데스크탑 표준을 아래에 열거하였다. 응용프로그램 개발을 위해 아래 표준들을 사용할 것을 권한다.
ru: Ниже приведены некоторые соглашения о рабочем столе Linux, которые поддерживаются и ожидаются в Flatpak. Разработчикам приложений рекомендуется использовать их.

source: `AppData <https://www.freedesktop.org/software/appstream/docs/chap-Quickstart.html#sect-Quickstart-DesktopApps>`_, for providing application information, such as descriptions and screenshots, that is used by app stores
de: `AppData <https://www.freedesktop.org/software/appstream/docs/chap-Quickstart.html#sect-Quickstart-DesktopApps>`_, für die Bereitstellung von Informationen zur Applikation, wie Beschreibungen und Screenshots, die von App-Stores verwendet werden
es: `AppData <https://www.freedesktop.org/software/appstream/docs/chap-Quickstart.html#sect-Quickstart-DesktopApps>`_, para proporcionar información sobre la aplicación, tal como descripciones y pantallazos, que son usados por las tiendas de apps.
fr: `AppData <https://www.freedesktop.org/software/appstream/docs/chap-Quickstart.html#sect-Quickstart-DesktopApps>`_, pour la fourniture des informations d'application, comme les descriptions et captures d'écran, qui sont utilisés dans les magasins d'application.
kr: `AppData <https://www.freedesktop.org/software/appstream/docs/chap-Quickstart.html#sect-Quickstart-DesktopApps>`_는 응용프로그램 설명문과 스크린샷과 같은 정보를 제공하는 방법이다.
ru: `AppData <https://www.freedesktop.org/software/appstream/docs/chap-Quickstart.html#sect-Quickstart-DesktopApps>`_, для предоставления информации о приложении, такой как описания и снимки экрана, которая используется магазинами приложений

source: Application icons, as specified by the `Freedesktop icon theme specification <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_
de: Anwendungssymbole, wie spezifiziert in der `Freedesktop icon theme specification <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_
es: Iconos de aplicación, especificados por la `Especificación de temas de iconos <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_.
fr: Icônes d'application, comme spécifié par la `spécification de thème d'icones Freedesktop <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_
kr: `Freedesktop icon theme specification <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_은 응용프로그램 아이콘 형식을 명세한다.
ru: Значки приложений, как указано в спецификации темы значков Freedesktop <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`_

source: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, for interaction with the host
de: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, zur Interaktion mit dem Host-System
es: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, para interacciones con el host.
fr: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, pour l'intéraction avec l'hôte
kr: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_를 이용하여 호스트와 통신한다.
ru: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, для взаимодействия с хост-системой

source: `Desktop files <https://standards.freedesktop.org/desktop-entry-spec/latest/>`_, for providing basic information about the application
de: `Desktop files <https://standards.freedesktop.org/desktop-entry-spec/latest/>`_, zur Bereitstellung von Basisinformationen über die Anwendung
es: `Archivos de escritorio <https://standards.freedesktop.org/desktop-entry-spec/latest/>`_, para proporcionar información básica sobre la aplicación.
fr: `Fichiers Desktop <https://standards.freedesktop.org/desktop-entry-spec/latest/>`_, pour la fourniture d'information basic à propos de l'application
kr: `Desktop files <https://standards.freedesktop.org/desktop-entry-spec/latest/>`_을 이용하여 응용프로그램에 관한 기본 정보를 제공한다.
ru: `Desktop files <https://standards.freedesktop.org/desktop-entry-spec/latest/>`_, для предоставления основной информации о приложении

source: `PulseAudio <https://www.freedesktop.org/wiki/Software/PulseAudio/>`_, for sound
de: `PulseAudio <https://www.freedesktop.org/wiki/Software/PulseAudio/>`_ für Sound
es: `PulseAudio <https://www.freedesktop.org/wiki/Software/PulseAudio/>`_, para sonido.
fr: `PulseAudio <https://www.freedesktop.org/wiki/Software/PulseAudio/>`_, pour le son
kr: `PulseAudio <https://www.freedesktop.org/wiki/Software/PulseAudio/>`_을 이용하여 소리를 낸다.
ru: `PulseAudio <https://www.freedesktop.org/wiki/Software/PulseAudio/>`_ для звука

source: `X11 <https://www.x.org/wiki/>`_ and `Wayland <https://wayland.freedesktop.org/>`_, for display
de: `X11 <https://www.x.org/wiki/>`_ und `Wayland <https://wayland.freedesktop.org/>`_ für die Darstellung
es: `X11 <https://www.x.org/wiki/>`_ y `Wayland <https://wayland.freedesktop.org/>`_, para la visualización.
fr: `X11 <https://www.x.org/wiki/>`_ et `Wayland <https://wayland.freedesktop.org/>`_, pour l'affichage
kr: `X11 <https://www.x.org/wiki/>`_ 과 `Wayland <https://wayland.freedesktop.org/>`_를 사용하여 화면을 표시한다.
ru: `X11 <https://www.x.org/wiki/>`_ und `Wayland <https://wayland.freedesktop.org/>`_ для отображения

source: Application structure
de: Applikationsstruktur
es: Estructura de la aplicación
fr: Structure d'une application
kr: 응용프로그램 구조
ru: Структура приложения

source: When an application is built using flatpak, it is outputted with the following structure:
de: Wenn eine Anwendung generiert wird mittels Flatpak, wird diese ausgegeben mit der folgenden Struktur:
es: Cuando una aplicación se construye usando flatpak, la salida cuenta con la siguiente estructura:
fr: Quand une application est construite à l'aide de flatpak, elle est … avec la structure suivante
kr: 플랫팩을 이용하여 응용프로그램을 빌드하면 다음과 같은 구조로 빌드 결과물이 생성된다.
ru: Когда приложение создается с использованием flatpak, оно выводится со следующей структурой:

source: ``metadata`` - a keyfile which provides information about the application
de: ``metadata`` – eine Schlüsseldatei, die Informationen über die Anwendung enthält
es: ``metadata`` - Un archivo clave que proporciona información sobre la aplicación.
fr: ``metadata`` - un fichier clé-valeur qui fournit une information à propos de l'application
kr: ``metadata`` - 응용프로그램에 관한 정보를 제공하는 핵심 파일 (keyfile)
ru: ``metadata`` – ключевой файл, который предоставляет информацию о приложении

source: ``/files`` - the files that make up the application, include source code and application data
de: ``/files`` – die Dateien, die die Anwendung bilden, dies beinhaltet den Quellcode und die Anwendungsdaten
es: ``/files`` - Los archivos que hacen a la aplicación, incluye el código fuente y los datos.
fr: ``/files`` - les fichier qui constitue l'application, dont le code source et les données de l'applicaton
kr: ``/files`` - 응용프로그램을 구성하는 소스코드와 데이터 등
ru: ``/files`` – файлы, из которых состоит приложение, включая исходный код и данные приложения

source: ``/files/bin`` - application binaries
de: ``/files/bin`` – Applikationsbinärdateien
es: ``/files/bin`` - Binarios de la aplicación.
fr: ``/files/bin`` - binaires de l'application
kr: ``/files/bin`` - 응용프로그램 실행파일들
ru: ``/files/bin`` – исполняемые файлы приложения

source: ``/export`` - files which the host environment needs access to, such as the application's AppData, .desktop file, icon and D-Bus service files
de: ``/export`` – Dateien, zu denen die Hostumgebung Zugriff benötigt, wie AppData der Applikation, die `.desktop`-Datei, das Icon und die D-Bus-Dienstdateien
es: ``/export`` - Archivos a los que el entorno del host necesita acceder, tales como la AppData de la aplicación, el archivo .desktop, icono y archivos de servicios de D-Bus.
fr: ``/export`` - les fichiers que l'environnement de l'hôte a besoin d'accéder, comme l'AppData de l'application, le fichier ``.desktop``, les fichiers du service D-Bus et des icônes
kr: ``/export`` - 응용프로그램의 `AppData`, `.desktop`, `icon`, `D-Bus` 서비스 파일 등 호스트 환경이 접근해야 하는 파일들
ru: ``/export`` – файлы, к которым хост-среде нужен доступ, такие как AppData приложения, файл .desktop, значок и служебные файлы D-Bus

source: All the files in the export directory must have the application ID as their prefix. For example:
de: Alle Dateien in dem Exportverzeichnis müssen die Applikations-ID als ihr Präfix besitzen. Zum Beispiel:
es: Todos los archivos en el directorio de exportación deben tener el ID de la aplicación como prefijo. Por ejemplo:
fr: Tous les fichiers dans le répertoire ``/export`` doivent avoir un identifiant d'application comme préfixe. Par exemple:
ru: Все файлы в каталоге экспорта должны иметь идентификатор приложения в качестве префикса. Например:

source: Naming files in this way prevents naming conflicts and ensures that system installed applications aren't overwritten.
de: Dateien in dieser Form zu benennen, schützt vor Namenskonflikten und garantiert, dass systemseitig installierte Anwendungen nicht überschrieben werden.
es: Nombrar a los archivos de esta forma previene conflictos de nombres y asegura que no se sobreescriban las aplicaciones instaladas en el sistema.
fr: Nommer les fichiers de cette façon évite les conflits de nommage et assure que les applications installées sur le système ne sont pas écrasées.
kr: 파일들을 명명할 때 위와같이 하여 시스템에 설치된 파일들과의 파일명 충돌 가능성을 줄일 수 있다.
ru: Такое присвоение имен файлам предотвращает конфликты имен и гарантирует, что установленные системные приложения не будут перезаписаны.

source: To name exported files in this way, either rename the relevant source files or use flatpak-builder to rename the files at build time (this is explained in more detail in `the section on flatpak-builder <flatpak-builder.html>`_).
de: Um exportierte Dateien in dieser Form zu benennen, müssen die relevanten Quelldateien umbenannt oder Flatpak Builder verwendet werden, um die Dateien während des Erstellungsprozesses umzubenennen (dies wird detaillierter beschrieben in dem `Kapitel über Flatpak Builder <flatpak-builder.html>`_).
es: Para nombrar archivos exportados de esta forma, se puede renombrar los archivos fuente relevantes, o usar flatpak-builder para renombrar los archivos durante la construcción. Esto último se explica en más detalle en la sección sobre `flatpak-builder <flatpak-builder.html>`_.
fr: Pour nommer les fichiers exportés de cette façon, soit renommez les fichiers sources pertients ou utilisez ``flatpak-builder`` pour renommer les fichiers au moment de la construction (Ceci est plus amplement détaillé dans `la section sur flatpak-builder <flatpak-builder.html>`_).`
kr: 외부로 노출된 파일들을 위와 같이 명명하기 위해서는 소스코드 내에서 사용 중인 파일명을 재명명하거나 플랫팩 빌더(flatpak-builder)를 사용하여 빌드 시간에 파일명을 재명명하도록 해야 한다 (보다 상세한 내용은 `플랫팩 빌더 섹션 <flatpak-builder.html>`_ 에 기술되어 있다).
ru: Чтобы назвать экспортированные файлы таким образом, либо переименуйте соответствующие исходные файлы, либо используйте flatpak-builder для переименования файлов во время сборки (более подробно это объясняется в `разделе о flatpak-builder <flatpak-builder.html>`_ ).

source: Metadata files
de: Metadatendateien
es: Archivos de metadatos
fr: Fichier ``metadata``
kr: 메타데이터 파일들
ru: Файлы метаданных

source: An application's ``metadata`` file provides information that allows flatpak to set up the sandbox for running the application. A typical metadata file looks like this::
de: Die ``metadata``-Datei einer Anwendung beinhaltet Informationen, die es Flatpak erlauben, die Sandbox so einzurichten, dass die Applikation in ihr laufen kann. Eine typische Metadatendatei sieht so aus::
es: El archivo ``metadata`` de una aplicación proporciona información que permite a flatpak configurar el sandbox para lanzar la aplicación. Un archivo metadata típico luce así::
fr: Un fichier ``metadata`` d'une application fournit l'information qui permet à Flatpak de déployer le bac à sable pour faire tourner l'application. Un fichier ``metadata`` typique ressemble à cela::
kr: 응용프로그램의 메타데이터(``metadata``) 파일은 플랫팩이 응용프로그램 실행을 위한 샌드박스를 설정하도록 한다. 일반적인 메타데이터 파일은 다음과 같이 생겼다::
ru: Файл ``metadata`` приложения предоставляет информацию, которая позволяет flatpak настроить песочницу для запуска приложения. Типичный файл метаданных выглядит так::

source: This specifies the name of the application, the runtime it requires, the SDK that it was built against and the command used to run it. It also specifies file and device access, sets certain environment variables (inside the application's sandbox, of course), and how it connects to the session bus. Details on how to change these metadata parameters are included in subsequent sections.
de: Dies spezifiziert den Namen der Anwendung, die benötigte Runtime, das SDK, gegen die sie erzeugt wurde und das Kommando, mit dem man sie ausführt. Es spezifiziert zudem Datei- und Gerätezugriff, setzt verschiedene Umgebungsvariablen (natürlich innerhalb der Anwendungssandbox) und gibt an, wie sie sich mit dem Session-Bus konnektiert. Details, wie man diese Metadatenparameter ändert, sind in nachfolgenden Abschnitten vorhanden.
es: Esto especifica el nombre de la aplicación, el runtime que requiere, el SDK con el que fue construida y el comando que se usa para lanzarla. También especifica el acceso a archivos y dispositivos, asigna variables de entorno (por supuesto, dentro del sandbox de la aplicación), y cómo se conecta con el bus de sesión. En las siguientes secciones se incluyen detalles sobre como cambiar estos parámetros de los metadatos.
fr: Cela spécifie le nom de l'application, quel runtime il nécessite, le SDK avec lequel il a été construit et la commande utilisé pour la lancer. Il spécifie aussi les accès aux fichiers et aux périphériques, définit certaines variables d'environnement (à l'intérieur du bac à sable de l'application bien sûr), et comment se connecter au bus de session. Les détails sur comment changer les paramètres méta-données sont inclus dans les sections suivantes.
kr: 응용프로그램의 이름, 실행에 필요한 런타임, 빌드 시 사용한 SDK, 실행을 위해 입력해야 하는 명령어 등이 기술되어 있다. 또한 파일 및 장치 접근 내역, 환경변수 설정 (샌드박스 내에서의) 내용, 세션버스로의 연결 방법도 기술되어 있다. 메타데이터의 인자들을 변경하는 방법은 다른 장에서 다룬다.
ru: Здесь указывается имя приложения, требуемая среда выполнения, SDK, для которого оно было создано, и команда, используемая для его запуска. Он также определяет доступ к файлам и устройствам, устанавливает определенные переменные среды (конечно, внутри песочницы приложения) и способ подключения к сеансовой шине. Подробная информация о том, как изменить эти параметры метаданных, включена в последующие разделы.

source: While it is most common to encounter metadata files for applications, runtimes and extensions also have them.
de: Während es gängig ist, Metadatendateien für Applikationen vorzufinden, sind diese zudem auch für die Laufzeitumgebungen und Erweiterungen vorhanden.
es: Si bien es más común encontrar archivos de metadatos para las aplicaciones, los runtimes y las extensiones también los tienen.
fr: Bien qu'il est plus commun de trouver des fichiers méta-données pour les applications, les runtimes et les extensions en possèdent aussi.
kr: 응용프로그램에 대한 메타데이터가 일반적이나, 런타임이나 확장(Extension)을 위한 메타데이터도 있다.
ru: Хотя чаще всего встречаются файлы метаданных для приложений, они также есть в средах выполнения и расширениях.

source: All the files in the ``/export`` directory must have the application ID as their prefix. For example:
kr: ``/export`` 디렉토리에 있는 모든 파일들은 파일 이름의 앞부분에(prefix) 응용프로그램 ID를 포함해야한다. 예를 들면 다음과 같다:
