Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/first-build.po
Languages: ko, pt_br, ru, zh_cn

source: Building your first Flatpak
ko: 첫번째 플랫팩 응용프로그램 빌드
pt_br: Compilando seu primeiro Flatpak
ru: Создайте свой первый Flatpak
zh_cn: 构建你的第一个flatpak应用

source: This tutorial provides a quick introduction to building Flatpaks. In it, you will learn how to create a basic Flatpak application, which can be installed and run.
ko: 이 튜토리얼은 플랫팩을 간략히 소개한다. 이를 통해 기본 플랫팩 응용프로그램을 생성하고, 설치 및 실행하는 방법을 배운다.
pt_br: Este tutorial fornece uma rápida introdução à compilação de Flatpaks. Nele, você aprenderá como criar um aplicativo Flatpak básico, que pode ser instalado e executado.
ru: Это руководство представляет собой быстрое введение в создание Flatpak. В нем вы узнаете, как создать базовое приложение Flatpak, которое можно установить и запустить.
zh_cn: 这个教程提供了一个构建flatpak的简单介绍。你可以从它学习到如何创建一个基础的可以被安装和运行的flatpak应用。

source: In order to complete this tutorial, you should have followed the `setup guide on flatpak.org <https://flatpak.org/setup/>`_. You also need to have installed ``flatpak-builder``, which is usually available from the same repository as the ``flatpak`` package (e.g. use ``apt`` or ``dnf``). You can also install it as a flatpak with ``flatpak install flathub org.flatpak.Builder``.
pt_br: Para concluir este tutorial, você deve ter seguido o `guia de configuração em flatpak.org <https://flatpak.org/setup/>`_. Você também precisa ter instalado o ``flatpak-builder``, que geralmente está disponível no mesmo repositório que o pacote ``flatpak`` (por exemplo, use ``apt`` ou ``dnf``). Você também pode instalá-lo como um flatpak com ``flatpak install flathub org.flatpak.Builder``.
ru: Чтобы выполнить это руководство, вы должны были следовать `руководству по установке на flatpak.org <https://flatpak.org/setup/>`_. Вам также необходимо установить ``flatpak-builder``, который обычно доступен в том же репозитории, что и пакет ``flatpak`` (например, используйте ``apt`` или ``dnf``). Вы также можете установить его как flatpak с помощью ``flatpak install flathub org.flatpak.Builder``.

source: 1. Install a runtime and the matching SDK
ko: 1. 런타임과 SDK 쌍 설치
pt_br: 1. Instale um runtime e o SDK correspondente
ru: 1. Установите среду выполнения и соответствующий SDK
zh_cn: 1. 安装一个runtime和匹配的SDK

source: Flatpak requires every app to specify a runtime that it uses for its basic dependencies. Each runtime has a matching SDK (Software Development Kit), which contains all the things that are in the runtime, plus headers and development tools. This SDK is required to build apps for the runtime.
ko: 플랫팩은 각 응용프로그램이 런타임을 지정하여 기본적인 의존성을 해결하도록 한다. 각 런타임에는 그와 짝을 이루는 SDK(Software Development Kit)가 존재하는데, 여기에는 실행시간에 필요한 모든 자원 및 헤더파일과 개발도구들이 담겨있다. SDK는 응용프로그램을 빌드할 때 사용된다.
pt_br: O Flatpak exige que cada aplicativo especifique um runtime que ele usa para suas dependências básicas. Cada runtime possui um SDK (Kit de desenvolvimento de software) correspondente, que contém tudo o que está no runtime, além de cabeçalhos e ferramentas de desenvolvimento. Esse SDK é necessário para compilar aplicativos para o runtime.
ru: Flatpak требует, чтобы каждое приложение указывало среду выполнения, которую оно использует для своих основных зависимостей. Каждая среда выполнения имеет соответствующий SDK (Software Development Kit), который содержит все, что есть в среде выполнения, а также заголовки и инструменты разработки. Этот пакет SDK необходим для создания приложений для среды выполнения.
zh_cn: flatpak要求每个应用指明一个runtime，作为它的基本依赖。每个runtime有一个匹配的SDK（软件开发套件），包含了runtime里面的所有东西，加上头文件和开发工具。构建应用的时候需要这个SDK。

source: In this tutorial we will use the Freedesktop 22.08 runtime and SDK. To install these, run::
ru: В этом руководстве мы будем использовать среду выполнения Freedesktop 22.08 и SDK. Чтобы установить их, запустите::

source: 2. Create the app
ko: 2. 응용프로그램 생성
pt_br: 2. Crie o aplicativo
ru: 2. Создайте приложение
zh_cn: 2. 创建应用

source: The app that is going to be created for this tutorial is a simple script. To create it, copy the following::
ko: 튜토리얼을 통해 생성하는 응용프로그램은 간단한 스크립트이다. 빠른 생성을 위해 다음 내용을 빈 파일에 복사한다::
pt_br: O aplicativo que será criado para este tutorial é um script simples. Para criá-lo, copie o seguinte::
ru: Приложение, которое будет создано для этого урока, представляет собой простой скрипт. Чтобы создать его, скопируйте следующее::
zh_cn: 这个教程要创建的个应用是一个简单的脚本。为了创建它，复制下面的内容::

source: Now paste this into an empty file and save it as ``hello.sh``.
pt_br: Agora cole isso em um arquivo vazio e salve-o como ``hello.sh``.
ru: Теперь вставьте это в пустой файл и сохраните как ``hello.sh``.
zh_cn: 现在粘贴它到一个空文件然后保存为 `` hello.sh `` 。

source: 3. Add a manifest
ko: 3. manifest 추가
pt_br: 3. Adicione um manifesto
ru: 3. Добавьте манифест
zh_cn: 3. 添加一个清单文件

source: Each Flatpak is built using a manifest file which provides basic information about the application and instructions for how it is to be built. To add a manifest to the hello world app, add the following to an empty file:
ko: 각 플랫팩은 빌드 시, 응용프로그램에 대한 기본 정보와 빌드 방법을 기술하고 있는 manifest 파일을 사용한다. Hello world 응용을 위해 manifest를 추가하려면 빈 파일에 다음과 같은 내용을 추가한다:
pt_br: Cada Flatpak é compilado usando um arquivo de manifesto que fornece informações básicas sobre o aplicativo e instruções sobre como ele deve ser compilado. Para adicionar um manifesto ao aplicativo “hello world”, adicione o seguinte a um arquivo vazio:
ru: Каждый Flatpak создается с использованием файла манифеста, который предоставляет основную информацию о приложении и инструкции по его созданию. Чтобы добавить манифест в приложение hello world, добавьте в пустой файл следующее:
zh_cn: 每个flatpak都用一个清单文件来构建，它提供了这个应用的基本信息和如何构建它的指令。为hello world应用添加一个清单文件，添加如下内容到一个空文件：

source: Now save the file alongside ``hello.sh`` and call it ``org.flatpak.Hello.yml``.
pt_br: Agora salve o arquivo junto com ``hello.sh`` e chame-o de ``org.flatpak.Hello.yml``.
ru: Теперь сохраните файл вместе с ``hello.sh`` и назовите его ``org.flatpak.Hello.yml``.

source: In a more complex application, the manifest would list multiple modules. The last one would typically be the application itself, and the earlier ones would be dependencies that are bundled with the app because they are not part of the runtime.
ko: 보다 복잡한 응용프로그램의 경우 manifest는 여러개의 모듈로 구성될 수 있다. 이 때, 일반적으로 마지막에 나열된 모듈이 응용프로그램 자신이고, 그보다 위의 모듈들은 응용프로그램이 의존하는 자원으로서, 런타임에 포함되지 않아 응용프로그램과 함께 묶여 배포된다.
pt_br: Em um aplicativo mais complexo, o manifesto listaria vários módulos. O último seria tipicamente o próprio aplicativo, e os anteriores seriam dependências incluídas no aplicativo porque não fazem parte do runtime.
ru: В более сложном приложении в манифесте будет перечислено несколько модулей. Последним обычно является само приложение, а более ранние - зависимости, которые связаны с приложением, поскольку они не являются частью среды выполнения.
zh_cn: 在一个更加复杂的应用中，这个清单文件会列出多个模块。通常最后一个是应用本身，前面的是要和应用绑定的依赖，因为他们不是runtime的一部分。

source: 4. Build the application
ko: 4. 응용프로그램 빌드
pt_br: 4. Compile o aplicativo
ru: 4. Соберите приложение
zh_cn: 4. 构建应用

source: Now that the app has a manifest, ``flatpak-builder`` can be used to build it. This is done by specifying the manifest file and a target directory::
pt_br: Agora que o aplicativo tem um manifesto, o ``flatpak-builder`` pode ser usado para compilá-lo. Isso é feito especificando o arquivo de manifesto e um diretório de destino::
ru: Теперь, когда у приложения есть манифест, для его сборки можно использовать ``flatpak-builder``. Это делается путем указания файла манифеста и целевого каталога::
zh_cn: 现在这个应用有一个清单文件， `` flatpak-builder `` 可以用来构建它。通过指明一个清单文件和一个目标目录::

source: This command will build each module that is listed in the manifest and install it to the ``/app`` subdirectory, inside the ``build-dir`` directory.
pt_br: Este comando criará cada módulo listado no manifesto e o instalará no subdiretório ``/app``, dentro do diretório ``build-dir``.
ru: Эта команда соберет каждый модуль, указанный в манифесте, и установит его в подкаталог ``/app`` внутри каталога ``build-dir``.
zh_cn: 这个命令会构建每个列在清单文件里的模块，然后将它安装到 `` build-dir `` 的 `` /app `` 子目录。

source: 5. Test the build
ko: 5. 빌드 테스트
pt_br: 5. Teste a compilação
ru: 5. Протестируйте сборку
zh_cn: 5. 测试构建

source: To verify that the build was successful, run the following::
ko: 빌드가 성공적이었는지 확인하려면 다음과 같이 실행 해 본다::
pt_br: Para verificar se a compilação foi bem-sucedida, execute o seguinte::
ru: Чтобы убедиться, что сборка прошла успешно, запустите следующую команду::
zh_cn: 为了确认构建成功，运行::

source: This second time we passed in ``--force-clean``, which means that the previously created ``build-dir`` directory was deleted before the new build was started.
pt_br: Nesta segunda vez, passamos ``--force-clean``, o que significa que o diretório ``build-dir`` criado anteriormente foi excluído antes do início da nova compilação.
ru: Во второй раз мы передали ``--force-clean``, что означает, что ранее созданный каталог ``build-dir`` был удален до запуска новой сборки.
zh_cn: 第二次我们通过 `` --force-clean `` ，会在新的构建开始之前删除先前创建的 `` build-dir `` 目录。

source: Congratulations, you've made an app!
ko: 응용프로그램이 성공적으로 빌드되었다!
pt_br: Parabéns! Você fez um aplicativo!
ru: Поздравляем, вы создали приложение!
zh_cn: 恭喜，你已经创建了一个应用！

source: 6. Put the app in a repository
ko: 6. 저장소에 응용프로그램 추가
pt_br: 6. Coloque o aplicativo em um repositório
ru: 6. Поместите приложение в репозиторий
zh_cn: 6. 将应用放到仓库

source: If you want to share the application you can put it in a repository. This is done by passing the ``--repo`` argument to ``flatpak-builder``::
pt_br: Se você quiser compartilhar o aplicativo, você pode colocá-lo em um repositório. Isso é feito passando o argumento ``--repo`` para ``flatpak-builder``::
ru: Прежде чем вы сможете установить и запустить приложение, его сначала нужно поместить в репозиторий. Это делается путем передачи аргумента ``--repo`` параметру ``flatpak-builder``::

source: This does the build again, and at the end exports the result to a local directory called ``repo``. Note that ``flatpak-builder`` keeps a cache of previous builds in the ``.flatpak-builder`` subdirectory, so doing a second build like this is very fast.
pt_br: Isso faz a compilação novamente e, no final, exporta o resultado para um diretório local chamado ``repo``. Observe que o ``flatpak-builder`` mantém um cache de compilações anteriores no subdiretório ``.flatpak-builder``, portanto, fazer uma segunda compilação como essa é muito rápido.
ru: Это снова выполнит сборку и в конце экспортирует результат в локальный каталог под названием ``repo``. Обратите внимание, что ``flatpak-builder`` хранит кеш предыдущих сборок в подкаталоге ``.flatpak-builder``, поэтому создание второй такой сборки выполняется очень быстро.
zh_cn: 这将再次进行构建，最后将结果导出到名为 `` repo `` 的本地目录。注意， `` flatpak-builder `` 在 `` .flatpak-builder `` 子目录下保存了先前构建的缓存，所以像这样进行二次构建非常快。

source: In order for your application to show up in application stores while testing with a local repository, you might have to run ``flatpak build-update-repo repo``. For more information how to publish to application stores see `Appdata files <https://docs.flatpak.org/en/latest/freedesktop-quick-reference.html#appdata-files>`_.
ru: Чтобы ваше приложение отображалось в магазинах приложений во время тестирования с локальным репозиторием, вам может потребоваться запустить ``flatpak build-update-repo repo``. Дополнительные сведения о публикации в магазинах приложений см. в разделе `Файлы `Appdata <https://docs.flatpak.org/en/latest/freedesktop-quick-reference.html#appdata-files>`_.

source: 7. Install the app
ko: 7. 응용프로그램 설치
pt_br: 7. Instale o aplicativo
ru: 7. Установите приложение
zh_cn: 7. 安装应用

source: Now we're ready to add the repository that was just created and install the app. This is done with two commands::
ko: 이제 막 생성된 저장소를 추가하고 응용프로그램을 설치할 준비가 되었다. 다음 두 명령어를 입력 해 보자::
pt_br: Agora estamos prontos para adicionar o repositório que acabou de ser criado e instalar o aplicativo. Isso é feito com dois comandos::
ru: Теперь мы готовы добавить только что созданный репозиторий и установить приложение. Это делается двумя командами::
zh_cn: 现在我们准备好添加创建的仓库并安装应用。通过两个命令来完成::

source: The first command adds the repository that was created in the previous step. The second command installs the app from the repository.
ko: 첫번째 명령은 위에서 막 생성한 저장소를 추가하는 명령이다. 두번째 명령은 저장소로부터 응용프로그램을 받아 설치하는 명령이다.
pt_br: O primeiro comando adiciona o repositório que foi criado na etapa anterior. O segundo comando instala o aplicativo a partir do repositório.
ru: Первая команда добавляет репозиторий, созданный на предыдущем шаге. Вторая команда устанавливает приложение из репозитория.
zh_cn: 第一个命令添加先前步骤创建的的仓库。第二个命令从仓库安装应用。

source: Both these commands use the ``--user`` argument, which means that the repository and the app are added per-user rather than system-wide. This is useful for testing.
pt_br: Os dois comandos usam o argumento ``--user``, o que significa que o repositório e o aplicativo são adicionados por usuário e não em todo o sistema. Isso é útil para testes.
ru: Обе эти команды используют аргумент ``--user``, что означает, что репозиторий и приложение добавляются для каждого пользователя, а не для всей системы. Это полезно для тестирования.
zh_cn: 两个命令都使用 `` --user `` 参数，表明仓库和应用是按照用户来添加而不是系统范围的。这在测试的时候很管用。

source: Note that the repository was added with ``--no-gpg-verify``, since a GPG key wasn't specified when the app was built. This is fine for testing, but for official repositories you should sign them with a private GPG key.
pt_br: Observe que o repositório foi adicionado com ``--no-gpg-confirm``, pois uma chave GPG não foi especificada quando o aplicativo foi construído. Isso é bom para testes, mas para repositórios oficiais, você deve assiná-los com uma chave GPG privada.
ru: Обратите внимание, что репозиторий был добавлен с помощью ``--no-gpg-verify``, поскольку ключ GPG не был указан при создании приложения. Это нормально для тестирования, но для официальных репозиториев вы должны подписывать их закрытым ключом GPG.
zh_cn: 注意创建仓库添加了 `` --no-gpg-verify `` 参数，因为应用创建的时候没有指明GPG密钥。测试的时候这样做完全没有问题，但是官方的仓库必须使用一个私有的GPG秘钥签名。

source: 8. Run the app
ko: 8. 응용프로그램 실행
pt_br: 8. Execute o aplicativo
ru: 8. Запустите приложение
zh_cn: 8. 运行应用

source: All that's left is to try the app. This can be done with the following command::
ko: 이제 남은 작업은 응용프로그램을 실행하는 것 뿐이다. 다음과 같이 실행할 수 있다. ::
pt_br: Tudo o que resta é experimentar o aplicativo. Isso pode ser feito com o seguinte comando::
ru: Осталось только испытать приложение. Это можно сделать с помощью следующей команды::
zh_cn: 剩下的就是试用应用。通过执行如下命令::

source: This runs the app, so that it prints 'Hello world, from a sandbox'.
pt_br: Isso executa o aplicativo, para que ele imprima 'Hello world, from a sandbox'.
ru: Это запускает приложение, и оно печатает «Hello world, from sandbox».
zh_cn: 这运行了应用，使它打印“Hello world, from a sandbox”。

source: In order to complete this tutorial, you should have followed the `setup guide on flatpak.org <http://flatpak.org/setup/>`_. You also need to have installed ``flatpak-builder``, which is usually available from the same repository as the ``flatpak`` package.
zh_cn: 为了完成这个教程，你应该阅读 `flatpak.org上的安装指南<http://flatpak.org/setup/>`_ 。同时需要安装 `` flatpak-builder `` ，它通常可以在 `` flatpak `` 包所在的仓库找到。

source: In this tutorial we will use the Freedesktop 1.6 runtime and SDK. To install these, run::
ko: 이 튜토리얼는 Freedesktop 런타임 버전 1.6을 사용할 예정이며, 해당 런타임은 플랫팩 저장소에서 제공한다. 저장소를 추가하려면 다음과 같이 입력한다:
zh_cn: 在这个教程中，我们将使用Freedesktop 1.6 runtime和SDK。安装这些，运行::

source: Now save the file alongside ``hello.sh`` and call it ``org.flatpak.Hello.json``.
zh_cn: 现在保存这个文件到 `` hello.sh `` 旁边，命名为 `` org.flatpak.Hello.json `` 。

source: Before you can install and run the app, it first needs to be put in a repository. This is done by passing the ``--repo`` argument to ``flatpak-builder``::
zh_cn: 在你运行和安装这个应用之前，它首先需要被放到一个仓库里。通过传递 `` --repo `` 参数给 `` flatpak-builder `` ::
