Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/flatpak-builder.po
Languages: de, ko, kr, pt_br, ru, zh_cn

source: Most applications require additional dependencies that aren't provided by their runtimes. Flatpak allows these dependencies to be bundled as part of the application itself. In order to do this, each dependency must be built inside the application build directory. The ``flatpak-builder`` tool automates this multi-step build process, making it possible to build all application modules with a single command.
de: Die meisten Anwendungen benötigen zusätzliche Abhängigkeiten, die nicht von ihren Laufzeitumgebungen bereit gestellt werden. Flatpak erlaubt es, diese Abhängigkeiten als Teil der Anwendung selbst zu bündeln. Um dies durchzuführen, muss jede Abhängigkeit innerhalb des Build-Verzeichnisses der App erzeugt werden. Das ``flatpak-builder``-Tool automatisiert diesen mehrstufigen Buildprozess und ermöglicht es, alle Applikationsmodule mit einem einzigen Kommando zu erzeugen.
kr: La plupart des applications nécessite des dépendances additionnelles qui ne sont pas fournies avec leur runtime. Flatpak permet à ces dépendances d'être incluses à l'application elle-même. Pour faire ceci, chaque dépendance doit être construite à l'intérieur du répertoire de construction. L'outil ``flatpak-builder`` automatise ce processus de plusieurs étapes, permettant de contruire tous les modules avec une seule commande.

source: flatpak-builder expects modules to be built in the standard manner by following what is called the `Build API <https://github.com/cgwalters/build-api/>`_. This requires modifying modules to follow the build API, if they don't already.
de: Flatpak Builder erwartet, dass Module mit der Standardmethode erzeugt werden, der `Build-API <https://github.com/cgwalters/build-api/>`_ folgend. Dies setzt voraus, Module so zu modifizieren, dass sie sich an die Build-API halten, wenn dies noch nicht der Fall ist.
kr: flatpak-builder s'attend que les modules soient construits de manière standard en suivant ce qui est appelé l'`API Build <https://github.com/cgwalters/build-api/>`_. Cela requiert la modification des modules pour qu'ils suivent l'API de construction, si ils ne le suivent pas déjà.

source: All json entities are explained in the man page of ``flatpak-builder``.
de: Alle JSON-Entitäten sind erläutert in der Man-Page von ``flatpak-builder``.
kr: Toutes les entités json sont décrites dans la page de manuel de ``flatpak-builder``.

source: Manifests
de: Manifeste
kr: Manifestes

source: The input to flatpak-builder is a JSON file that describes the parameters for building an application, as well as each of the modules to be bundled. This file is called the manifest. Module sources can be of several types, including ``.tar`` or ``.zip`` archives, Git or Bzr repositories, patch files or shell commands that are run.
de: Die Eingabe für Flatpak Builder ist eine JSON-Datei, die die Parameter beschreibt für das Erstellen einer Applikation, ebenso wie für jedes Modul, das beigefügt wird. Diese Datei wird das Manifest genannt. Modulquellen können verschiedenartigen Typs sein, inklusive `.tar`- oder `.zip`-Archive, Git- oder Bzr-Repositorys, Patchdateien oder laufende Shellkommandos.
kr: L'entrée pour flatpak-builder est un fichier JSON descrivant les paramètres pour construire une application, ainsi que les modules à intégrer. Ce fichier est appelé le manifeste. Les sources de modules peuvent être de plusieurs types, comme des archives ``.tar`` ou ``.zip``, des dépôts Git ou Bzr, des fichiers patch ou des commandes shell à exécuter.

source: The GNOME Dictionary manifest is short, because the only module is the application itself::
de: Das GNOME Dictionary Manifest ist kurz, da das einzige Modul die Applikation selbst ist::
kr: Le manifeste du Dictionnaire GNOME est court, parce que le seul module est l'application elle-même::

source: As can be seen, this manifest includes basic information about the application before specifying a single .tar file to be downloaded and built. More complex manifests include a sequence of modules.
de: Wie man sehen kann, enthält dieses Manifest Basisinformationen über die Anwendung, bevor eine einzelne `.tar`-Datei spezifiziert wird, die dann heruntergeladen und erzeugt wird. Komplexere Module beinhalten eine Sequenz von Modulen.
kr: Comme vous pouvez voir, ce manifeste inclus les informations basiques à propos de l'application avant de spécifier un seul fichier .tar à télécharger et construire. Des manisfestes plus complexes include une suite de modules.

source: Cleanup
de: Aufräumarbeiten
kr: Nettoyage

source: After building has taken place, flatpak-builder performs a cleanup phase. This can be used to remove headers and development documentation, among other things. Two properties in the manifest file are used for this. First, a list of filename patterns can be included::
de: Nach Abschluss der Erstellung führt Flatpak Builder eine Aufräumphase durch. Diese kann genutzt werden, um Header und Entwicklerdokumentation zu entfernen, neben anderen Dingen. Zwei Eigenschaften in der Manifestdatei werden hierfür genutzt. Zuerst kann eine Liste von Dateinamenmustern hinzugefügt werden::
kr: Après que la construction ait été faite, flatpak-builder réalise une phase de nettoyage. Cela peut être utilisé pour supprimer les en-têtes et la documentation de développement, parmis d'autres choses. Deux propriétés dans le fichier manisfeste sont utilisés pour cela. Premièrement, une liste de patrons de nom de fichiers peut être incluse::

source: The second cleanup property is a list of commands that are run during the cleanup phase::
de: Die zweite Aufräumeigenschaft ist eine Liste von Kommandos, die während der Aufräumphase durchlaufen wird::
kr: La seconde propriété de nettoyage est une liste de commandes qui sera lancée durant la phase de nettoyage::

source: Cleanup properties can be set on a per-module basis, in which case only filenames that were created by that particular module will be matched.
de: Aufräumeigenschaften können pro Modul gesetzt werden. In diesem Fall werden lediglich Dateinamen gefunden, die von dem jeweiligen Modul erstellt wurden.
kr: Les propriétés de nettoyage peuvent être définies par module, dans ce cas seuls les fichiers créés dans ce module particulier seront ciblés.

source: File renaming
de: Umbenennen von Dateien
kr: Renommage de fichier

source: Files that are exported by a flatpak must be prefixed using the application ID. If an application's source files are not named using this convention, flatpak-builder allows them to be renamed as part of the build process. To rename application icons, desktop files and AppData files, use the ``rename-icon``, ``rename-desktop-file`` and ``rename-appdata`` properties.
de: Dateien, die nach Flatpak exportiert werden, muss die Applikations-ID vorangestellt werden. Wenn die Quelldateien einer Applikation nicht benannt sind nach dieser Konvention, erlaubt es Flatpak Builder, diese als Teil des Erstellungsprozesses umzubenennen. Um Applikationssymbole, Desktopdateien und AppData-Dateien umzubenennen, verwendet man die ``rename-icon``-, ``rename-desktop-file``- und ``rename-appdata``-Eigenschaften.
kr: Les fichiers exportés par Flatpak doivent être préfixés avec l'identifiant d'application. Si les fichiers sources d'une application ne sont pas nommés suivant cette convention, flatpak-builder permet de les renommer durant le processus de construction. Pour renommer les fichiers icônes, desktop et AppData, utilisez les propriétés ``rename-icon``, ``rename-desktop-file`` et ``rename-appdata``.

source: Splitting things up
de: Aufsplitten
kr: Séparer les choses

source: By default, flatpak-builder splits off translations and debug information into separate .Locale and .Debug extensions. These 'standard' extension points are then added to the application's metadata file. You can turn this off with the ``separate-locales`` and ``no-debuginfo`` keys, but there shouldn't be any reason for it.
de: In den Standardeinstellungen splittet Flatpak Builder Übersetzungen und Debug-Informationen in separate `.Locale`- und `.Debug`-Erweiterungen. Diese „Standard"-Erweiterungspunkte werden dann zur Metadatendatei der Applikation hinzugefügt. Dies kann abgeschaltet werden mittels der ``separate-locales``- und ``no-debuginfo``-Schlüssel. Regulär sollte hierzu jedoch kein Grund bestehen.
kr: Par défaut, flatpak-builder séparer les traductions et les informations de débogage dans des extensions .Locale et .Debug. Ces extensions "standards" sont ensuite ajoutées dans le fichier de meta-données de l'application. Cela peut être désactivé avec les clés ``separate-locales`` et ``no-debuginfo``, mais il ne devrait pas y avoir de raisons valables pour le faire.

source: When flatpak-builder exports the build into a repository, it automatically includes the .Locale and .Debug extensions. If you do the exporting manually, don't forget to include them.
de: Wenn Flatpak Builder den Build in ein Repository exportiert, fügt es automatisch die `.Locale`- und `.Debug`-Extensions hinzu. Wenn der Export manuell vorgenommen wird, darf nicht vergessen werden, diese beizufügen.
kr: Quand flatpak-builder exporte le résultat de la construction dans un dépôt, il inclus automatiquement les extensions .Locale et .Debug. Dans le cas d'un export manuel, n'oubliez pas de les inclure.

source: Example
de: Beispiel
kr: Exemple

source: To try flatpak-builder yourself, create a file called ``org.gnome.Dictionary.json`` and paste the Dictionary manifest JSON from above into it. Then run the following command::
de: Um Flatpak Builder auszuprobieren, kann eine Datei mit dem Namen ``org.gnome.Dictionary.json`` erstellt und das JSON-Dictionary-Manifest von oben hineinkopiert werden. Dann wird das folgende Kommando gestartet::
kr: Pour essayer flatpak-builder vous-même, créez un fichier nommé ``org.gnome.Dictionary.json`` et copiez le manifeste JSON de l'application dictionnaire ci-dessus dedans. Puis lancez la commande suivante::

source: This will:
de: Dies wird:
kr: Cela va:

source: Create a new directory called dictionary2 (equivalent to using `flatpak build-init`)
de: Ein neues Verzeichnis erzeugen namens `dictionary2` (equivalent zum Verwenden von ``flatpak build-init``).
kr: Créer un nouveau répertoire nommé dictionary2 (équivalent à `flatpak build-init`)

source: Download and verify the Dictionary source code
de: Den Quellcode des GNOME Dictionary herunterladen und verifizieren.
kr: Télécharger et vérifier le code source de GNOME Dictionnaire

source: Build and install the source code, using the SDK rather than the host system
de: Den Quellcode kompilieren und installieren unter Verwendung des SDK, anstelle des Host-Systems.
kr: Construire et installer le code source à l'aide du SDK plutôt que de l'ĥôte système

source: Finish the build, by setting permissions (in this case giving access to X and the network)
de: Den Build beenden mit dem Setzen von Berechtigungen (in diesem Fall wird Zugriff auf X und das Netzwerk gewährt).
kr: Finir la construction en définissant les permissions (dans ce cas donnez accès au serveur X et au réseau)

source: Create a new repository called repo (if it doesn't exist) and export the resulting build into it
de: Ein neues Repository erzeugen names `repo` (wenn es nicht bereits existiert) und den erstellten Build in dieses hinein exportieren.
kr: Créer un nouveau dépôt nommé repo (si il n'existe pas déjà) et exporter le résultat de la construction dedans

source: flatpak-builder will also do some other useful things, like creating a separately installable debug runtime (called `org.gnome.Dictionary.Debug` in this case) and a separately installable translation runtime (called ``org.gnome.Dictionary.Locale``).
de: Flatpak Builder wird auch einige andere nützliche Dinge tun, wie eine separate installierbare Debug-Runtime erzeugen (in diesem Fall genannt ``org.gnome.Dictionary.Debug``) und eine separat installierbare Übersetzungs-Runtime (in diesem Fall genannt ``org.gnome.Dictionary.Locale``).
kr: flatpak-builder fera aussi d'autres choses utiles, tel que créer un runtime de débogage séparé (appelé ``org.gnome.Dictionary.Debug`` dans ce cas) and un runtime de traduction séparé (appelé ``org.gnome.Dictionary.Locale``)

source: If you completed the tutorial in `Building Simple Apps <building-simple-apps.html>`_, you can update the Dictionary application you installed with the new version that was built and exported by flatpak-builder::
de: Wenn das Tutorial in `Erstellen einfacher Apps <building-simple-apps.html>`_ vervollständigt wurde, kann die installierte Dictionary-App mit der neuen Version, die von Flatpak Builder erzeugt und exportiert wurde, aktualisiert werden::
kr: Si vous terminez le tutoriel dans `Construction d'applications simples <building-simple-apps.html>`_, vous pouvez mettre à jour l'application Dictionnaire installée avec la nouvelle version qui a été construite et exportée par flatpak-builder::

source: To check that the application has been successfully updated, you can compare the sha256 commit of the installed app with the commit ID that was printed by flatpak-builder::
de: Um zu überprüfen, ob die Anwendung erfolgreich aktualisiert wurde, kann man den sha256-Commit der installierten App mit der Commit-ID vergleichen, die mittels Flatpak Builder geschrieben wurde::
kr: Pour vérifier que l'application a été mise à jour avec succès, vous pouvez comparer les commits sha256 de l'application installée avec celui affiché par flatpak-builder::

source: And finally, you can run the new version of the Dictionary app::
de: Und abschließend kann man die neue Version der Dictionary-App ausführen::
kr: Et finalement vous pouvez lancer la nouvelle version de l'application Dictionnaire::

source: Example manifests
de: Beispielmanifeste
kr: Exemples de manifestes

source: A `complete manifest for GNOME Dictionary built from Git <https://git.gnome.org/browse/gnome-dictionary/tree/data/org.gnome.Dictionary.json>`_ is available, in addition to `manifests for a range of other GNOME applications <https://git.gnome.org/browse/gnome-apps-nightly/tree/>`_.
de: Ein `vollständiges Manifest für das von Git generierte GNOME Dictionary <https://git.gnome.org/browse/gnome-dictionary/tree/data/org.gnome.Dictionary.json>`_ steht zur Verfügung, zusätzlich zu `Manifesten für eine Bandbreite anderer GNOME-Anwendungen <https://git.gnome.org/browse/gnome-apps-nightly/tree/>`_.
kr: Un manifeste complet pour GNOME Dictionnaire construit à partir de Git <https://git.gnome.org/browse/gnome-dictionary/tree/data/org.gnome.Dictionary.json>`_ est disponible, en plus de `manisfestes d'autres applications GNOME <https://git.gnome.org/browse/gnome-apps-nightly/tree/>`_.

source: ``flatpak-builder`` has already been introduced in :doc:`first-build` and :doc:`building-introduction`. This page provides additional detail on how to use ``flatpak-builder``, including the various command options that are available.
ru: ``flatpak-builder`` уже был представлен в :doc:`first-build` и :doc:`building-Introduction`. На этой странице представлены дополнительные сведения о том, как использовать ``flatpak-builder``, включая различные доступные параметры команд.

source: Exporting
ko: 내보내기(exporting)
pt_br: Exportando
ru: Экспорт
zh_cn: 导出

source: ``flatpak-builder`` provides two options for exporting an application in order to run it. The first is to export to a repository, from which the application can be run. The second is to automatically install locally.
pt_br: ``flatpak-builder`` fornece duas opções para exportar um aplicativo para executá-lo. O primeiro é exportar para um repositório, a partir do qual o aplicativo pode ser executado. O segundo é instalar automaticamente localmente.
ru: ``Flatpak-builder`` предоставляет два варианта экспорта приложения для его запуска. Первый - это экспорт в репозиторий, из которого можно запустить приложение. Второй - локальная автоматическая установка.
zh_cn: ``flatpak-builder`` 为导出应用提供了两个选项。一个是导出仓库，然后从仓库运行。另一个是自动在本地安装。

source: Exporting to a repository
ko: 저장소로 내보내기
pt_br: Exportando para um repositório
ru: Экспорт в репозиторий
zh_cn: 导出到仓库

source: The ``--repo`` option allows a repository to be specified, for the application to be exported to. This takes the format::
pt_br: A opção ``--repo`` permite que um repositório seja especificado para o aplicativo ser exportado. Isso assume o formato::
ru: Параметр ``--repo`` позволяет указать репозиторий для экспорта приложения. Это принимает формат::
zh_cn: ``--repo`` 选项指定应用导出的仓库。格式为：

source: Here, ``<repo>`` is a path to a repository. If no repository exists at the specified location, the repository will be created. If the application is already in the specified repository, ``flatpak-builder`` will add the build as a new version of the existing application.
pt_br: Aqui, ``<repo>`` é um caminho para um repositório. Se nenhum repositório existir no local especificado, o repositório será criado. Se o aplicativo já estiver no repositório especificado, o ``flatpak-builder`` adicionará a compilação como uma nova versão do aplicativo existente.
ru: Здесь ``<repo>`` - это путь к репозиторию. Если в указанном месте нет репозитория, он будет создан. Если приложение уже находится в указанном репозитории, ``flatpak-builder`` добавит сборку как новую версию существующего приложения.
zh_cn: ``<repo>`` 是仓库路径。如果仓库不存在，将创建一个新的仓库。如果应用在指定的仓库中已经存在， ``flatpak-builder`` 将会把当前构建作为已存在应用的一个新的版本。

source: You can put more than one application in the same repository by using the same ``--repo`` path for multiple invocations of ``flatpak-builder``.
pt_br: Você pode colocar mais de um aplicativo no mesmo repositório usando o mesmo caminho ``--repo`` para várias invocações do ``flatpak-builder``.
ru: Вы можете разместить более одного приложения в одном репозитории, используя один и тот же путь ``--repo`` для многократных вызовов ``flatpak-builder``.

source: By default, ``flatpak-builder`` splits off translations and debug information into separate `.Locale` and `.Debug` extensions. These extensions are automatically exported into a repository along with the application.
pt_br: Por padrão, o ``flatpak-builder`` divide as traduções e as informações de depuração em extensões `.Locale` e `.Debug`. Essas extensões são exportadas automaticamente para um repositório junto com o aplicativo.
ru: По умолчанию ``flatpak-builder`` разделяет переводы и отладочную информацию на отдельные расширения `.Locale` и `.Debug`. Эти расширения автоматически экспортируются в репозиторий вместе с приложением.
zh_cn: 默认情况下， ``flatpak-builder`` 把翻译和调试信息分隔到 `.Locale` 和 `.Debug` 扩展中。

source: Installing builds directly
ko: 빌드 결과물의 직접 설치
pt_br: Instalando compilações diretamente
ru: Установка сборок напрямую
zh_cn: 直接安装当前构建

source: Instead of exporting to a repository, the Flatpak that is produced by ``flatpak-builder`` can be automatically installed locally, using the ``--install`` option::
pt_br: Em vez de exportar para um repositório, o Flatpak produzido por ``flatpak-builder`` pode ser instalado automaticamente localmente, usando a opção ``--install``::
ru: Вместо экспорта в репозиторий Flatpak, созданный с помощью ``flatpak-builder``, можно автоматически установить локально с помощью параметра ``--install``::
zh_cn: 使用 ``--install`` 选项，由 ``flatpak-builder`` 产生的Flatpak应用将自动安装到本地，而不是导出到仓库中。

source: This approach has the advantage of skipping the separate install step that is needed when exporting to a repository.
pt_br: Essa abordagem tem a vantagem de ignorar a etapa separada de instalação necessária para exportar para um repositório.
ru: Преимущество этого подхода в том, что он пропускает отдельный этап установки, необходимый при экспорте в репозиторий.
zh_cn: 这个方式的优点是跳过了导出到仓库中必需的安装步骤。

source: Signing
ko: 서명
pt_br: Assinando
ru: Подписывание
zh_cn: 签名

source: Every commit to a Flatpak repository should be signed with a GPG signature. If ``flatpak-builder`` is being used to modify or create a repository, a GPG key should therefore be passed to it. This can be done with the ``--gpg-sign`` option, such as::
ko: 플랫팩 저장소로 커밋(commit)한 내역들은 GPG 서명되어야 한다. 저장소를 생성 및 변경 하는 데에 플랫팩 빌더를 사용할 경우, 서명을 위해 매개변수로 GPG 키를 넘겨준다. 이 때, 다음과 같이 ``—gpg-sign`` 옵션을 사용한다::
pt_br: Cada commit em um repositório Flatpak deve ser assinado com uma assinatura GPG. Se o ``flatpak-builder`` estiver sendo usado para modificar ou criar um repositório, uma chave GPG deve ser passada para ele. Isso pode ser feito com a opção ``--gpg-sign``, como::
ru: Каждый коммит в репозиторий Flatpak должен быть подписан подписью GPG. Если для изменения или создания репозитория используется ``flatpak-builder``, ему следует передать ключ GPG. Это можно сделать с помощью параметра ``--gpg-sign``, например::
zh_cn: 往Flatpak仓库中的每一次提交都需要使用GPG签名。如果用 ``flatpak-builder`` 修改或创建仓库，需要传一个GPG秘钥作为参数。使用方式是用 ``--gpg-sign`` 选项，如：

source: Here, ``<key>`` is the ID of the GPG key that is to be used. The ``--gpg-homedir`` option can also be used to specify the home directory of the key that is being used.
pt_br: Aqui, ``<key>`` é o ID da chave GPG que deve ser usada. A opção ``--gpg-homedir`` também pode ser usada para especificar o diretório inicial da chave que está sendo usada.
ru: Здесь <key> - это идентификатор ключа GPG, который будет использоваться. Параметр ``--gpg-homedir`` также можно использовать для указания домашнего каталога используемого ключа.
zh_cn: ``<key>`` 是使用的GPG秘钥的ID。也可以使用 ``--gpg-homedir`` 指定使用的秘钥的家目录。

source: Though it generally isn't recommended, it is possible not to use GPG verification. In this case, the ``--no-gpg-verify`` option should be used when adding the repository. Note that it is necessary to become root in order to update a repository that does not have GPG verification enabled.
ko: 일반적으로 추천하는 사항은 아니지만, 저장소를 추가할 때 ``—no-gpg-verify`` 옵션을 사용하면 GPG 검증을 건너뛰는 것도 가능하다. 단, GPG 검증을 활성화 하지 않은 저장소를 업데이트할 때에는 관리자 계정(root)을 필요로 하게 된다는 점을 유의하자.
pt_br: Embora geralmente não seja recomendado, é possível não usar a verificação GPG. Nesse caso, a opção ``--no-gpg-confirm`` deve ser usada ao adicionar o repositório. Observe que é necessário tornar-se root para atualizar um repositório que não possui a verificação GPG ativada.
ru: Хотя обычно это не рекомендуется, можно не использовать проверку GPG. В этом случае при добавлении репозитория следует использовать параметр ``--no-gpg-verify``. Обратите внимание, что необходимо стать пользователем root, чтобы обновить репозиторий, в котором не включена проверка GPG.
zh_cn: 尽管不推荐，但不使用GPG验证也是可以的。这种情况下，当添加仓库时，使用 ``--no-gpg-verify`` 选项。注意，为了更新没有启用GPG验证的仓库，有必要切换到root用户。

source: Flatpak Builder
ko: 플랫팩 빌더(Flatpak Builder)

source: Flatpaks are built using the ``flatpak-builder`` tool. This allows a series of modules to be built into a single application bundle. These modules can include libraries and dependencies in addition to the application itself.
ko: 플랫팩은 플랫팩 빌더를 이용하여 빌드한다. 여러 모듈들을 하나의 응용프로그램 번들로 빌드할 수도 있는데, 이러한 모듈들은 응용프로그램 자신과, 참조하는 라이브러리들 및 그 외 의존자원들(dependencies)을 포함한다.

source: Modules can be built with a variety of build systems, including `autotools <https://www.gnu.org/software/automake/manual/html_node/Autotools-Introduction.html>`_, `cmake <https://cmake.org/>`_, `cmake-ninja <https://cmake.org/cmake/help/v3.0/generator/Ninja.html>`_, `meson <http://mesonbuild.com/>`_, and the so called `Build API <https://github.com/cgwalters/build-api/>`_. A "simple" build method is also available, which allows a series of commands to be specified.
ko: 모듈들은 `autotools <https://www.gnu.org/software/automake/manual/html_node/Autotools-Introduction.html>`_, `cmake <https://cmake.org/>`_, `cmake-ninja <https://cmake.org/cmake/help/v3.0/generator/Ninja.html>`_, `meson <http://mesonbuild.com/>`_, `Build API <https://github.com/cgwalters/build-api/>`_ 등 다양한 빌드시스템을 이용하여 빌드할 수 있다. 또한 빌드를 위해 실행할 일련의 명령을 지정할 수 있는 “simple” 빌드 방식도 지원한다.
