Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/flatpak-builder.po
Languages: de, ko, kr, pt_br, ru, zh_cn

source: The result of the build process can be exported to a repository or automatically installed locally.
ko: 빌드 결과물은 로컬 시스템에 자동으로 설치되거나 저장소로 내보낼 수 있다.

source: The ``--repo`` option allows a repository to be specified, which the resulting application will be added to. This takes the format::
ko: ``—repo`` 옵션은 결과물 응용프로그램이 지정된 저장소에 추가될 수 있도록 한다. 다음과 같은 형식을 따른다::

source: By default, flatpak-builder splits off translations and debug information into separate `.Locale` and `.Debug` extensions. These extensions are automatically exported into a repository along with the application.
ko: 플랫팩 빌더는 기본적으로 다국어 번역 정보와 디버그 정보를 별도의 확장자 `.Locale` 과 `.Debug`를 붙여 관리한다. 이러한 확장자는 응용프로그램을 저장소로 내보낼 때 자동으로 부여된다.

source: Instead of exporting to a repository, the application bundle that is produced by ``flatpak-builder`` can be automatically installed locally::
ko: 플랫팩 빌더로 빌드한 응용프로그램 번들을 저장소로 내보내는 대신 자동으로 로컬 시스템에 설치할 수도 있다::

source: The ``--gpg-homedir`` option can also be used to specify the home directory of the key that is being used.
ko: 서명 키의 홈디렉토리 지정을 위해 ``—gpg-hümedir`` 옵션을 사용할 수도 있다.
