Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/flatpak-builder-tutorial.po
Languages: ko, ru, zh_cn

source: Tutorial
ko: 튜토리얼
ru: Руководство
zh_cn: 教程

source: This tutorial provides a sample set of step that you can use to try ``flatpak-builder`` yourself. In it, you will learn how to use ``flatpak-builder`` to build the GNOME Dictionary applicaiton.
ko: 이 튜토리얼은 플랫팩 빌더 (``flatpak-builder``)를 사용해보고 사용법을 익힐 수 있도록 예제를 제공한다. 플랫팩 빌더를 사용하여 GNOME 사전 (Dictionary) 응용 프로그램을 빌드 해 보자.
ru: В этом руководстве представлен примерный набор шагов, который вы можете использовать, чтобы самостоятельно попробовать ``flatpak-builder``. В нем вы узнаете, как использовать ``flatpak-builder`` для создания приложения GNOME Dictionary.
zh_cn: 本教程提供了一系列教程，你可以用来尝试 `` flatpak-builder `` 。从中你可以学习如何使用 `` flatpak-builder `` 来构建GNOME Dictionary。

source: 1. Create a manifest
ko: 1. Manifest 파일 생성
ru: 1. Создайте манифест
zh_cn: 1. 创建一个清单文件（manifest）

source: To create a manifest for the application, create a file called ``org.gnome.Dictionary.json`` and paste the Dictionary manifest JSON from :doc:`manifests` into it.
ko: 응용프로그램을 위한 manifest 파일을 생성하기 위해, ``org.gnome.Dictionary.json`` 파일을 생성하고, :doc:`manifests` 의 내용을 참조하여, JSON 형식에 따라 작성된 사전 응용프로그램의 manifest 파일 내용을 붙여넣기 한다.
ru: Чтобы создать манифест для приложения, создайте файл с именем ``org.gnome.Dictionary.json`` и вставьте в него манифест словаря JSON из :doc:`manifestests`.
zh_cn: 为应用创建一个清单文件，新建一个名为 `` org.gnome.Dictionary.json `` 然后从 :doc:`manifests`粘贴Dictionary清单文件。

source: 2. Run the build
ko: 2. 빌드 실행
ru: 2. Запускаем сборку
zh_cn: 2. 进行构建

source: To use the manifest to build the Dictionary application, run the following command::
ko: 생성한 manifest 파일을 사용하여 사전 응용프로그램을 빌드하려면 다음과 같이 실행한다::
ru: Чтобы использовать манифест для создания приложения Dictionary, выполните следующую команду::
zh_cn: 使用清单文件构建Dictionary应用，运行如下命令::

source: This will:
ko: 그 결과 다음과 같은 작업들이 진행된다:
ru: В дальнейшем:
zh_cn: 这将：

source: Create a new directory called dictionary
ko: ``dictionary``라는 새 디렉토리 생성
ru: Создайте новый каталог под названием Dictionary
zh_cn: 创建一个叫dictionary的新目录

source: Download and verify the Dictionary source code
ko: 사전 응용프로그램의 소스 파일을 내려받고 검증
ru: Скачайте и проверить исходный код словаря
zh_cn: 下载和检验Dictionary源代码

source: Build and install the source code, using the SDK rather than the host system
ko: 호스트 시스템이 아닌 SDK를 사용하여 소스코드를 빌드하고 설치
ru: Соберите и установите исходный код, используя SDK, а не хост-систему
zh_cn: 使用SDK构建和安装源代码，而不是主机系统。

source: Finish the build, by setting permissions (in this case giving access to X11 and the network)
ko: 권한을 설정(이 경우에는 X11 및 네트워크에 대한 접근을 허용)하고 빌드를 마친다.
ru: Завершите сборку, установив разрешения (в данном случае предоставив доступ к X11 и сети)
zh_cn: 通过设置权限（此处授予X11和network权限）完成构建。

source: Create a new repository called repo (if it doesn't exist) and export the resulting build into it
ko: (기존에 생성한 적이 없다면) repo라는 이름으로 새 저장소를 생성하고, 빌드한 결과물을 새 저장소로 내보내기(export)
ru: Создайте новый репозиторий с именем repo (если он не существует) и экспортируйте в него полученную сборку
zh_cn: 创建一个称为repo的新仓库（如果不存在的话）然后将构建结果导入其中。

source: ``flatpak-builder`` will also do some other useful things, like creating a separately installable debug runtime (called ``org.gnome.Dictionary.Debug`` in this case) and a separately installable translation runtime (called ``org.gnome.Dictionary.Locale``).
ko: 또한 플랫팩 빌더는 몇 가지 유용한 작업을 한다. 이를 테면, 별도로 설치 가능한 디버그 런타임(이 경우에는 ``org.gnome.Dictionary.Debug``)과 역시 별도로 설치가능한 다국어 런타임 (``org.gnome.Dictionary.Locale``)을 생성하는 것이 이에 해당한다.
ru: ``flatpak-builder`` также выполняет некоторые другие полезные функции, например, создает отдельно устанавливаемую среду выполнения отладки (в данном случае называемую ``org.gnome.Dictionary.Debug``) и отдельно устанавливаемую среду выполнения перевода (именуемую ``org.gnome.Dictionary.Locale``).

source: 3. Add the new repository
ko: 3. 새로운 저장소 추가
ru: 3. Добавьте новый репозиторий
zh_cn: 3. 添加新的仓库

source: To test the application that has been built, you need to add the new repository that has been created::
ko: 빌드된 응용프로그램을 시험하기 위해, 새롭게 생성된 저장소를 추가해야 한다::
ru: Чтобы протестировать созданное приложение, вам необходимо добавить новый созданный репозиторий::

source: 4. Install the application
ko: 4. 응용프로그램 설치
ru: 4. Установите приложение
zh_cn: 4. 安装应用

source: The next step is to install the Dictionary application from the repository. To do this, run::
ko: 다음 작업은 저장소로부터 사전 응용프로그램을 가져와 설치하는 것이다. 다음과 같이 실행한다::
ru: Следующим шагом будет установка приложения Dictionary из репозитория. Для этого запустите::
zh_cn: 下一步是从仓库安装Dictionary应用。通过运行::

source: To check that the application has been successfully installed, you can compare the sha256 commit of the installed app with the commit ID that was printed by ``flatpak-builder``::
ko: 응용프로그램이 성공적으로 설치되었는지 확인하기 위해 설치한 응용프로그램의 sha256 값과 플랫팩 빌더가 출력하는 값을 비교해볼 수 있다::
ru: Чтобы убедиться, что приложение было успешно установлено, вы можете сравнить фиксацию sha256 установленного приложения с идентификатором фиксации, который был создан с помощью ``flatpak-builder``::

source: 5. Run the application
ko: 5. 응용프로그램 실행
ru: 5. Запустите приложение
zh_cn: 5. 运行应用

source: Finally, you can run the application that you've built::
ko: 마지막으로, 빌드한 응용프로그램을 실행한다::
ru: Наконец, вы можете запустить созданное вами приложение::
zh_cn: 最后，你可以运行你构建好的应用。
