Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/freedesktop-quick-reference.po
Languages: pt_br, ru

source: Freedesktop quick reference
pt_br: Referência rápida do freedesktop
ru: Краткий справочник Freedesktop

source: In order to ensure interoperability, flatpak adheres strictly to a number of freedesktop standards and practices. This page describes the basic conventions that should be followed when building a flatpak app.
pt_br: Para garantir a interoperabilidade, o flatpak segue rigorosamente uma série de padrões e práticas do freedesktop. Esta página descreve as convenções básicas que devem ser seguidas ao compilar um aplicativo flatpak.
ru: Чтобы обеспечить совместимость, Flatpak строго придерживается ряда стандартов и практик freedesktop. На этой странице описаны основные соглашения, которых следует придерживаться при создании плоского приложения.

source: Icons
pt_br: Ícones
ru: Иконки

source: Application icons can be in either png or svg format, must use the application's appid as a prefix and be placed in ``/app/share/icons/hicolor/$size/apps/``
pt_br: Os ícones de aplicativos podem estar no formato png ou svg, devem usar o appid do aplicativo como prefixo e devem ser colocados em ``/app/share/icons/hicolor/$size/apps/``
ru: Значки приложений могут быть в формате png или svg, должны использовать appid в качестве префикса и располагаться в ``/app/share/icons/hicolor/$size/apps/``

source: Example:
pt_br: Exemplo:
ru: Пример:

source: If interested, you can read the full spec `here <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`__
pt_br: Se estiver interessado, você pode ler a especificação completa `aqui <https://standards.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`__

source: Desktop files
pt_br: Arquivos desktop
ru: Файлы рабочего стола

source: Desktop files are used by desktop environments in order to identify and display available applications to the user, they contain information about how to launch the application, its icon and categories among others.
pt_br: Os arquivos desktop são usados pelos ambientes de desktop para identificar e exibir aplicativos disponíveis para o usuário, eles contêm informações sobre como iniciar o aplicativo, seu ícone e categorias, entre outros.
ru: Файлы рабочего стола используются средами рабочего стола для идентификации и отображения доступных приложений пользователю, они содержат информацию о том, как запустить приложение, его значок и категории среди прочего.

source: A minimal desktop file needs at least the application's *Name*, *Exec* command, *Type* and *Icon*:
pt_br: Um arquivo desktop mínimo precisa pelo menos do comando *Name *, *Exec* do aplicativo, *Type* e * Icon*:
ru: Минимальный файл рабочего стола требует как минимум *Name*, *Exec* команды приложения, *Type* and *Icon*:

source: Your desktop file should be prefixed with your application's appid and placed in ``/app/share/applications/`` within your app.
pt_br: Seu arquivo desktop deve ser prefixado com o appid do seu aplicativo e colocado em ``/app/share/applications/`` dentro do seu aplicativo.
ru: Ваш файл на рабочем столе должен иметь префикс appid вашего приложения и быть помещенным в ``/app/share/applications/`` внутри вашего приложения.

source: It's recommended to use ``desktop-file-validate`` to check your file for errors before including it.
pt_br: É recomendado usar ``desktop-file-validate`` para verificar se há erros em seu arquivo antes de incluí-lo.
ru: Рекомендуется использовать ``desktop-file-validate`` для проверки вашего файла на наличие ошибок перед его включением.

source: A special note about the ``Exec`` line: When installing an app, Flatpak will automatically rewrite the included ``.desktop`` file so that the app will be started through Flatpak. The rewritten desktop file is then exported to a path such as ``exports/share/applications/org.gnome.Dictionary.desktop`` under your Flatpak installation directory (usually ``/var/lib/flatpak/`` or ``~/.local/share/flatpak/``). In the case of ``org.gnome.Dictionary.desktop``, the rewritten ``Exec`` line looks like this::
pt_br: Uma nota especial sobre a linha ``Exec``: Ao instalar um aplicativo, o Flatpak irá reescrever automaticamente o arquivo ``.desktop`` incluído para que o aplicativo seja iniciado através do Flatpak. O arquivo desktop reescrito é então exportado para um caminho como ``exports/share/applications/org.gnome.Dictionary.desktop`` no diretório de instalação do Flatpak (geralmente ``/var/lib/flatpak/`` ou ``~/.local/share/flatpak/``). No caso de ``org.gnome.Dictionary.desktop``, a linha ``Exec`` reescrita fica assim::
ru: Особое примечание о строке «Exec»: при установке приложения Flatpak автоматически перезаписывает прилагаемый файл ``.desktop``, чтобы приложение запускалось через Flatpak. Затем переписанный файл рабочего стола экспортируется по пути, например, ``exports/share/applications/org.gnome.Dictionary.desktop`` в каталоге установки Flatpak (обычно ``/var/lib/flatpak/`` или `` ~/.local/share/flatpak/``). В случае с org.gnome.Dictionary.desktop переписанная строка Exec выглядит так::

source: The command from the original desktop file will be part of the ``--command`` argument to Flatpak and arguments will be passed through. This means that in most cases, it should match the value of the ``command:`` line in your app's manifest.
pt_br: O comando do arquivo desktop original fará parte do argumento ``--command`` para o Flatpak e os argumentos serão passados. Isso significa que, na maioria dos casos, deve corresponder ao valor da linha ``command:`` no manifesto do seu aplicativo.
ru: Команда из исходного десктопного файла будет частью аргумента ``--command`` для Flatpak, и аргументы будут переданы. Это означает, что в большинстве случаев оно должно совпадать со значением строки ``command:`` в манифесте вашего приложения.

source: If you want the ``--command`` argument to be omitted from the ``flatpak run`` command in the generated desktop file, you can leave the ``Exec`` value in the source desktop file empty::
pt_br: Se você quiser que o argumento ``--command`` seja omitido do comando ``flatpak run`` no arquivo desktop gerado, você pode deixar o valor ``Exec`` no arquivo desktop fonte vazio::
ru: Если вы хотите, чтобы аргумент ``--command`` не использовался в команде ``flatpak run`` в сгенерированном файле рабочего стола, вы можете оставить значение ``Exec`` в исходном десктопном файле пустым::

source: This way, the generated ``Exec`` line looks like this::
pt_br: Desta forma, a linha ``Exec`` gerada fica assim::
ru: Таким образом, сгенерированная строка ``Exec`` выглядит так::

source: With Flatpak ≤ 1.12.7, a warning may be shown when exporting a build with an empty Exec= line to a repository::
pt_br: Com Flatpak ≤ 1.12.7, um aviso pode ser exibido ao exportar uma compilação com uma linha Exec= vazia para um repositório::
ru: С версии Flatpak ≤ 1.12.7 может появиться предупреждение при экспорте сборки с пустой строкой Exec= в репозиторий::

source: This warning can be ignored.
pt_br: Este aviso pode ser ignorado.
ru: Это предупреждение можно игнорировать.

source: You can find more general information about desktop files `here <https://wiki.archlinux.org/index.php/desktop_entries>`__. If interested, you can read also the full spec `here <https://standards.freedesktop.org/desktop-entry-spec/latest/>`__.
pt_br: Você pode encontrar mais informações gerais sobre arquivos desktop `aqui <https://wiki.archlinux.org/index.php/entradas_de_desktop>`__. Se estiver interessado, você também pode ler a especificação completa `aqui <https://standards.freedesktop.org/desktop-entry-spec/latest/>`__.

source: Appdata files
pt_br: Arquivos de Appdata
ru: Файлы Appdata

source: Appdata files are used by application stores (e.g. KDE Discover, GNOME Software) in order to display metadata about your application, such as a description, screenshots, changelogs when updates are available, and other miscellaneous things.
pt_br: Os arquivos Appdata são usados pelas lojas de aplicativos (por exemplo, KDE Discover e GNOME Programas) para exibir metadados sobre o seu aplicativo, como descrição, capturas de tela, logs de alterações quando atualizações estiverem disponíveis, e outras coisas.
ru: Файлы Appdata используются магазинами приложений (например, KDE Discover, GNOME Software) для отображения метаданных о вашем приложении, таких как описание, снимки экрана, журналы изменений, когда доступны обновления, и другие разные вещи.

source: Your Appdata file should be prefixed with your application's appid and placed in ``/app/share/metainfo/``. You should also use ``appstream-util validate-relax`` to check your file for errors before including it.
pt_br: Seu arquivo Appdata deve ser prefixado com o appid do seu aplicativo e colocado em ``/app/share/metainfo/``, você também deve usar ``appstream-util validate-relax`` para verificar se há erros no arquivo antes de incluí-lo.
ru: Ваш файл Appdata должен иметь префикс appid вашего приложения и быть помещенным в ``/app/share/metainfo/``. Вы также должны использовать ``appstream-util validate-relax`` для проверки файла на наличие ошибок, прежде чем включать его.

source: If interested, you can read the full spec `here <https://www.freedesktop.org/software/appstream/docs/>`__.
pt_br: Se tiver interesse, você pode ler a especificação completa `aqui <https://www.freedesktop.org/software/appstream/docs/>`__.
ru: Если интересно, вы можете прочитать полную спецификацию здесь <https://www.freedesktop.org/software/appstream/docs/>`__.

source: If interested, you can read the full spec `here <https://specifications.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`__
ru: Если интересно, вы можете прочитать полную спецификацию здесь <https://specifications.freedesktop.org/icon-theme-spec/icon-theme-spec-latest.html>`__

source: You can find more general information about desktop files `here <https://wiki.archlinux.org/title/desktop_entries>`__. If interested, you can read also the full spec `here <https://specifications.freedesktop.org/desktop-entry-spec/latest/>`__.
ru: Вы можете найти более общую информацию о файлах рабочего стола `здесь <https://wiki.archlinux.org/title/desktop_entries>`__. Если интересно, вы также можете прочитать полную спецификацию здесь <https://specifications.freedesktop.org/desktop-entry-spec/latest/>`__.
