Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/getting-setup.po
Languages: de, fr, ko, ru

source: Getting Setup
de: Die Einrichtung
fr: Mise en place
ko: 설정 하기
ru: Получение настроек

source: Getting setup to build Flatpaks is quick and easy. First, it is necessary to have the ``flatpak`` and ``flatpak-builder`` packages installed on your system. These are available for most distributions, and the Flatpak website provides `details on how to get them <http://flatpak.org/getting.html>`_.
de: Das Setup, um Flatpaks zu erzeugen, geht schnell und einfach von der Hand. Zuerst ist es notwendig, die ``flatpak``- und ``flatpak-builder``-Pakete auf dem System installiert zu haben. Diese sind verfügbar für die meisten Distributionen und die Flatpak-Webseite beinhaltet `Details dazu, wie man sie erhält <http://flatpak.org/getting.html>`_.
fr: La mise en place pour construire des Flatpaks est rapide et simple. Premièrement, il est nécessaire d'avoir les paquets ``flatpak`` et ``flatpak-builder`` installés sur votre système. Ils sont disponibles pour la plupart des distributions, et le site web Flatpak fournit les `détails pour les récuperer <http://flatpak.org/getting.html>`_.
ko: 플랫팩을 빌드하기 위한 준비과정은 쉽고 빠르게 완료할 수 있다. 우선 ``flatpak`` 과 ``flatpak-builder`` 패키지를 시스템에 설치한다. 대부분의 배포판에서 지원하고 있으며, 플랫팩 웹사이트의 `다운로드 및 설치방법 <http://flatpak.org/getting.html>`_ 를 참조하여 설치할 수도 있다.
ru: Настройка для создания Flatpak выполняется быстро и легко. Во-первых, в вашей системе должны быть установлены пакеты ``flatpak`` и ``flatpak-builder``. Они доступны для большинства дистрибутивов, а на веб-сайте Flatpak содержится `подробная информация о том, как их получить <http://flatpak.org/getting.html>`_.

source: Once flatpak has been installed, it is necessary to pick a runtime and install it, along with the matching SDK.
de: Sobald Flatpak installiert wurde, ist es notwendig eine Runtime zu nehmen und diese, gemeinsam mit dem korrespondierenden SDK, zu installieren.
fr: Une fois flatpak installé, il est nécessaire de choisir un runtime et de l'installer, avec le SDK correspondant.
ko: 플랫팩이 설치된 후에는 런타임을 선택한 후, 런타임 및 런타임과 짝을 이루는 SDK를 설치한다.
ru: После установки flatpak необходимо выбрать среду выполнения и установить ее вместе с соответствующим SDK.

source: Installing an SDK
de: Installieren eines SDK
fr: Installer un SDK
ko: SDK 설치
ru: Установка SDK

source: An SDK is a special type of runtime that is used to build applications. Typically, an SDK is paired with a runtime that will be used by the application at runtime. For example the GNOME 3.22 SDK is used to build applications that use the GNOME 3.22 runtime.
de: Ein SDK ist eine spezielle Form einer Laufzeitumgebung, die verwendet wird, um Applikationen zu erstellen. Normalerweise ist ein SDK mit einer Runtime gekoppelt, die von der Applikation zur Laufzeit verwendet wird. Zum Beispiel wird das GNOME 3.22 SDK verwendet um Applikationen zu bauen, die die GNOME 3.22 Runtime verwenden.
fr: Un SDK est un type spécial de runtime qui est utilisé pour contruire des applications. Typiquement, un SDK est lié avec un runtime qui sera utilisé par l'application à l'exécution Par exemple le SDK GNOME 3.22 est utilisé pour construire des applications qui utilisent le runtime GNOME 3.22.
ko: SDK는 응용프로그램을 빌드할 때 사용하는 런타임이다. 일반적으로 SDK에는 이와 짝을 이루는 (실행시간에 응용프로그램이 사용하는) 런타임이 있다. 예를 들면, GNOME 3.22 SDK 는 GNOME 3.22 런타임을 사용해 실행되는 응용프로그램을 빌드할 때 사용된다.
ru: SDK — это особый тип среды выполнения, который используется для создания приложений. Как правило, SDK связан со средой выполнения, которая будет использоваться приложением во время выполнения. Например, GNOME 3.22 SDK используется для создания приложений, использующих среду выполнения GNOME 3.22.

source: The Flatpak website provides a `list of the available runtimes <http://flatpak.org/runtimes.html>`_. Once you have decided which one to use, getting setup is just a matter of installing it and its SDK.
de: Die Flatpak-Website beinhaltet eine Liste der verfügbaren `Runtimes <http://flatpak.org/runtimes.html>`_. Sobald man sich entschieden hat, welche verwendet werden soll, ist die Einrichtung lediglich eine Frage der Installation derselbigen und des zugehörigen SDK.
fr: Le site web de Flatpak fournit une `liste des runtimes disponibles <http://flatpak.org/runtimes.html>`_. Une fois décidé celui que vous allez utiliser, être en place est juste une question de l'installer et son SDK.
ko: 플랫팩 웹사이트는 `설치 가능한 런타임 목록 <http://flatpak.org/runtimes.html>`_ 을 제공한다. 어떤 런타임을 사용할 지 결정하기만 하면 SDK와 함께 설치하는 것은 아주 간단하다.
ru: Веб-сайт Flatpak предоставляет `список доступных сред выполнения <http://flatpak.org/runtimes.html>`_. После того, как вы решили, какой из них использовать, установка — это просто установка среды выполнения и её SDK.

source: The examples in the rest of the Flatpak documentation use the GNOME 3.22 runtime and SDK. If you haven't installed these already, download the repository GPG key and then add the repository that contains the runtime and SDK::
de: Die Beispiele in der restlichen Flatpak-Dokumentation verwenden die GNOME 3.22 Runtime und das zugehörige SDK. Wenn diese noch nicht installiert sind, muss der GPG-Schlüssel des Repositorys heruntergeladen und das Repository hinzugefügt werden, das die Runtime und das SDK beinhaltet::
fr: Les exemples dans la suite de la documentation Flatpak utilise le runtime et le SDK GNOME 3.22. Si vous ne les avez pas déjà installé, téléchargez la clé GPG du dépôt, ensuite ajoutez le dépôt qui contient le runtime et le SDK::
ko: 이후의 예제들은 GNOME 3.22 런타임과 SDK를 사용한다. 아직 설치전일 경우, GPG 키를 다운로드하고 해당 런타임과 SDK를 내려받을 수 있는 저장소를 목록에 추가할 수 있다::
ru: Примеры в остальной части документации Flatpak используют среду выполнения GNOME 3.22 и SDK. Если вы еще не установили их, загрузите GPG-ключ репозитория, а затем добавьте репозиторий, содержащий среду выполнения и SDK::

source: You can now download and install the runtime and SDK::
de: Nun kann die Runtime und das SDK heruntergeladen und installiert werden::
fr: Vous pouvez maintenant télécharger et installer un runtime et un SDK::
ko: 원격 저장소 추가가 끝나면 런타임과 SDK를 내려받아 설치한다::
ru: Теперь вы можете загрузить и установить среду выполнения и SDK::

source: This same procedure can be used to install any other runtime and SDK.
de: Die gleiche Prozedur kann verwendet werden, um jede andere Runtime und zugehöriges SDK zu installieren.
fr: La même procédure peut-être utilisé pour installer n'importe quel autre runtime et SDK.
ko: 다른 런타임과 SDK를 설치할 때에도 동일한 과정을 반복한다.
ru: Эту же процедуру можно использовать для установки любой другой среды выполнения и SDK.

source: Taking a look around
de: Rundgang
fr: Jeter un coup d'œil
ko: 둘러보기
ru: Осматриваюсь вокруг

source: If this is the first time you've used Flatpak, it is a good time to try installing an application and having a look 'under the hood'. To do this, you need to add a repository that contains applications. We can do this using the gnome-apps repository to install gedit::
de: Wenn dies das erste Mal ist, dass Flatpak verwendet wird, ist es eine gute Idee, den Versuch zu unternehmen, eine Anwendung zu installieren und einen Blick "unter die Haube" zu wagen. Um dies zu tun, muss ein Repository installiert werden, das Applikationen enthält. In diesem Fall wird das ``gnome-apps``-Repository verwendet, um Gedit zu installieren::
fr: Si c'est la première fois que vous utilisez Flatpak, c'est un bon moment pour tenter d'installer une application et jetez un œil à "Sous le capot". Pour faire cela, vous aurez à ajouter un dépôt qui contient les applications. Vous pouvez faire cela à l'aide du dépôt gnome-apps pour installer gedit::
ko: 플랫팩을 처음 사용한다면, 현재 사용가능한 플랫팩 응용프로그램을 둘러보고 설치해보는 것도 좋다. 이를 위해, 우선 응용프로그램들을 내려받을 수 있는 저장소를 추가해야 한다. `gedit`을 시험삼아 설치해 보기 위해 다음과 같이 `gnome-app` 저장소를 추가한다.
ru: Если вы впервые используете Flatpak, самое время попробовать установить приложение и заглянуть «под капот». Для этого нужно добавить репозиторий, содержащий приложения. Мы можем сделать это, используя репозиторий gnome-apps для установки gedit::

source: You can now use the following command to get a shell in the 'devel sandbox'::
de: Mit dem folgenden Kommando kann nun eine Shell in der `devel-sandbox` erzeugt werden::
fr: Vous pouvez mainteant utiliser la commande suivante pour obtenir un shell dans un 'bac à sable devel'::
ko: 아래와 같이 입력하면 `devel sandbox` 내의 명령 쉘을 얻을 수 있다::
ru: Теперь вы можете использовать следующую команду, чтобы получить оболочку в 'devel sandbox'::

source: This gives you an environment which has the application bundle mounted in ``/app``, and the SDK it was built against mounted in ``/usr``. You can explore these two directories to see what a typical flatpak looks like, as well as what is included in the SDK.
de: Dies stellt dir eine Umgebung zur Verfügung, in der das Anwendungspaket unter ``/app`` eingehangen wird und das SDK, gegen das es gebaut wurde, unter ``/usr``. Man kann diese zwei Verzeichnispfade analyisieren, um zu sehen, wie ein typisches Flatpak aussieht und was innerhalb des SDK zur Vefügung steht.
fr: Cela vous donne un environnement qui a le lot d'applications monté dans ``/app``, et le SDK avec lequel il a été construit monté dans ``/usr``. Vous pouvez explorer ces deux répertoires pour voir à quoi ressemble un flatpak typique, ainsi que ce qui est inclus dans le SDK.
ko: 쉘로 접근할 수 있는 환경은, `gedit`이 실행되는 샌드박스 환경으로서, 응용프로그램 번들은 ``/app`` 에 마운트되고, SDK는 ``/usr`` 에 마운트 되어 있다. 이들 디렉토리를 방문하여 전형적인 플랫팩의 생김새를 둘러보고, SDK가 무엇을 포함하고 있는지 살펴볼 수 있다.
ru: Это дает вам среду, в которой пакет приложения смонтирован в ``/app``, а SDK, для которого он был создан, смонтирован в ``/usr``. Вы можете изучить эти два каталога, чтобы увидеть, как выглядит типичный flatpak, а также что входит в SDK.
