Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/hosting-a-repository.po
Languages: ko, pt_br, ru, zh_cn

source: Hosting a repository
ko: 저장소 운영(hosting)
pt_br: Hospedando um repositório
ru: Размещение репозитория
zh_cn: 托管一个仓库

source: Flathub uses flat-manager to host its Flatpak repository. See https://github.com/flatpak/flat-manager
pt_br: O Flathub usa o flat-manager para hospedar seu repositório Flatpak. Veja https://github.com/flatpak/flat-manager
ru: Flathub использует flat-manager для размещения своего репозитория Flatpak. См.https://github.com/flatpak/flat-manager

source: The section on :doc:`flatpak-builder` describes how to generate repositories. The resulting repository can be hosted on a web server for consumption by users.
pt_br: A seção :doc:`flatpak-builder` descreve como gerar repositórios. O repositório resultante pode ser hospedado em um servidor web para uso pelos usuários.
ru: В разделе :doc:`flatpak-builder` описывается, как создавать репозитории. Полученный репозиторий может быть размещен на веб-сервере для использования пользователями.
zh_cn: :doc:`flatpak-builder`这部分描述了如何生成仓库。生成的仓库可以托管到一个web服务器供用户使用。

source: Important details
ko: 중요한 세부사항들
pt_br: Detalhes importantes
ru: Важные детали
zh_cn: 重要的细节

source: Flatpak repositories use archive-z2, meaning that they contain a single file for each file in the application. This means that pull operations involve a lot of HTTP requests. Since new requests can be slow, it is important to enable HTTP keep-alive on the web server that is hosting your repository.
pt_br: Os repositórios Flatpak usam archive-z2, o que significa que eles contêm um único arquivo para cada arquivo no aplicativo. Isso significa que as operações de download envolvem muitas solicitações HTTP. Como novas solicitações podem ser lentas, é importante ativar o “keep-alive” HTTP no servidor web que está hospedando seu repositório.
ru: В репозиториях Flatpak используется archive-z2, что означает, что они содержат один файл для каждого файла в приложении. Это означает, что операции pull включают множество HTTP-запросов. Поскольку новые запросы могут выполняться медленно, важно включить поддержку HTTP на веб-сервере, на котором размещен ваш репозиторий.
zh_cn: flatpak仓库使用archive-z2，意味着将所有文件打包成单个文件。拉取（译者注：pull）操作发起许多HTTP请求。因为新请求会很慢，所以在仓库所在web服务器开启HTTP keep-alive是很重要的。

source: Flatpak supports something called static deltas. These are single files that contain all the data needed to go between two revisions (or from nothing to a revision). Creating such deltas will take up more space on the server, but will make downloads much faster. This can be done with the ``flatpak build-update-repo --generate-static-deltas`` option.
pt_br: O Flatpak possui suporte a algo chamado deltas estáticos. Esses são arquivos únicos que contêm todos os dados necessários para passar entre duas revisões (ou do nada para uma revisão). A criação desses deltas ocupará mais espaço no servidor, mas tornará os downloads muito mais rápidos. Isso pode ser feito com a opção ``flatpak build-update-repo --generate-static-deltas``.
ru: Flatpak поддерживает так называемые статические дельты. Это отдельные файлы, содержащие все данные, необходимые для перехода между двумя редакциями (или от нуля до ревизии). Создание таких дельт займет больше места на сервере, но сделает загрузки намного быстрее. Это можно сделать с помощью опции ``flatpak build-update-repo --generate-static-deltas``.

source: .flatpakrepo files
ko: .flatpakrepo 파일
pt_br: Arquivos .flatpakrepo
ru: Файлы .flatpakrepo
zh_cn: .flatpckrepo 文件

source: ``.flatpakrepo`` files are a convenient way to let users add a repository. These are simple description files which contain information about the repository. For example, the Flathub repo file looks like::
ko: ``.flatpakrepo`` 파일을 사용하면 편리하게 저장소를 추가할 수 있다. 이 파일은 저장소에 관한 정보를 담고 있는 단순한 설명 파일이다. 플랫허브(Flathub) 저장소의 예를 들면 다음과 같다::
pt_br: Os arquivos ``.flatpakrepo`` são uma maneira conveniente de permitir que os usuários adicionem um repositório. Esses são arquivos de descrição simples que contêm informações sobre o repositório. Por exemplo, o arquivo de repositório Flathub se parece com::
ru: Файлы ``.flatpakrepo`` - удобный способ позволить пользователям добавить репозиторий. Это простые файлы описания, которые содержат информацию о репозитории. Например, файл репозитория Flathub выглядит так::
zh_cn: ``.flatpakrepo`` 文件是用户添加一个仓库的方便的方法。这些是包含仓库信息的简单描述文件。举个例子：Flathub的repo文件像这样::

source: Here you can see that the repo file contains descriptive metadata, such as the repository name, description, icon and website. The file also contains information that is needed to add the repository, including a download URL and the repository's GPG key.
ko: 저장소 파일에 저장소 이름, 설명, 아이콘, 웹사이트 주소 등 저장소에 관하여 설명하는 메타데이터 들이 포함되어 있음을 확인할 수 있다. 이 파일은 또한 다운로드 주소(URL)과 저장소의 GPG 키와 같이 저장소 추가 시 필요한 정보도 담고 있다.
pt_br: Aqui você pode ver que o arquivo repo contém metadados descritivos, como o nome do repositório, descrição, ícone e site. O arquivo também contém informações necessárias para adicionar o repositório, incluindo um URL de download e a chave GPG do repositório.
ru: Здесь вы можете видеть, что файл репо содержит описательные метаданные, такие как имя репозитория, описание, значок и веб-сайт. Файл также содержит информацию, необходимую для добавления репозитория, включая URL-адрес загрузки и ключ GPG репозитория.
zh_cn: 你可以看到repo文件包含描述性的元数据，例如仓库名字、描述、图标和网站。也包含了需要添加到仓库的信息，一个下载URL和仓库的GPG密钥。

source: ``.flatpakrepo`` files can be used to add a repository from the command line. For example, the command to add Flathub using its repo file is::
ko: 커맨드라인을 통해 저장소를 추가할 때 ``.flatpakrepo`` 파일들을 사용할 수 있다. 예를 들어, 저장소 파일을 사용하여 플랫허브 저장소를 추가하는 명령은 다음과 같다::
pt_br: Os arquivos ``.flatpakrepo`` podem ser usados para adicionar um repositório a partir da linha de comando. Por exemplo, o comando para adicionar o Flathub usando seu arquivo repo é::
ru: Файлы ``.flatpakrepo`` можно использовать для добавления репозитория из командной строки. Например, команда для добавления Flathub с использованием его файла repo::
zh_cn: 可以通过用命令行用``.flatpakrepo``文件添加仓库。举个例子，使用repo文件添加Flathub的命令是::

source: The command line isn't the only way to add a repository using a ``.flatpakrepo`` file - on desktops that support Flatpak, it is just a matter of clicking the repository file or a download link that points to it.
ko: 예시한 바와 같이 명령어를 사용하는 방식이 ``.flatpkrepo``를 사용해 저장소를 추가하는 유일한 방법은 아니다. 플랫팩을 지원하는 데스크탑환경에서는 저장소 파일을 클릭하거나 저장소 파일의 링크를 다운로드 링크를 클릭하는 간편한 방법을 사용할 수도 있다.
pt_br: A linha de comando não é a única maneira de adicionar um repositório usando um arquivo ``.flatpakrepo`` - em desktops compatíveis com o Flatpak, basta clicar no arquivo do repositório ou em um link de download que o aponte.
ru: Командная строка - не единственный способ добавить репозиторий с помощью файла ``.flatpakrepo`` - на настольных компьютерах, поддерживающих Flatpak, достаточно щелкнуть по файлу репозитория или по ссылке для загрузки, указывающей на него.
zh_cn: 使用``.flatpakrepo``文件不是添加仓库的唯一方法，添加一个仓库只是点击一个repo文件或者指向一个下载链接的问题。

source: ``.flatpakrepo`` files should include the base64-encoded version of the GPG key that was used to sign the repository. This can be obtained with the following command::
ko: ``.flatpakrepo`` 파일은 저장소 서명을 위한 base64 인코딩된 GPG key를 담고 있으며, 다음과 같이 얻을 수 있다::
pt_br: Os arquivos ``.flatpakrepo`` devem incluir a versão codificada em base64 da chave GPG que foi usada para assinar o repositório. Isso pode ser obtido com o seguinte comando::
ru: Файлы ``.flatpakrepo`` должны включать в себя версию ключа GPG в кодировке base64, который использовался для подписи репозитория. Это можно получить с помощью следующей команды::

source: The section on :doc:`flatpak-builder` describes how to generate repositories. The resulting OSTree repository can be hosted on a web server for consumption by users.
ko: :doc:`flatpak-builder` 섹션은 저장소를 생성하는 방법을 설명한다. 그 결과물인 OSTree 저장소를 웹 서버 상에서 호스팅하여 다른 사용자들이 접근하여 사용토록 할 수 있다.

source: OSTree repositories use archive-z2, meaning that they contain a single file for each file in the application. This means that pull operations involve a lot of HTTP requests. Since new requests can be slow, it is important to enable HTTP keep-alive on the web server that is hosting your repository.
ko: OSTree 저장소는 `archive-z2`를 사용하므로, 응용프로그램 내 각 파일에 일대일 대응되는 파일들을 포함하고 있다. 따라서 pull 연산은 많은 HTTP 요청을 야기한다. 새로운 요청은 느리게 처리되므로, 저장소를 운영하고 있는 웹서버 상에서 HTTP가 지속적으로 가용하도록 만드는 것이 중요하다.

source: OSTree supports something called static deltas. These are single files that contain all the data needed to go between two revisions (or from nothing to a revision). Creating such deltas will take up more space on the server, but will make downloads much faster. This can be done with the ``build-update-repo --generate-static-deltas`` option.
ko: OSTree는 정젹 변량(static deltas)이라는 것을 지원한다. 정적 변량이란, 저장소 내에서 한 revision으로부터 다른 revision까지의 데이터변화를 담고 있는 파일들의 집합이다. 이러한 변량 데이터들을 생성하개되면 서버의 저장공간을 차지하는 대신, 다운로드 속도를 향상시킨다. 이러한 기능을 사용하려면 ``build-update-repo —generate-static-deltas`` 옵션을 사용한다.

source: Flatpak supports something called static deltas. These are single files that contain all the data needed to go between two revisions (or from nothing to a revision). Creating such deltas will take up more space on the server, but will make downloads much faster. This can be done with the ``build-update-repo --generate-static-deltas`` option.
zh_cn: Flatpak支持所谓的静态增量。这些是单个文件，包含在两个修订(或从无到修订)之间所需的所有数据。创建这样的增量会占用服务器上更多的空间，但下载速度会更快。这可以通过 ``build-update-repo --generate-static-delta`` 选项来完成。
