Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/introductions.po
Languages: ru

source: Building Introduction
ru: Введение

source: Flatpak is a framework for distributing desktop applications across various Linux distributions. It has been created by developers who have a long history of working on the Linux desktop, and is run as an independent open source project.:doc:`first-build` has already provided a quick demonstration of how applications get built with Flatpak. This page provides an additional general overview of what's involved.
ru: Flatpak - это фреймворк для распространения настольных приложений в Linux. Он был создан разработчиками, имеющими долгую историю работы на десктопах Linux, и выполняется как независимый проект с открытым исходным кодом.:doc:`first-build` уже предоставил быструю демонстрацию того, как приложения создаются с помощью Flatpak. На этой странице представлен дополнительный общий обзор того, что задействовано.

source: ``flatpak-builder`` is the primary tool for building Flatpak applications. It allows you to take the source files for an application and build it into a Flatpak application. It also allows multiple other dependencies to be built at the same time, which get bundled into the build.
ru: ``Flatpak-builder`` - это основной инструмент для создания приложений Flatpak. Он позволяет вам взять исходные файлы для приложения и встроить их в приложение Flatpak. Он также позволяет одновременно создавать несколько других зависимостей, которые включаются в сборку.

source: Runtime: also called platforms, these are integrated platforms to provide basic utilities needed for a Flatpak application to work.
ru: Среда выполнения: также называемые платформами, это интегрированные платформы для предоставления основных утилит, необходимых для работы приложения Flatpak.

source: BaseApp: these are integrated platforms for frameworks like Electron.
ru: BaseApp: это интегрированные платформы для таких фреймворков, как Electron.

source: The input to ``flatpak-builder`` is a manifest file. This specifies the parameters for the application that will be built, such as its name and which runtime it will depend on. The manifest also lists all the modules that are to be built as part of the build process. A source for each module can be specified, including links to file archives or version control repositories. One of the modules (usually the last one) is the application code itself.
ru: Входными данными для ``Flatpak-builder`` является файл манифеста. Это определяет параметры для приложения, которое будет построено, например, его имя и среда выполнения, от которой оно будет зависеть. В манифесте также перечислены все модули, которые должны быть созданы как часть процесса сборки. Можно указать источник для каждого модуля, включая ссылки на файловые архивы или репозитории системы контроля версий. Один из модулей (обычно последний) - это сам код приложения.

source: Flatpak bundle: a specific single-file export format which contains a Flatpak app or runtime.
ru: Пакет Flatpak: особый формат экспорта одного файла, который содержит приложение или среду выполнения Flatpak.

source: Target audience
ru: Целевая аудитория

source: Flatpak can be used by all kinds of desktop applications, and aims to be as agnostic as possible regarding how applications are built. There are no requirements regarding which programming languages, build tools, toolkits or frameworks can be used.
ru: Flatpak может использоваться всеми типами настольных приложений и стремится быть максимально независимым в отношении того, как создаются приложения. Нет никаких требований относительно того, какие языки программирования, инструменты сборки, наборы инструментов или фреймворки можно использовать.

source: The basic format used to invoke ``flatpak-builder`` is::
ru: Основной формат, используемый для вызова ``flatpak-builder''::

source: While Flatpak only runs on Linux, it can be used by applications that target other operating systems, as well as those that are Linux-specific. Applications can be open source or proprietary (although some distribution services, like `Flathub <https://flathub.org/>`_, can have restrictions in this respect).
ru: Хотя Flatpak работает только в Linux, его могут использовать приложения, ориентированные на другие операционные системы, а также в специфичные для Linux. Приложения могут быть с открытым исходным кодом или проприетарными (хотя некоторые службы распространения, такие как `Flathub <https://flathub.org/>`_, могут иметь ограничения в этом отношении).

source: Where ``<build-dir>`` is the path to the directory that the application will be built into, and ``<manifest>`` is the path to a manifest file. The contents of ``<build-dir>`` can be useful for testing and debugging purposes, but is generally treated as an artifact of the build process.
ru: Где ``<build-dir>`` - это путь к каталогу, в который будет встроено приложение, а ``<manifest>`` - это путь к файлу манифеста. Содержимое ``<build-dir>`` может быть полезно для целей тестирования и отладки, но обычно рассматривается как артефакт процесса сборки.

source: The only technical requirements made by Flatpak are that applications follow a small number of Freedesktop standards, in order to enable desktop integration (see :doc:`conventions`).
ru: Единственные технические требования, предъявляемые Flatpak, заключаются в том, что приложения должны соответствовать небольшому количеству стандартов Freedesktop, чтобы обеспечить интеграцию с рабочим столом (см.:doc:`conventions`).

source: When ``flatpak-builder`` is run:
ru: При запуске ``Flatpak-builder``:

source: The build directory is created, if it doesn't already exist
ru: Каталог сборки создается, если он еще не существует

source: The source code for each module is downloaded and verified
ru: Исходный код для каждого модуля загружается и проверяется

source: The source code for each module is built and installed
ru: Исходный код для каждого модуля собран и установлен

source: The build is finished by setting sandbox permissions
ru: Сборка завершена, после установки разрешений для песочницы

source: The build result is exported to a repository (which will be created if it doesn't exist already)
ru: Результат сборки экспортируется в репозиторий (который будет создан, если он еще не существует).

source: The application can then be installed from the repository and run.
ru: Затем приложение можно установить из репозитория и запустить.

source: Issues of current model of packaging
ru: Проблемы текущей модели упаковки

source: It is important to understand the problems of the current model of packaging applications to understand the existence of Flatpak:
ru: Чтобы понять существование Flatpak, важно понимать проблемы текущей модели упаковки приложений:

source: **Duplicated work packaging apps**: many Linux distributions come with their own package manager, package format and repository. This requires a lot of maintainers to package the same application in various distributions, or the application developer to learn the language of each format and then package the application in those distributions, or ignore most distributions and package and support a couple of distributions. This makes the Linux desktop a difficult platform for software vendors to target.
ru: **Приложения для дублирования работы**: многие дистрибутивы Linux поставляются со своим собственным менеджером пакетов, форматом пакетов и репозиторием. Для этого требуется, чтобы множество специалистов по сопровождению упаковывало одно и то же приложение в различные дистрибутивы, или разработчик приложения изучал язык каждого формата, а затем упаковывал приложение в эти дистрибутивы, или игнорировал большинство дистрибутивов и упаковывал и поддерживал несколько дистрибутивов. Это делает рабочий стол Linux сложной платформой для поставщиков программного обеспечения.

source: **Limited to apps that are packaged**: not all applications are natively available in every Linux distribution. If an application is not available in a specific distribution, the user will have to rely on manually downloading the archive of the application, extracting it and hoping the application will launch.
ru: **Ограничено пакетными приложениями**: не все приложения изначально доступны в каждом дистрибутиве Linux. Если приложение недоступно в конкретном дистрибутиве, пользователю придется вручную загрузить архив приложения, распаковать его и надеяться, что приложение запустится.

source: **Hard to innovate in OS space**: the maintainers of the distributions have to spend a lot of time packaging applications to make the distribution suitable for the end user, instead of focusing on their end goals. This delays the progress of each distribution.
ru: **Трудно внедрять инновации в пространстве ОС**: разработчикам дистрибутивов приходится тратить много времени на упаковку приложений, чтобы сделать дистрибутив подходящим для конечного пользователя, вместо того, чтобы сосредоточиться на своих конечных целях. Это задерживает продвижение каждого дистрибутива.

source: **Limited to distributions that have the apps**: the user is limited to the number of distributions that have the needed applications for them to properly setup their workflow. This reduces the amount of distributions that can be suitable for a user.
ru: **Ограничено дистрибутивами, в которых есть приложения**: пользователь ограничен количеством дистрибутивов, в которых есть приложения, необходимые для правильной настройки рабочего процесса. Это уменьшает количество дистрибутивов, подходящих для пользователя.

source: Software Development Kits (SDKs)
ru: Наборы для разработки программного обеспечения (SDK)

source: Instead of being built using the host environment, Flatpak applications are built inside a separate environment, called an SDK.
ru: Вместо создания с использованием среды хоста, приложения Flatpak создаются в отдельной среде, называемой SDK.

source: SDKs are like the regular runtime that applications run in. The difference is that SDKs also include all the development resources and tools that are required to build an application, such as build and packaging tools, header files, compilers and debuggers.
ru: SDK похожи на обычную среду выполнения, в которой выполняются приложения. Разница в том, что SDK также включают все ресурсы и инструменты разработки, необходимые для создания приложения, такие как средства сборки и упаковки, файлы заголовков, компиляторы и отладчики.

source: Each runtime has an accompanying SDK. For example, there is both a GNOME 3.26 runtime and a GNOME 3.26 SDK. Applications that use the runtime are built with the matching SDK.
ru: Каждая среда выполнения имеет сопутствующий SDK. Например, существует как среда выполнения GNOME 3.26, так и SDK GNOME 3.26. Приложения, использующие среду выполнения, создаются с использованием соответствующего SDK.

source: Like runtimes, SDKs will sometimes be automatically installed for you, but if you do need to manually install them, they are installed in the same way as applications and runtimes, such as::
ru: Как и среды выполнения, SDK иногда устанавливаются автоматически, но если вам всё-же нужно установить их вручную, они устанавливаются так же, как приложения и среды выполнения, например::

source: Flatpak strives to fix the issues listed above, by conveniently enabling developers to distribute applications from one source and to target the entire Linux desktop.
ru: Flatpak стремится исправить перечисленные выше проблемы, предоставляя разработчикам возможность распространять приложения из одного источника и нацеливаться на весь рабочий стол Linux.

source: Reasons to use Flatpak
ru: Причины использовать Flatpak

source: Flatpak has some major advantages over most system package managers:
ru: Flatpak имеет несколько основных преимуществ перед большинством системных менеджеров пакетов:

source: **Universality**: Flatpak allows applications to be installed and run on virtually any Linux distribution. This includes non-GNU distributions, systemd-free distributions, distributions with a read-only operating system (OS), and various architectures without the developer needing the relevant hardware on hand.
ru: **Универсальность**: Flatpak позволяет устанавливать и запускать приложения практически в любом дистрибутиве Linux. Сюда входят дистрибутивы, отличные от GNU, дистрибутивы без systemd, дистрибутивы с операционной системой (ОС) только для чтения, а также различные архитектуры без необходимости разработчика в соответствующем оборудовании.

source: **Space for innovations**: Flatpak facilitates distribution maintainers to focus on their goals to innovate their distribution.
ru: **Пространство для инноваций**: Flatpak помогает специалистам по разработке дистрибутивов сосредоточиться на своих целях по внедрению инноваций в свои дистрибутивы.

source: **Stability**: breakage in a Flatpak application will not risk the system from breaking. This is because Flatpak applications and runtimes are contained to not interfere with the system altogether.
ru: **Стабильность**: поломка в приложении Flatpak не приведет к поломке системы. Это связано с тем, что приложения и среды выполнения Flatpak содержатся, чтобы полностью не мешать работе системы.

source: **Rootless install**: elevated privileges are not required when installing a Flatpak application or a runtime.
ru: **Установка без Root-прав**: повышенные привилегии не требуются при установке приложения Flatpak или среды выполнения.

source: **Sandboxed applications**: one of Flatpak's main goals is to increase the security of desktop systems by isolating applications from one another. This is achieved using sandboxing and means that, by default, applications that are run with Flatpak have limited access to the host environment.
ru: **Изолированные приложения**: одна из основных целей Flatpak - повысить безопасность настольных систем за счет изоляции приложений друг от друга. Это достигается с помощью песочницы и означает, что по умолчанию приложения, запускаемые с Flatpak, имеют ограниченный доступ к среде хоста.

source: Flatpak has some major advantages over other universal approaches to distributing applications on Linux:
ru: Flatpak имеет несколько основных преимуществ перед другими универсальными подходами к распространению приложений в Linux:

source: **Decentralized by design**: while Flatpak does provide a centralized service for distributing applications, it also allows decentralized hosting and distribution, so that application developers or downstreams can host their own applications and application repositories.
ru: **Децентрализован по дизайну**: Наконец, хотя Flatpak действительно предоставляет централизованный сервис для распространения приложений, он также обеспечивает децентрализованный хостинг и распространение, так что разработчики приложений или подчиненные могут размещать свои собственные приложения и репозитории приложений.

source: **Desktop integration**: Flatpak also offers native integration for the main Linux desktops, so that users can easily browse, install, run and use Flatpak applications through their existing desktop environment and tools.
ru: **Интеграция с рабочим столом**: Flatpak также предлагает встроенную интеграцию для основных рабочих столов Linux, так что пользователи могут легко просматривать, устанавливать, запускать и использовать приложения Flatpak через свою существующую среду рабочего стола и имеющиеся у них инструменты.

source: **Space efficiency**: Flatpak deduplicates libraries and other files used by multiple applications to save megabytes or even gigabytes worth of storage depending on the amount of applications installed.
ru: **Эффективное использование пространства**: Flatpak выполняет дедупликацию библиотек и других файлов, используемыхнесколькими приложениями, чтобы сэкономить мегабайты или даже гигабайты хранилища в зависимости от количества установленных приложений.

source: **Delta updates**: only changed files are downloaded for updates."
ru: **Дельта-обновления**: для обновлений загружаются только измененные файлы.

source: Other benefits for developers include:
ru: Другие преимущества для разработчиков:

source: **Forward-compatibility**: the same Flatpak application can be run on different versions of the same distribution, including versions that haven't been released yet. This doesn't require any changes or management by application developers.
ru: **Прямая совместимость**: один и тот же Flatpak может работать в разных версиях одного и того же дистрибутива, включая версии, которые еще не были выпущены. Это не требует каких-либо изменений или управления со стороны разработчиков приложений.

source: **Bundling**: this allows application developers to ship almost any dependency or library as part of their application. This gives complete control over which software is used to build applications.
ru: **Объединение**: это позволяет разработчикам приложений поставлять практически любую зависимость или библиотеку как часть своего приложения. Это дает полный контроль над тем, какое программное обеспечение используется для создания приложений.

source: **Consistent application environments**: because these are the same across devices, applications perform as intended. This also makes it easier to identify bugs and to do testing.
ru: **Согласованные среды приложений**: поскольку они одинаковы на всех устройствах, приложения работают должным образом. Это также упрощает выявление ошибок и проведение тестирования.

source: **Branches**: this allows developers to ship applications from different branches, e.g. ``stable``, ``beta``, etc. while retaining the same name.
ru: **Ветки**: это позволяет разработчикам отправлять приложения из разных веток, например «стабильная», «бета» и т. д. с тем же названием.

source: **Maintained platforms**: called runtimes, these contain collections of dependencies, which can be used by applications, and which can take a lot of the work out of application development.
ru: **Поддерживаемые платформы**: называемые средами выполнения, они содержат наборы зависимостей, которые могут использоваться приложениями и которые могут потребовать значительных усилий при разработке приложений.

source: Information about Flatpak's internals can be found in :doc:`under-the-hood`.
ru: Информацию о внутреннем устройстве Flatpak можно найти в :doc:`under-the-hood`.
