Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/introduction.po
Languages: de, fr, ko, pt_br, ru, zh_hans_cn

source: **Space efficiency**: Flatpak deduplicates libraries and other files used by multiple applications to save megabytes or even gigabytes worth of storage depending on the amount of applications installed.
pt_br: **Eficiência de espaço**: Flatpak elimina a duplicidade de bibliotecas e outros arquivos usados por vários aplicativos para economizar megabytes ou mesmo gigabytes de armazenamento, dependendo da quantidade de aplicativos instalados.
ru: **Эффективность использования пространства**: Flatpak дедуплицирует библиотеки и другие файлы, используемые несколькими приложениями, чтобы сэкономить мегабайты или даже гигабайты хранилища в зависимости от количества установленных приложений.

source: **Delta updates**: only changed files are downloaded for updates.
pt_br: **Atualizações delta**: apenas os arquivos alterados são baixados para atualizações.
ru: **Дельта-обновления**: для обновлений загружаются только измененные файлы.

source: Other benefits for developers include:
pt_br: Outros benefícios para os desenvolvedores incluem:
ru: Среди других преимуществ для разработчиков:
zh_hans_cn: 其他开发者可以得益的地方：

source: **Forward-compatibility**: the same Flatpak application can be run on different versions of the same distribution, including versions that haven't been released yet. This doesn't require any changes or management by application developers.
pt_br: **Compatibilidade futura**: o mesmo Flatpak pode ser executado em diferentes versões da mesma distribuição, incluindo versões que não foram lançadas ainda. Isso não requer nenhuma alteração ou gerenciamento por desenvolvedores de aplicativos.
ru: **Прямая совместимость**: одно и то же приложение Flatpak можно запускать в разных версиях одного и того же дистрибутива, включая версии, которые еще не выпущены. Это не требует каких-либо изменений или управления со стороны разработчиков приложений.

source: **Bundling**: this allows application developers to ship almost any dependency or library as part of their application. This gives complete control over which software is used to build applications.
pt_br: **Empacotamento**: isso permite que os desenvolvedores de aplicativos enviem praticamente qualquer dependência ou biblioteca como parte de seu aplicativo. Isso fornece controle total sobre qual software é usado para compilar aplicativos.
ru: **Объединение**: это позволяет разработчикам приложений поставлять практически любую зависимость или библиотеку как часть своего приложения. Это дает полный контроль над тем, какое программное обеспечение используется для создания приложений.

source: **Consistent application environments**: because these are the same across devices, applications perform as intended. This also makes it easier to identify bugs and to do testing.
pt_br: **Ambientes de aplicativos consistentes**: por serem os mesmos em todos os dispositivos, os aplicativos têm o desempenho pretendido. Isso também facilita a identificação de bugs e a realização de testes.
ru: **Последовательные среды приложений**: поскольку они одинаковы на всех устройствах, приложения работают так, как задумано. Это также упрощает выявление ошибок и тестирование.

source: **Branches**: this allows developers to ship applications from different branches, e.g. ``stable``, ``beta``, etc. while retaining the same name.
pt_br: **Ramos**: isso permite que os desenvolvedores enviem aplicativos de diferentes ramos, por exemplo, ``stable``, ``beta``, etc. mantendo o mesmo nome.
ru: **Ветки**: это позволяет разработчикам отправлять приложения из разных веток, например. «стабильная», «бета» и т. д., сохраняя то же имя.

source: **Maintained platforms**: called runtimes, these contain collections of dependencies, which can be used by applications, and which can take a lot of the work out of application development.
pt_br: **Plataformas mantidas**: chamadas de runtimes, elas contêm coleções de dependências, que podem ser usadas por aplicativos e que podem tirar muito do trabalho de desenvolvimento de aplicativos.
ru: **Поддерживаемые платформы**: называемые средами выполнения, они содержат наборы зависимостей, которые могут использоваться приложениями и которые могут отнимать много времени при разработке приложений.

source: Information about Flatpak's internals can be found in :doc:`under-the-hood`.
pt_br: Informações sobre os componentes internos do Flatpak podem ser localizadas em :doc:`under-the-hood`.
ru: Информацию о внутренностях Flatpak можно найти в :doc:«под капотом».
zh_hans_cn: 关于Flatpak的更多信息可以参考 :doc:`under-the-hood`。

source: Flatpak is a framework for distributing desktop applications on Linux. It has been created by developers who have a long history of working on the Linux desktop, and is run as an independent open source project.
zh_hans_cn: Flatpak是一个用于在Linux上分发桌面应用程序的框架。 它由具有长期工作在Linux桌面的开发人员创建，并作为独立的开源项目运行。

source: Flatpak has some major advantages over other approaches to distributing applications on Linux. First and foremost, Flatpak allows a single application build to be installed and run on virtually any Linux distribution. It can also be used in combination with `Flathub <https://flathub.org/>`_, a centralized service for distributing applications on all distributions. This makes it possible for application developers to target the entire Linux desktop market from one place.
zh_hans_cn: 与其他在Linux上分发应用程序的方法相比，Flatpak具有一些主要优势。 首先，Flatpak允许在几乎任何Linux发行版上安装和运行单个应用程序构建。 它还可以与 `Flathub <https://flathub.org/>`_ 结合使用，Flathub是一种中心化服务，用于在所有发行版上分发应用程序。 这使得应用开发者可以从一个地方瞄准整个Linux桌面市场。

source: Flatpak also offers native integration for the main Linux desktops, so that users can easily browse, install, run and use Flatpak applications through their existing desktop environment and tools.
zh_hans_cn: Flatpak还为主要Linux桌面提供本机集成，以便用户可以通过现有的桌面环境和工具轻松浏览，安装，运行和使用Flatpak应用程序。

source: **Forward-compatibility:** the same Flatpak can be run on different versions of the same distribution, including versions that haven't been released yet. This doesn't require any changes or management by application developers.
zh_hans_cn: **向前兼容**：相同的Flatpak可以在同一发行版的不同版本上运行，包括尚未发布的版本。 这不需要应用程序开发人员进行任何更改或管理。

source: **Maintained platforms:** called runtimes, these contain collections of dependencies, which can be used by applications, and which can take a lot of the work out of application development.
zh_hans_cn: **维护平台**：称为运行时，它们包含依赖项集合，可供应用程序使用，并且可以从应用程序开发中完成大量工作。

source: **Bundling:** this allows application developers to ship almost any dependency or library as part of their application. This gives complete control over which software is used to build applications.
zh_hans_cn: **捆绑**：这允许应用程序开发人员将几乎任何依赖项或库作为其应用程序的一部分。 这样可以完全控制用于构建应用程序的软件。

source: **Consistent application environments:** because these are are the same across devices, applications perform as intended. This also makes it easier to identify bugs and to do testing.
zh_hans_cn: **一致的应用程序环境**：因为在不同设备之间是应用程序的环境是相同的，所以应用程序按预期执行。 这也使得开发者识别错误和进行测试变得更容易。

source: Finally, while Flatpak does provide a centralized service for distributing applications, it also allows decentralized hosting and distribution, so that application developers or downstreams can host their own applications and application repositories.
zh_hans_cn: 最后，虽然Flatpak确实为分发应用程序提供了中心化服务，但它还允许分布式托管和分发，以便应用开发者或下游可以托管他们自己的应用和应用仓库。
