Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/introduction.po
Languages: de, fr, ko, pt_br, ru, zh_hans_cn

source: `Appstream <https://www.freedesktop.org/software/appstream/docs/>`_ metadata, to allow Flatpak applications to show up nicely in software-center applications
de: Appstream <https://www.freedesktop.org/software/appstream/docs/>`_-Metadaten, um es Flatpak-Applikationen zu erlauben, problemlos unter den Anwendungen im Softwarecenter aufgelistet zu werden
fr: Les méta-données `Appstream <https://www.freedesktop.org/software/appstream/docs/>`_, qui permettent les applications Flatpak d'apparaître proprement dans l'application software-center
ko: `Appstream <https://www.freedesktop.org/software/appstream/docs/>`_ 메타데이터를 사용하여 소프트웨어 센터 응용프로그램에 플랫팩 응용프로그램들을 표시

source: Flatpak makes it easy to take advantage of these features. If you haven't already, it is recommended that you try the `hello world <http://flatpak.org/hello-world.html>`_ example, as a way of getting started.
de: Flatpak macht es einfach Nutzen aus diesen Merkmalen zu ziehen. Wenn man es noch nicht ausprobiert haben sollte, ist es empfohlen das `hello world <http://flatpak.org/hello-world.html>`_-Beispiel zu durchlaufen, um einen Einstieg zu finden.
fr: Flatpak rend l'accès facile à ces fonctions. Si ce n'est déjà fait, il est recommandé d'essayer l'exemple `hello world <http://flatpak.org/hello-world.html>`_, comme un moyen de débuter.

source: Runtimes provide the basic dependencies that are used by applications. Various runtimes are available, from more minimal (but more stable) Freedesktop runtimes, to larger runtimes produced by desktops like GNOME or KDE. (The `runtimes page <http://flatpak.org/runtimes.html>`_ on flatpak.org provides an overview of the runtimes that are currently available.)
de: Runtimes beinhalten die grundsätzlichen Abhängigkeiten, die von Applikationen genutzt werden. Von eher minimalen (aber stabileren) Freedesktop-Runtimes zu größeren Laufzeitumgebungen, die von Desktops, wie GNOME oder KDE erzeugt werden. (Die Rubrik für `Runtimes <http://flatpak.org/runtimes.html>`_ auf flatpak.org beherbergt eine Übersicht über die Laufzeitumgebungen, die derzeit verfügbar sind.
fr: Les runtime fournissent les dépendences essentielles qui sont utilisées par les applications. Différents runtimes sont disponibles, du très minimal (mais plus stable) Freedesktop, à de plus gros produits par des environnements de bureaux comme GNOME ou KDE. La `page runtimes <http://flatpak.org/runtimes.html>`_ sur flatpak.org fournit un aperçu des runtimes qui sont actuellement disponibles.)

source: SDKs (Software Developer Kits)
de: SDKs (Softwareentwicklungssyteme)
fr: SDKs (kits de développement logiciel)

source: An SDK is a runtime that includes the 'devel' parts which are not needed at runtime, such as build and packaging tools, header files, compilers and debuggers. Each application is built against an SDK, which is paired with a runtime (this is the runtime that will be used by the application at runtime).
de: Ein SDK ist eine Runtime, die die 'devel'-Teile, die nicht während der Laufzeit benötigt werden, enthält. Hierzu gehören bspw.: Erstellungs- & Paketierungstools, Header-Dateien, Compiler und Debugger. Jede Anwendung wird gegen ein SDK erzeugt, welches mit einer Runtime gekoppelt ist (dies ist die Runtime, die während der Laufzeit von der Applikation verwendet wird).
fr: Un SDK est un runtime qui inclut les parties 'devel' qui ne sont pas nécessaires au runtime, comme si les outils de construction et d'empaquettage, les fichiers d'en-tête, les compilateurs et les débogueurs. Chaque application est construite avec ce SDK, qui est lié avec le runtime (ce runtime qui sera utilisé par l'application à son exécution).

source: Extensions
de: Extensions (Erweiterungen)

source: An extension is an optional add-on for a runtime or application. They are most commonly used to split out translations and debug info from runtimes. For example, ``org.freedesktop.Platform.Locale`` can be added to the ``org.freedesktop.Platform`` runtime in order to add translations.
de: Eine Erweiterung ist ein optionales Add-On für eine Runtime oder Applikation. Sie werden meistens genutzt um Übersetzungen und Debug-Infos zu einer Laufzeitumgebung hinzuzufügen. Zum Beispiel kann ``org.freedesktop.Platform.Locale`` zur ``org.freedesktop.Platform``-Runtime hinzugefügt werden, um Übersetzungen zu erhalten.
fr: Les extensions sont des modules optionnels pour un runtime ou une application. Elles sont utilisées pour séparer les traductions et les informations de debogage des runtimes. Par exemple ``org.freedesktop.Platform.Locale`` peut être ajouté au runtime ``org.freedesktop.Platform`` afin d'ajouter les traductions.

source: ``flatpak`` is the command that is used to install, remove and update runtimes and applications. It can also be used to view what is currently installed, and has commands for building and distributing application bundles. ``flatpak --help`` provides a full list of available commands.
de: ``flatpak`` wird als Kommando verwendet, um Runtimes und Anwendungen zu installieren, zu entfernen und zu aktualisieren. Es kann zudem dafür verwendet werden, zu sehen, was derzeit installiert ist. Des Weiteren besitzt es Befehle zum Erzeugen und verteilen von Anwendungspaketen. ``flatpak --help`` beinhaltet eine vollständige Liste aller verfügbaren Befehle.
fr: ``flatpak`` est la commande utilisée pour installer, supprimer et mettre à jour les runtimes et les applications. Elle peut être utilisée pour voir ce qui est actuellement installé, et possède des commandes pour construire et distribuer des lots d'application. ``flatpak --help`` fournit la liste complète des commandes disponibles.

source: For more information on flatpak commands, see the :doc:`command-reference`
de: Für mehr Informationen zu Flatpak-Kommandos kann die :doc:`command-reference` herangezogen werden.
fr: Pour plus d'informations sur les commandes flatpak, regardez la :doc:`command-reference`

source: Cgroups
de: Cgroups (Kontrollgruppen)
fr: Groupes de contrôle (Cgroups)

source: Flatpak is a framework for distributing desktop applications across various Linux distributions. It has been created by developers who have a long history of working on the Linux desktop, and is run as an independent open source project.
pt_br: Flatpak é um framework para distribuir aplicativos de desktop em várias distribuições Linux. Ele foi criado por desenvolvedores que têm um longo histórico de trabalho no desktop Linux e é executado como um projeto independente de código aberto.
ru: Flatpak — это платформа для распространения настольных приложений в различных дистрибутивах Linux. Он был создан разработчиками, которые имеют долгую историю работы с рабочим столом Linux, и работает как независимый проект с открытым исходным кодом.

source: Terminology
pt_br: Terminologia
ru: Терминология

source: Flatpak: a system for building, distributing, and running sandboxed desktop applications on Linux.
pt_br: Flatpak: um sistema para construir, distribuir e executar aplicativos de desktop em área isolada no Linux.
ru: Flatpak: система для создания, распространения и запуска изолированных десктопных приложений в Linux.

source: Flatpak application: these are the applications the user installs via the ``flatpak`` command or via a different UI like GNOME Software or KDE Discover.
pt_br: Aplicativo Flatpak: estes são os aplicativos que o usuário instala através do comando ``flatpak`` ou através de uma interface de usuário diferente como GNOME Programas ou KDE Discover.
ru: Приложение Flatpak: это приложения, которые пользователь устанавливает с помощью команды «flatpak» или через другой пользовательский интерфейс, такой как GNOME Software или KDE Discover.

source: Runtime: also called platforms, these are integrated platforms to provide basic utilities needed for a Flatpak application to work.
pt_br: Runtime: também chamadas de plataformas, são plataformas integradas para fornecer os utilitários básicos necessários para o funcionamento de um aplicativo Flatpak.
ru: Runtime: также называемые платформами, это интегрированные платформы для предоставления основных утилит, необходимых для работы приложения Flatpak.

source: BaseApp: these are integrated platforms for frameworks like Electron.
pt_br: BaseApp: também chamado de aplicativos base, são plataformas integradas para frameworks como o Electron.
ru: BaseApp: это интегрированные платформы для таких фреймворков, как Electron.

source: Flatpak bundle: a specific single-file export format which contains a Flatpak app or runtime.
pt_br: Pacote Flatpak: um formato de exportação de arquivo único específico que contém um aplicativo ou runtime do Flatpak.
ru: Flatpak bundle: особый формат экспорта одного файла, который содержит приложение Flatpak или среду выполнения.

source: Target audience
pt_br: Audiência alvo
ru: Целевая аудитория
zh_hans_cn: 目标受众

source: Flatpak can be used by all kinds of desktop applications, and aims to be as agnostic as possible regarding how applications are built. There are no requirements regarding which programming languages, build tools, toolkits or frameworks can be used.
pt_br: O Flatpak pode ser usado por todos os tipos de aplicativos de desktop e visa ser o mais independente possível em relação à forma como os aplicativos são compilados. Não há requisitos sobre quais linguagens de programação, ferramentas de compilação, kits de ferramentas ou frameworks podem ser usados.
ru: Flatpak может использоваться всеми видами десктопных приложений и стремится быть максимально независимым от того, как создаются приложения. Нет никаких требований относительно того, какие языки программирования, инструменты сборки, наборы инструментов или фреймворки можно использовать.
zh_hans_cn: Flatpak可以被各种桌面应用程序使用，旨在尽可能与应用程序的构建方式无关。 也对编程语言，构建工具，工具包或框架不作要求。

source: While Flatpak only runs on Linux, it can be used by applications that target other operating systems, as well as those that are Linux-specific. Applications can be open source or proprietary (although some distribution services, like `Flathub <https://flathub.org/>`_, can have restrictions in this respect).
pt_br: Embora o Flatpak seja executado apenas no Linux, ele pode ser usado por aplicativos direcionados a outros sistemas operacionais, bem como àqueles específicos do Linux. Os aplicativos podem ser de código aberto ou privativos (embora alguns serviços de distribuição, como `Flathub <https://flathub.org/>`_, possam ter restrições a esse respeito).
ru: Хотя Flatpak работает только в Linux, его могут использовать приложения, предназначенные для других операционных систем, а также приложения, специфичные для Linux. Приложения могут быть с открытым исходным кодом или проприетарными (хотя некоторые службы распространения, такие как `Flathub <https://flathub.org/>`_, могут иметь ограничения в этом отношении).
zh_hans_cn: 虽然Flatpak只能在Linux上运行，但它可以被针对其他操作系统的应用程序以及特定于Linux的应用程序使用。 应用程序可以是开源的或专有的（尽管某些分发服务，如 `Flathub <https://flathub.org/>`_ ，在这方面可能有限制）。

source: The only technical requirements made by Flatpak are that applications follow a small number of Freedesktop standards, in order to enable desktop integration (see :doc:`conventions`).
pt_br: Os únicos requisitos técnicos feitos pelo Flatpak são que os aplicativos sigam um pequeno número de padrões Freedesktop, a fim de permitir a integração da desktop (consulte :doc:`conventions`).
ru: Единственные технические требования, предъявляемые Flatpak, заключаются в том, что приложения должны соответствовать небольшому количеству стандартов Freedesktop, чтобы обеспечить интеграцию с рабочим столом (см. :doc:`условия`).
zh_hans_cn: Flatpak提出的唯一技术要求是应用程序遵循少量的Freedesktop标准，以实现桌面集成（参考 :doc:`conventions`）。

source: Issues of current model of packaging
pt_br: Questões do modelo atual de empacotamento
ru: Проблемы текущей модели упаковки

source: It is important to understand the problems of the current model of packaging applications to understand the existence of Flatpak:
pt_br: É importante entender os problemas do modelo atual de aplicativos de empacotamento para entender a existência do Flatpak:
ru: Важно понимать проблемы текущей модели упаковки приложений, чтобы понять существование Flatpak:

source: **Duplicated work packaging apps**: many Linux distributions come with their own package manager, package format and repository. This requires a lot of maintainers to package the same application in various distributions, or the application developer to learn the language of each format and then package the application in those distributions, or ignore most distributions and package and support a couple of distributions. This makes the Linux desktop a difficult platform for software vendors to target.
pt_br: **Trabalho duplicado empacotando aplicativos**: muitas distribuições Linux vêm com seu próprio gerenciador de pacotes, formato de pacote e repositório. Isso exige que muitos mantenedores empacotem o mesmo aplicativo em várias distribuições, ou que o desenvolvedor do aplicativo aprenda a linguagem de cada formato e, em seguida, empacote o aplicativo nessas distribuições, ou ignore a maioria das distribuições e empacote e dê suporte a algumas distribuições. Isso torna o desktop Linux uma plataforma difícil para os fornecedores de software.
ru: **Дублированные рабочие приложения для упаковки**: многие дистрибутивы Linux поставляются со своим собственным менеджером пакетов, форматом пакета и репозиторием. Для этого требуется, чтобы множество сопровождающих упаковывали одно и то же приложение в различные дистрибутивы, или разработчику приложения приходилось изучать язык каждого формата, а затем упаковывать приложение в эти дистрибутивы, или игнорировать большинство дистрибутивов, упаковывать и поддерживать несколько дистрибутивов. Это делает рабочий стол Linux сложной платформой для поставщиков программного обеспечения.

source: **Limited to apps that are packaged**: not all applications are natively available in every Linux distribution. If an application is not available in a specific distribution, the user will have to rely on manually downloading the archive of the application, extracting it and hoping the application will launch.
pt_br: **Limitado a aplicativos empacotados**: nem todos os aplicativos estão disponíveis nativamente em todas as distribuições Linux. Se um aplicativo não estiver disponível em uma distribuição específica, o usuário terá que confiar no download manual do arquivo do aplicativo, extraindo-o e esperando que o aplicativo seja iniciado.
ru: **Ограничено пакетными приложениями**: не все приложения изначально доступны в каждом дистрибутиве Linux. Если приложение недоступно в определенном дистрибутиве, пользователю придется вручную загрузить архив приложения, распаковать его и надеяться, что приложение запустится.

source: **Limited to distributions that have the apps**: the user is limited to the number of distributions that have the needed applications for them to properly setup their workflow. This reduces the amount of distributions that can be suitable for a user.
pt_br: **Limitado a distribuições que possuem os aplicativos**: o usuário está limitado ao número de distribuições que possuem os aplicativos necessários para configurar corretamente seu fluxo de trabalho. Isso reduz a quantidade de distribuições que podem ser adequadas para um usuário.
ru: **Ограничено дистрибутивами, в которых есть приложения**: пользователь ограничен количеством дистрибутивов, в которых есть необходимые приложения для правильной настройки рабочего процесса. Это уменьшает количество дистрибутивов, которые могут подойти пользователю.

source: **Hard to innovate in OS space**: the maintainers of the distributions have to spend a lot of time packaging applications to make the distribution suitable for the end user, instead of focusing on their end goals. This delays the progress of each distribution.
pt_br: **Difícil inovar no espaço do sistema operacional**: os mantenedores das distribuições precisam gastar muito tempo empacotando aplicativos para tornar a distribuição adequada ao usuário final, em vez de se concentrar em seus objetivos finais. Isso atrasa o progresso de cada distribuição.
ru: **Трудно внедрять инновации в пространстве ОС**: сопровождающим дистрибутивов приходится тратить много времени на упаковку приложений, чтобы сделать дистрибутив пригодным для конечного пользователя, вместо того, чтобы сосредоточиться на своих конечных целях. Это задерживает продвижение каждого дистрибутива.

source: **Old and outdated packages**: LTS distributions often have very old versions of applications packaged natively. Bug reproducibility is hindered by the different environments that applications are run in, and application developers often have little control over how their application is packaged by distributions.
pt_br: **Pacotes antigos e desatualizados**: as distribuições LTS geralmente têm versões muito antigas de aplicativos empacotados nativamente. A reprodutibilidade do bug é prejudicada pelos diferentes ambientes nos quais os aplicativos são executados, e os desenvolvedores de aplicativos geralmente têm pouco controle sobre como seus aplicativos são empacotados pelas distribuições.
ru: **Старые и устаревшие пакеты**: дистрибутивы LTS часто содержат очень старые версии приложений, изначально упакованные. Воспроизводимости ошибок препятствуют различные среды, в которых запускаются приложения, и разработчики приложений часто имеют мало контроля над тем, как их приложение упаковано дистрибутивами.

source: Flatpak strives to fix the issues listed above, by conveniently enabling developers to distribute applications from one source and to target the entire Linux desktop.
pt_br: O Flatpak se esforça para corrigir os problemas listados acima, permitindo convenientemente que os desenvolvedores distribuam aplicativos de uma fonte e direcionem todo o desktop Linux.
ru: Flatpak стремится исправить перечисленные выше проблемы, удобно позволяя разработчикам распространять приложения из одного источника и ориентироваться на все десктопные дистрибутивы Linux.

source: Reasons to use Flatpak
pt_br: Motivos para usar o Flatpak
ru: Причины использовать Flatpak
zh_hans_cn: 使用Flatpak的理由

source: Flatpak has some major advantages over most system package managers:
pt_br: O Flatpak tem algumas vantagens importantes sobre a maioria dos gerenciadores de pacotes do sistema:
ru: Flatpak имеет ряд существенных преимуществ перед большинством системных менеджеров пакетов:

source: **Universality**: Flatpak allows applications to be installed and run on virtually any Linux distribution. This includes non-GNU distributions, systemd-free distributions, distributions with a read-only operating system (OS), and various architectures without the developer needing the relevant hardware on hand.
pt_br: **Universalidade**: Flatpak permite que aplicativos sejam instalados e executados em praticamente qualquer distribuição Linux. Isso inclui distribuições não GNU, distribuições sem sistema, distribuições com sistema operacional (SO) somente leitura e várias arquiteturas sem que o desenvolvedor precise do hardware relevante disponível.
ru: **Универсальность**: Flatpak позволяет устанавливать приложения и запускать их практически в любом дистрибутиве Linux. Сюда входят дистрибутивы, отличные от GNU, дистрибутивы без systemd, дистрибутивы с операционной системой (ОС) только для чтения и различные архитектуры, для которых разработчику не требуется соответствующее оборудование.

source: **Space for innovations**: Flatpak facilitates distribution maintainers to focus on their goals to innovate their distribution.
pt_br: **Espaço para inovações**: Flatpak facilita que os mantenedores de distribuição se concentrem em seus objetivos para inovar sua distribuição.
ru: **Простор для инноваций**: Flatpak помогает специалистам по поддержке дистрибутива сосредоточиться на своих целях по внедрению инноваций в свой дистрибутив.

source: **Stability**: breakage in a Flatpak application will not risk the system from breaking. This is because Flatpak applications and runtimes are contained to not interfere with the system altogether.
pt_br: **Estabilidade**: a quebra em um aplicativo Flatpak não colocará o sistema em risco. Isso ocorre porque os aplicativos e os runtimes do Flatpak estão contidos para não interferir completamente no sistema.
ru: **Стабильность**: сбой в приложении Flatpak не приведет к сбою системы. Это связано с тем, что приложения и среды выполнения Flatpak полностью не мешают работе системы.

source: **Rootless install**: elevated privileges are not required when installing a Flatpak application or a runtime.
pt_br: **Instalação sem ser root**: privilégios elevados não são necessários ao instalar um aplicativo Flatpak ou um runtime.
ru: **Установка без рута**: повышенные привилегии не требуются при установке приложения Flatpak или среды выполнения.

source: **Sandboxed applications**: one of Flatpak's main goals is to increase the security of desktop systems by isolating applications from one another. This is achieved using sandboxing and means that, by default, applications that are run with Flatpak have limited access to the host environment.
pt_br: **Aplicativos em área isolada**: um dos principais objetivos do Flatpak é aumentar a segurança dos sistemas de desktop isolando os aplicativos uns dos outros. Isso é feito usando "sandboxing" e significa que, por padrão, os aplicativos executados com Flatpak têm acesso limitado ao ambiente do host.
ru: **Приложения в песочнице**: одна из основных целей Flatpak — повысить безопасность настольных систем за счет изоляции приложений друг от друга. Это достигается с помощью песочницы и означает, что по умолчанию приложения, работающие с Flatpak, имеют ограниченный доступ к среде хоста.

source: Flatpak has some major advantages over other universal approaches to distributing applications on Linux:
pt_br: O Flatpak tem algumas vantagens importantes sobre outras abordagens universais para distribuir aplicativos no Linux:
ru: Flatpak имеет ряд существенных преимуществ перед другими универсальными подходами к распространению приложений в Linux:

source: **Decentralized by design**: while Flatpak does provide a centralized service for distributing applications, it also allows decentralized hosting and distribution, so that application developers or downstreams can host their own applications and application repositories.
pt_br: **Descentralizado por design**: embora o Flatpak forneça um serviço centralizado para distribuição de aplicativos, ele também permite hospedagem e distribuição descentralizada, para que desenvolvedores de aplicativos ou downstreams possam hospedar seus próprios aplicativos e repositórios de aplicativos.
ru: **Децентрализованный по дизайну**: хотя Flatpak предоставляет централизованный сервис для распространения приложений, он также допускает децентрализованный хостинг и распространение, так что разработчики приложений или их подчиненные могут размещать свои собственные приложения и репозитории приложений.

source: **Desktop integration**: Flatpak also offers native integration for the main Linux desktops, so that users can easily browse, install, run and use Flatpak applications through their existing desktop environment and tools.
pt_br: **Integração de desktop**: Flatpak também oferece integração nativa para os principais desktops Linux, para que os usuários possam facilmente navegar, instalar, executar e usar aplicativos Flatpak por meio de seu ambiente de desktop e ferramentas existentes.
ru: **Интеграция с рабочим столом**: Flatpak также предлагает встроенную интеграцию с основными рабочими столами Linux, так что пользователи могут легко просматривать, устанавливать, запускать и использовать приложения Flatpak через существующую среду рабочего стола и инструменты.
