Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/introduction.po
Languages: de, fr, ko, pt_br, ru, zh_hans_cn

source: Introduction to Flatpak
de: Einführung in Flatpak
fr: Introduction à Flatpak
ko: 플랫팩 개요
pt_br: Introdução ao Flatpak
ru: Введение в Flatpak
zh_hans_cn: Flatpak简介

source: Flatpak is a technology for building, distributing, installing and running applications. It is primarily targeted at the Linux desktop, although it can also be used as the basis for application distribution in other contexts, such as embedded systems.
de: Flatpak ist eine Technologie zum Erzeugen, Verteilen, Installieren und Ausführen von Anwendungen. Es ist vorrangig auf den Linux-Desktop ausgerichtet, allerdings kann es ebenso als Basis für die Applikationsverteilung in anderen Kontexten, wie eingebetteten Systemen, verwendet werden.
fr: Flatpak est une technologie pour construire, distribuer, installer et exécuter des applications. Elle adresse principalement les environnements de bureaux Linux, néanmoins elle peut également être utilisée comme base de distribution d'applications dans d'autres contextes, comme les systèmes embarqués.
ko: 플랫팩은 응용프로그램을 빌드하고, 배포하고, 설치하고, 실행하기 위한 기술이다. 플랫팩의 주 사용환경은 리눅스 데스크톱이지만, 임베디드 시스템과 같은 여타 환경에서 응용프로그램을 배포하기 위한 기반으로 사용하는 것도 가능하다.

source: Flatpak has been designed and implemented with a number of goals:
de: Flatpak ist konzipiert und implementiert mit einer Anzahl von Zielen:
fr: Flatpak a été conçu et mis en œuvre avec un nombre de buts:
ko: 다음과 같은 목적을 달성하기 위하여 플랫팩을 설계하고 구현하였다:

source: Allow applications to be installed on any Linux distribution.
de: Erlaube Anwendungen auf jeder Linux-Distribution installiert zu werden.
fr: Autoriser les applications a être installées sur n'importe quelle distribution Linux.
ko: 응용프로그램이 어떤 리눅스 배포판에서도 설치될 수 있도록 한다.

source: Provide consistent environments for applications, to facilitate testing and reduce bugs.
de: Bereitstellung konsistenter Umgebungen für Anwendungen, um Testverfahren zu erleichtern und Bugs zu reduzieren.
fr: Fournir des environnements cohérents pour les applications, pour faciliter les tests et réduire les bogues.
ko: 일관된 실행환경을 제공하여 버그를 줄이고, 테스팅을 돕는다.

source: Decouple applications from the operating system, so that applications don't depend on specific versions of each distribution.
de: Entkopplung der Anwendungen vom Betriebssystem, so dass diese nicht abhängig sind von spezifischen Versionen der jeweiligen Distribution.
fr: Découpler les applications du système d'exploitation, ainsi les applications ne dépendent pas d'une version spécifique de chaque distribution.
ko: 응용프로그램과 운영체제를 분리하여 응용프로그램이 배포판 또는 버전에 종속되지 않도록 한다.

source: Allow applications to bundle their own dependencies, so that they can use libraries that aren't provided by a Linux distribution, and so they can depend on specific versions or even patched versions of a library.
de: Anwendungen soll es erlaubt sein, ihre eigenen Abhängigkeiten zu bündeln, so dass sie Bibliotheken nutzen können, die seitens der Linux-Distribution nicht zur Verfügung gestellt werden. Somit können sie auch von spezifischen oder sogar gepatchten Versionen einer Bibliothek abhängig sein.
fr: Permet aux applications de fournir leurs propres dépendences, ainsi ils peuvent utiliser des bibliothèques qui ne sont pas fournies par une distribution Linux, et dépendre de versions spécifiques voire même de versions patchées d'une bibliothèque.
ko: 응용프로그램 실행에 필요한 자원을 함께 묶어, 리눅스 배포판이 제공하지 않는 특정 라이브러리 버전, 패치된 버전 등을 활용할 수 있도록 한다.

source: Increase the security of Linux desktops, by isolating applications in sandboxes.
de: Erhöhung der Sicherheit von Linux-Desktops durch die Isolierung von Anwendungen in Sandboxen.
fr: Augmenter la sécurité des environnements de bureau Linux, en isolant les applications dans des bacs à sable.
ko: 샌드박스를 통해 응용프로그램을 격리하여 리눅스 데스크톱의 보안성을 높인다.

source: More information about Flatpak can be found on `flatpak.org <http://flatpak.org/>`_.
de: Mehr Informationen über Flatpaks können auf `flatpak.org <http://flatpak.org/>`_ gefunden werden.
fr: Plus d'informations à propos de Flatpak peuvent être trouver sur `flatpak.org <http://flatpak.org/>`_.
ko: 플랫팩에 관한 더 많은 정보는 `flatpak.org <http://flatpak.org/>`_에서 얻을 수 있다.

source: How it works
de: Funktionsweise
fr: Comment cela fonctionne
ko: 어떻게 동작하는가

source: Flatpak can be understood through a small number of key concepts. These also help to explain how it differs from traditional software packages.
de: Flatpak kann verstanden werden mittels einer kleinen Zahl von Schlüsselkonzepten. Diese helfen auch zu erklären, wie es sich von traditionellen Softwarepaketen unterscheidet.
fr: Flatpak peut être compris à travers un petit nombre de concepts-clés. Ils aident aussi à expliquer comment il diffère des paquets logiciel traditionnels.
ko: 플랫팩을 이해하기 위해 살펴봐야 할 몇 가지 핵심 개념이 있다. 이를 통해 플랫팩이 전통적인 소프트웨어 패키지와 어떻게 다른 지 알 수 있다.

source: Runtimes
de: Runtimes (Laufzeitumgebungen)
ko: 런타임

source: Runtimes provide the basic dependencies that are used by applications. Various runtimes are available, from more minimal (but more stable) Freedesktop runtimes, to larger runtimes produced by desktops like GNOME or KDE. (See :doc:`available-runtimes` for an overview of the runtimes that are currently available.)
ko: 런타임(실행환경, runtime)은 응용프로그램이 사용하는 기본적인 의존성을 제공한다. 최소한의 크기를 가진 (하지만 안정적인) Freedesktop 런타임부터 GNOME이나 KDE 데스크톱 런타임에 이르기까지 다양한 런타임들을 사용해 볼 수 있다(:doc:`사용 가능한 런타임들`은 현재 사용 가능한 런타임들의 개요를 제공한다).

source: Each application must be built against a runtime, and this runtime must be installed on a host system in order for the application to run. Users can install multiple different runtimes at the same time, including different versions of the same runtime.
de: Jede Applikation muss gegen eine Laufzeitumgebung erzeugt werden. Als Voraussetzung für eine ausführbare Anwendung, muss die Laufzeitumgebung auf einem Hostsystem installiert sein. Benutzer können mehrere unterschiedliche Runtimes gleichzeitig installieren, ebenso verschiedene Versionen der gleichen Laufzeitumgebung.
fr: Chaque application doit être construite à l'aide d'un runtime, et ce runtime doit être installé sur le système hôte afin que l'application se lance. Les utilisateurs peuvent installer plusieurs différents runtime en même temps, ainsi que différentes versions du même runtime.
ko: 각 응용프로그램은 런타임별로 빌드되므로, 해당 응용프로그램 실행을 위해서는 그에 맞는 런타임을 설치해야 한다. 사용자들은 여러 종류, 다른 버전의 런타임을 동시에 설치할 수 있다.

source: Each runtime can be thought of as a ``/usr`` filesystem. Indeed, when an application is run, its runtime is mounted at ``/usr``.
de: Jede Runtime kann man sich als ``/usr``-Dateisystem vorstellen. Und tatsächlich, wenn eine Applikation läuft, wird seine Laufzeitumgebung unter ``/usr`` eingehangen.
fr: Chaque runtime peut être vu comme un système de fichiers ``/usr``. En effet, quand une application est exécutée, son runtime est monté dans ``/usr``.
ko: 각 런타임을 하나의 ``/usr`` 파일 시스템으로 보면 된다. 사실 응용프로그램 하나를 실행하면, 그에 해당하는 런타임이 ``/usr`` 에 마운트된다.

source: Bundled libraries
de: Gebündelte Bibliotheken
fr: Bibiothèques empaquetées
ko: 라이브러리 번들

source: If an application requires any dependencies that aren't in its runtime, they can be bundled along with the application itself. This allows applications to use dependencies that aren't available in a distribution, or to use a different version of a dependency from the one that's installed on the host.
de: Wenn eine Anwendung Voraussetzungen benötigt, die nicht in seiner Laufzeitumgebung zur Verfügung stehen, können diese mit der Anwendung selbst gebündelt werden. Dies erlaubt es, Anwendungen Abhängigkeiten zu verwenden, die innerhalb einer Distribution nicht vorhanden sind. Ebenso kann eine andere Version einer Abhängigkeit verwendet werden, als diejenige, die auf dem Host-System installiert ist.
fr: Si une application requiert des dépendances qui n'est pas dans son runtime, elles peuvent intégrées au côté de l'application. Cela permet aux application d'utiliser des dépendences qui ne sont pas disponibles dans une distribution, ou d'utiliser une version différente de celle qui est installé sur l'hôte.
ko: 어떤 응용프로그램이 런타임에 존재하지 않는 파일들에 의존하고 있다면, 해당 파일과 응용프로그램을 같이 번들로 묶을 수 있다. 이러한 방법을 사용하면 특정 배포판에서 제공되지 않거나 설치된 버전과는 다른 버전의 파일에 의존적인 응용프로그램도 배포할 수 있다.

source: Sandboxes
de: Sandboxen
fr: Bacs à sable
ko: 샌드박스

source: With Flatpak, each app is built and run in an isolated environment. By default, the application can only 'see' itself and its runtime. Access to user files, network, graphics sockets, subsystems on the bus and devices have to be explicitly granted. (As will be described later, Flatpak provides several ways to do this.) Access to other things, such as other processes, is deliberately not possible.
de: Mit Flatpak wird jede App in einer isolierten Umgebung erzeugt und ausgeführt. Standardmäßig kann die Anwendung lediglich sich selbst und seine Runtime "sehen". Zugriff auf Benutzerdateien, Netzwerk, Grafik-Sockets, Subsysteme auf dem Bus und auf Geräte müssen explizit erlaubt werden. (Flatpak bietet hierzu verschiedene Wege, wie noch später beschrieben wird.) Zugriff auf andere Dinge, wie andere Prozesse, ist bewusst nicht möglich.
fr: Avec Flatpak, chaque application est construite et lancer dans un environnement isolé. Par défaut, l'application peut uniquement se "voir" elle-même et ses runtimes. L'accès aux fichiers utilisateurs, au réseau, aux sockets graphiques, aux sous-systèmes sur le bus et aux périphériques doit être explicitement permis. (Comme vous le verrez plus tard, Flatpak fournit plusieurs façons de faire cela.) L'accès à d'autres éléments, comme les autres processus, est délibéremment impossible.
ko: 각 응용프로그램(app, 앱)은 격리된 환경에서 빌드되고 실행된다. 기본적으로 응용프로그램은 자기 자신과 런타임만 볼 수 있다. 사용자 파일, 네트워크, 그래픽스 소켓, 버스 상의 서브시스템, 장치 등에 대한 접근은 명시적으로 허용되는 경우에만 가능하다. (이후에 다시 설명하겠지만, 이를 위해 플랫팩에 제공하는 몇 가지 방법이 있다. 다른 프로세스 등 다른 자원에 대한 접근은 의도적으로 금지되어 있다.

source: By necessity, some resources that are inside the sandbox need to be exposed outside, to be used by the host system. These are known as "exports", since they are files that are exported out of the sandbox, and include things like the application's ``.desktop`` file and icon.
ko: 일부 샌드박스 내의 자원들은 호스트 시스템이 사용할 수 있도록 외부로 내보낼(export) 필요가 있다.

source: Portals
ko: 포털

source: Portals are a mechanism through which applications can interact with the host environment from within a sandbox. In this way, they give additional abilities to interact with data, files and services without the need to add sandbox permissions.
ko: 포털은 샌드박스 내의 응용프로그램이 호스트 환경과 상호작용하기 위한 메커니즘이다. 이를 통해 샌드박스에 권한을 허용하지 않고도 데이터, 파일, 서비스 등과 상호작용할 수 있다.

source: Interface toolkits can implement transparent support for portals. If an application uses one of these toolkits, there is no additional work required to access them.
ko: 인터페이스 도구들은(Interface toolkits) 포털을 투명하게 지원한다. 응용프로그램은 이들 도구를 활용함에 있어서 접근 허용과 같은 추가적인 작업을 하지 않아도 된다.

source: Examples of capabilities that can be accessed through portals include:
ko: 포탈을 통해 접근 가능한 capability들을 예로 들면:

source: Inhibit the user session from ending, suspending, idling or getting switched away
ko: 사용자 세션의 종료, 정지, 대기, 이탈 금지

source: Network status information
ko: 네트워크 상태 정보

source: Notifications
ko: 알림

source: Open a URI
ko: URI 열기

source: Open files with a native file chooser dialog
ko: 내장된 (native) 파일 선택 다이얼로그로 파일 열기

source: Printing
ko: 인쇄

source: Screenshots
ko: 화면 갈무리

source: Applications that aren't using a toolkit with support for portals can refer to the `xdg-desktop-portal API documentation <http://flatpak.org/xdg-desktop-portal/portal-docs.html>`_ for information on how to access them.
ko: 포탈을 지원하는 도구를 사용하지 응용프로그램들은 `xdg-desktop-portal API 문서<http://flatpak.org/xdg-desktop-portal/portal-docs.html>`_ 을 참조하여 포탈에 접근한다.

source: The flatpak command
de: Das ``flatpak``-Kommando
fr: La commande flatpak
ko: 플랫팩 명령

source: ``flatpak`` is the command that is used to find, install and remove applications. ``flatpak --help`` provides a full list of available commands.
ko: ``flatpak`` 은 런타임과 응용프로그램을 검색, ,설치, 삭제하는 명령이다. ``flatpak —help`` 를 입력하면 사용가능한 명령어들이 나열된다.

source: Most flatpak commands are performed system-wide by default. To perform a command for the current user only, use the ``--user`` option. This allows runtimes and application bundles to be installed per-user, for instance.
de: Die meisten Flatpak-Kommandos werden standardmäßig systemweit ausgeführt. Um einen Befehl nur für den aktuellen Benutzer auszuführen, wird die ``--user``-Option verwendet. Dies erlaubt es bspw. Runtimes und Anwendungspakete pro Benutzer zu installieren.
fr: La plupart des commandes flatpak sont effectuées au niveau système par défaut. Pour effectuer une commande au niveau utilisateur uniquement, utilisez l'option ``--user``. Cela permet aux paquets applicatifs et runtime d'être installé par utilisateur, par exemple.
ko: 대부분의 플랫팩 명령은 기본적으로 시스템 전체에 대하여 실행된다. 현재 사용자만을 대상으로 명령을 실행하기 위해서는 ``—user`` 옵션을 사용할 수 있다. 이 옵션을 사용할 경우 런타임과 응용프로그램 번들이 사용자 별로 설치된다.

source: For more information on flatpak commands, see the :doc:`flatpak-command-reference`
ko: 플랫팩 명령어에 관한 더 많은 정보는 :doc:`플랫팩 명령어 레퍼런스`를 참조

source: Identifiers
de: Identifier (Bezeichner)
fr: Identifiants
ko: 식별자

source: Flatpak identifies each application, runtime and SDK using a unique name, which is sometimes used as part of a name/arch/branch triple.
de: Flatpak identifiziert jede Applikation, Runtime und SDK durch die Verwendung eines eindeutigen Namens, welcher manchmal als Teil eines `name/arch/branch`-Tripels verwendet wird.
fr: Flatpak identifie chaque application, runtime et SDK à l'aide de son nom unique, qui est parfois utilisé de la manière d'un triplet nom/architecture/branche.
ko: 플랫팩은 각 응용프로그램, 런타임, SDK에 유일한 이름을 부여하고 식별한다. 이는 종종 name/arch/branch 트리플 쌍의 일부로 사용한다.

source: Naming
de: Namensgebung
fr: Nommage
ko: 명명(naming) 형식

source: Flatpak names take the form of an inverse DNS address, such as ``com.company.App``. The final segment of this address is the object's name, and the preceding part is the domain that it belongs to. In order to prevent name conflicts, this domain should correspond to a DNS registered address. This means using a domain from a website, either for an application or an organization. For instance, if application ``App`` has its own website at ``app.com``, its Flatpak name would be ``com.app.App``. Multiple applications can belong to the same domain, such as ``org.organization.App1`` and ``org.organization.App2``.
de: Die Namensvergabe für Flatpaks erfolgt in der Form einer inversen DNS-Adresse, wie ``com.company.App``. Das finale Segment dieser Adresse ist der Objektname und der vorhergehende Part ist die Domain, zu der dieser zugehörig ist. Um Namenskonflikte zu vermeiden, sollte diese Domain mit einer registrierten DNS-Adresse korrespondieren. Das bedeutet, die Domain einer Website zu verwenden, entweder für eine Anwendung oder eine Organisation. Zum Beispiel, wenn die Applikation ``App`` ihre eigene Website ``app.com`` hat, würde ihr Flatpakname ``com.app.App`` lauten. Mehrere Applikationen können derselben Domain zugehörig sein, so wie ``org.organization.App1`` und ``org.organization.App2``.
fr: la nomenclature Flatpak prend la forme d'une adresse DNS inversée, comme ``com.entreprise.Application``. Le segment final de cette adresse est le nom de l'objet, and la partie précédente est le domain auquel elle appartient. Afin d'éviter les conflits de nom, ce domaine doit correspondre à une adresse DNS enregistrée. Cela signifie utiliser un domain d'une site web, soit pour une application ou une organisation. Par exemple, si une application ``App`` a son propre site web à ``app.com``, son nom Flatpak serait ``com.app.App``. Plusieurs applications peuvent appartenir au même domaine, comme ``org.organization.App1`` et ``org.organization.App2``.
ko: 플랫팩 이름의 형식은 역 DNS 주소 방식, 즉 ``com.company.App`` 와 같이 객체가 속한 도메인을 큰 도메인 에서 작은 도메인 순서로 쓰고, 마지막에 객체의 이름을 적는 방식을 사용한다. 이름 사이의 충돌을 막기 위해 도메인은 응용프로그램이나 조직의 주소로 DNS에 등록된 도메인을 사용한다. 예를 들면, 응용프로그램 ``App`` 이 고유의 웹사이트 ``app.com`` 를 가진 경우, 플랫팩 이름은 ``com.app.App`` 이다. 복수의 응용프로그램이 동일한 도메인에 속할 수 있다. 예를 들면 ``org.organization.App1`` 과 ``org.organization.App2`` 가 존재할 수 있다.

source: If you do not have a registered domain for your application, it is easy to use a third party website to get one. For example, Github allows the creation of personal pages that can be used for this purpose. Here, a personal namespace of ``name.github.io`` could be used as the basis of application identifier ``io.github.name.App``.
de: Wenn man keine registrierte Domain für seine Anwendung besitzt, ist es sehr einfach hierzu eine Website von Drittanbietern zu verwenden. Zum Beispiel erlaubt GitHub die Erstellung von persönlichen Seiten, die für diesen Zweck genutzt werden können. Somit könnte hier ein persönlicher Namensraum von ``name.github.io`` verwendet werden, als Basis des Applikationsbezeichners ``io.github.name.App``.
fr: Si vous n'avez pas un domaine enregistré pour votre application, il est facile d'utiliser le site d'une tierce-partie pour en avoir un. Par exemple, Github permet la création de pages personnelles qui peuvent être utilisées pour ce but. Ainsi, un espace de nom personnel ``name.github.io`` peut être utilisé comme base de l'identifiant de l'application ``io.github.name.App``.
ko: 응용프로그램을 위해 등록한 도메인이 없을 경우, 웹페이지를 제공하는 제 3의 웹사이트를 사용하면 된다. 예를 들면, Github은 개인 페이지를 생성할 수 있도록 지원한다. Github에서 생성한 개인 페이지가 ``name.github.io`` 라면, 이를 네임스페이스로 이용하여 ``io.github.name.App`` 와 같이 응용프로그램 식별자의 바탕이 되는 도메인으로 사용가능하다.

source: If an application provides a D-Bus service, the D-Bus service name is expected to be the same as the application name.
de: Wenn eine Applikation einen D-Bus-Dienst bereitstellt, so wird erwartet, dass der Name des D-Bus-Dienstes der gleiche ist wie der Name der Applikation.
fr: Quand une application fournit un service D-Bus, on s'attend que le nom de service D-Bus doit être le même que le nom d'application.
ko: 응용프로그램이 D-Bus 서비스를 제공할 경우, D-Bus 서비스 이름이 응용프로그램 이름과 같다고 보면 된다.

source: Identifier triples
de: Tripel-Bezeichner
fr: Triplets identifiants
ko: 식별자 트리플

source: Many flatpak commands only require the name of an application, runtime or SDK. However, in some circumstances it is also necessary to specify the architecture and branch (branches allow a particular version to be specified). This is done using a name/arch/branch triple. For example: ``org.gnome.Sdk/x86_64/3.14`` or ``org.gnome.Builder/i386/master``.
de: Viele Kommandos unter Flatpak benötigen lediglich den Namen einer Applikation, der Runtime oder des SDK. Jedoch ist es unter einigen Umständen notwendig die Architektur und den Zweig (Branch) zu spezifizieren (Zweige erlauben es eine bestimmte Version zu spezifizieren). Dies wird unter Verwendung eines `name/architecture/branch`-Tripels durchgeführt. Zum Beispiel ``org.gnome.Sdk/x86_64/3.14`` oder ``org.gnome.Builder/i386/master``.
fr: Beaucoup de commandes flatpak requiert uniquement le nom d'une application, d'un runtime ou d'un SDK. Néanmoins, dans certaines circonstances il est également nécessaire de spécifier l'architecture et la branche (Les branches permettent de spécifier une version particulière). Cela est fait en utilisant un triplet nom/architecture/branch. Par exemple: ``org.gnome.Sdk/x86_64/3.14`` ou ``org.gnome.Builder/i386/master``.
ko: 플랫팩 명령을 실행할 때 명령어 라인 매개변수로 응용프로그램 이름, 런타임, SDK 중 하나를 입력하는 경우가 많다. 하지만 어떤 경우에는 아키텍처나 브랜치를 명시하거나 특정 버전을 지정해 줄 필요가 있다. 이럴 때 name/arch/branch 트리플을 이용하면, ``org.gnome.Sdk/x86_64/3.14`` 또는 ``org.gnome.Builder/i386/master`` 와 같이 지정할 수 있다.

source: Under the hood
de: Unter der Haube
fr: Sous le capot
ko: 플랫팩을 이루는 기술 (Under the hood)

source: Flatpak uses a number of pre-existing technologies. It generally isn't necessary to be familiar with these in order to use Flatpak, although in some cases it might be useful. They include:
de: Flatpak verwendet eine Anzahl von bereits existierenden Technologien. Es ist normalerweise nicht notwendig, mit diesen vertraut zu sein, um mit Flatpaks zu arbeiten – wobei es in einigen Fällen nützlich sein kann. Diese beinhalten:
fr: Flatpak utilise un nombre de technologies déjà existantes. Il n'est généralement pas nécessaire d'être familier avec celles-ci pour utiliser Flatpak, néanmoins dans certains cas cela peut-etre utile. Elles inclues:
ko: 플랫팩은 몇 가지 기존 기술을 이용한다. 보통은 플랫팩이 이용하는 기술들을 자세히 알아야 할 필요는 없지만, 알고 있으면 유용할 수 있다. 플랫팩이 사용하는 기술들은 다음과 같다:

source: The `bubblewrap <https://github.com/projectatomic/bubblewrap>`_ utility from `Project Atomic <http://www.projectatomic.io/>`_, which lets unprivileged users set up and run containers, using kernel features such as:
de: Das `bubblewrap <https://github.com/projectatomic/bubblewrap>`_-Utility von `Projet Atomic <http://www.projectatomic.io/>`_, welches es unprivilegierten Benutzern ermöglicht, Container aufzusetzen und auszuführen. Dabei werden Kernelfeatures verwendet wie:
fr: L'utilitaire `bubblewrap <https://github.com/projectatomic/bubblewrap>`_ de `Projet Atomic <http://www.projectatomic.io/>`_, qui laisse les utilisateurs non-privilégies créer et lanceur des conteneurs, à l'aide des fonctions noyau tels que:
ko: `버블랩(bubblewrap) <https://github.com/projectatomic/bubblewrap>`_ 유틸리티는 `아토믹 프로젝트(Project Atomic) <http://www.projectatomic.io/>`_, 의 일부로서, 관리자 권한을 가지지 않은 일반 사용자 (unprivileged users) 들이 콘테이너를 설정하고 실행할 수 없도록 한다. 버블랩은 또한 다음과 같은 커널 기능을 사용한다:

source: Namespaces
de: Namespaces (Namensräume)
fr: Espaces de nom
ko: 네임스페이스(Namespaces)

source: Bind mounts
ko: Bind 마운트

source: Seccomp rules
de: Seccomp-Regeln
fr: Règles seccomp
ko: Seccomp 규칙

source: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_ to set up cgroups for sandboxes
de: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_ zum Erstellen von Cgroups für Sandboxen
fr: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_ pour définir les groupes de contrôle pour les bacs à sable
ko: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_를 이용하여 샌드박스를 위한 cgroup 설정

source: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, a well-established way to provide high-level APIs to applications
de: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, eine fest etablierte Möglichkeit Highlevel-APIs für Applikationen bereitzustellen
fr: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, une méthode bien établie pour fournir des API haut-niveaux aux applications
ko: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, 응용프로그램을 위해 고수준 API를 잘 정의된 (well-established) 방법으로 전달

source: The OCI format from the `Open Container Initiative <https://www.opencontainers.org/>`_, as a convenient transport format for single-file bundles
de: Das OCI-Format der `Open Container Initiative <https://www.opencontainers.org/>`_, als ein geeignetes Transportformat für Einzeldateipakete
fr: Le format OCI de l'`initiative Open Container <https://www.opencontainers.org/>`_ comme un format de transport pratique pour les paquets en un seul fichier
ko: `Open Container Initiative <https://www.opencontainers.org/>`_의 OCI 형식, 단일 파일 묶음(single-file bundles)의 전송형식으로 사용

source: The `OSTree <https://ostree.readthedocs.io/en/latest/>`_ system for versioning and distributing filesystem trees
de: Das `OSTree <https://ostree.readthedocs.io/en/latest/>`_-System für die Versionierung und Verteilung von Dateisystembäumen
fr: Le système `OSTree <https://ostree.readthedocs.io/en/latest/>`_ pour le versionnage et la distribution d'arborescence de systèmes de fichers.
ko: `OSTree <https://ostree.readthedocs.io/en/latest/>`_ 시스템을 사용하여 파일 시스템 트리 구조 버전을 기록하고 배포
