Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/manifests.po
Languages: ko, pt_br, ru, zh_cn

source: Manifests
ko: Manifest 파일들
pt_br: Manifestos
ru: Манифесты
zh_cn: 清单

source: The input to ``flatpak-builder`` is a JSON or YAML file that describes the parameters for building an application, as well as instructions for each of the modules that are to be built. This file is called the manifest.
ru: Входными данными для ``flatpak-builder`` является файл JSON или YAML, который описывает параметры для создания приложения, а также инструкции для каждого из модулей, которые должны быть построены. Этот файл называется манифестом.

source: This page provides information and guidance on how to use manifests, including an explanation of the most common parameters that can be specified. It is recommended to have followed the :doc:`first-build` tutorial before reading this section, and to be familiar with :doc:`flatpak-builder`.
pt_br: Esta página fornece informações e orientações sobre como usar manifestos, incluindo uma explicação dos parâmetros mais comuns que podem ser especificados. Recomenda-se ter seguido o tutorial :doc:`first-build` antes de ler esta seção e estar familiarizado com :doc:`flatpak-builder`.
ru: На этой странице представлена информация и руководство по использованию манифестов, включая объяснение наиболее общих параметров, которые можно указать. Перед чтением этого раздела рекомендуется ознакомиться с руководством в :doc:`first-build` и ознакомиться с :doc:`flatpak-builder`.
zh_cn: 这个页面提供了如何使用清单文件的信息和指南，包括需要指定的最常用参数的详解。读这一章节之前要求已经学习过 :doc:`first-build` 并且熟悉 :doc:`flatpak-builder` 。

source: Manifest files should be named using the application ID. For example, the manifest file for GNOME Dictionary is named ``org.gnome.Dictionary.yml``. This page uses this manifest file for all its examples.
ru: Файлы манифеста должны получить названия с использованием идентификатора приложения. Например, файл манифеста для словаря GNOME называется ``org.gnome.Dictionary.yml``. Эта страница использует этот файл манифеста, для всех своих примеров.

source: A complete list of all the properties that can be specified in manifest files can be found in the :doc:`flatpak-builder-command-reference`, as well as the ``flatpak-manifest`` man page.
pt_br: Uma lista completa de todas as propriedades que podem ser especificadas nos arquivos de manifesto pode ser encontrada na :doc:`flatpak-builder-command-reference`, bem como na página do manual ``flatpak-manifest``.
ru: Полный список всех свойств, которые могут быть указаны в файлах манифеста, можно найти в :doc:`flatpak-builder-command-reference`, а также на странице руководства``flatpak-manifest``.
zh_cn: 一个完整的属性列表可以在清单文件中指明，可以在 :doc:`flatpak-builder-command-reference` 和 ``flatpak-manifest`` 找到。

source: Basic properties
pt_br: Propriedades básicas
ru: Основные свойства
zh_cn: 基本属性

source: For example, the GNOME Dictionary manifest includes:
pt_br: Por exemplo, o manifesto do Dicionário do GNOME inclui:
ru: Например, манифест GNOME Dictionary включает:
zh_cn: 举个例子，GNOME Dictionary的清单文件包含：

source: Specifying a runtime and runtime version allows that the runtime that is needed by your application to be automatically installed on users' systems.
pt_br: A especificação de um runtime e sua versão permite que o runtime necessário ao seu aplicativo seja instalado automaticamente nos sistemas dos usuários.
ru: Указание среды выполнения и версии среды выполнения позволяет автоматически устанавливать среду выполнения, необходимую для вашего приложения, в пользовательских системах.
zh_cn: 指明runtime和runtime版本可以在用户的系统上自动安装你的应用需要的运行时。

source: File renaming
ko: 파일 재명명
pt_br: Renomeação de arquivo
ru: Переименование файла
zh_cn: 文件重命名

source: Exports are application files that are made available to the host, and include things like the application's ``.desktop`` file and icon.
ru: Экспорт - это файлы приложения, которые доступны хосту, и включают такие вещи, как файл и значок приложения .desktop.

source: The names of files that are exported by a Flatpak must be prefixed using the application ID, such as ``org.gnome.Dictionary.desktop``. The best way to do this is to rename these files directly in the application's source.
ru: Имена файлов, экспортируемых Flatpak, должны иметь префикс с использованием идентификатора приложения, например ``org.gnome.Dictionary.desktop``. Лучший способ сделать это - переименовать эти файлы прямо в папке приложения.

source: If renaming exported files to use the application ID is not possible, ``flatpak-builder`` allows them to be renamed as part of the build process. This can be done by specifying one of the following properties in the manifest:
pt_br: Se não for possível renomear arquivos exportados para usar o ID do aplicativo, o ``flatpak-builder`` permitirá que eles sejam renomeados como parte do processo de compilação. Isso pode ser feito especificando uma das seguintes propriedades no manifesto:
ru: Если переименование экспортируемых файлов для использования идентификатора приложения невозможно, ``flatpak-builder`` позволяет их переименовывать в процессе сборки. Это можно сделать, указав одно из следующих свойств в манифесте:
zh_cn: 如果无法使用应用ID重命名导出文件， ``flatpak-builder`` 允许在构建过程中重命名。可以通过在清单文件中指明下面的属性来实现：

source: ``rename-icon`` - rename the application icon
pt_br: ``rename-icon`` – renomeia o ícone do aplicativo
ru: ``rename-icon`` - переименовать значок приложения
zh_cn: ``rename-icon`` - 重命名应用图标

source: ``rename-desktop-file`` - rename the ``.desktop`` filename
pt_br: ``rename-desktop-file`` – renomeia o arquivo ``.desktop``
ru: ``rename-desktop-file`` - переименовать имя файла ``.desktop``
zh_cn: ``rename-desktop-file`` - 重命名 ``.desktop`` 文件

source: Each of these properties accepts the name of the source file to be renamed. ``flatpak-builder`` then automatically renames the file to match the application ID. Note that this renaming method can introduce internal naming conflicts, and that renaming files in tree is therefore the most reliable approach.
pt_br: Cada uma dessas propriedades aceita o nome do arquivo de origem a ser renomeado. ``flatpak-builder`` renomeia automaticamente o arquivo para corresponder ao ID do aplicativo. Observe que esse método de renomeação pode introduzir conflitos de nomenclatura internos e que renomear arquivos na árvore é, portanto, a abordagem mais confiável.
ru: Каждое из этих свойств принимает имя исходного файла, который нужно переименовать. Затем ``flatpak-builder`` автоматически переименовывает файл в соответствии с идентификатором приложения. Обратите внимание, что этот метод переименования может вызвать внутренние конфликты именования, и поэтому переименование файлов в дереве является наиболее надежным подходом.
zh_cn: 每个属性都可以接受源文件重命名。 ``flatpak-builder`` 会自动重命名他们以匹配应用ID。注意这种重命名方法可能产生内部命名冲突，所以在文件树中进行重命名是最可靠的方法。

source: Finishing
pt_br: Acabamento
ru: Завершение

source: Applications that are run with Flatpak have extremely limited access to the host environment by default, but applications require access to resources outside of their sandbox in order to be useful. Finishing is the build stage where the application's sandbox permissions are specified, in order to give access to these resources.
pt_br: Os aplicativos executados com o Flatpak têm acesso extremamente limitado ao ambiente host por padrão, mas os aplicativos requerem acesso a recursos fora de sua caixa de proteção para serem úteis. O acabamento é o estágio de compilação em que as permissões do sandbox do aplicativo são especificadas, a fim de dar acesso a esses recursos.
ru: Приложения, которые запускаются с Flatpak, по умолчанию имеют чрезвычайно ограниченный доступ к среде хоста, но приложениям требуется доступ к ресурсам за пределами их песочницы, чтобы быть полезными. Завершение - это этап сборки, на котором указываются разрешения песочницы приложения для предоставления доступа к этим ресурсам.
zh_cn: flatpak应用默认运行在很有限的主机环境里面，但是应用需要访问沙箱之外的资源。finishing是用于指明应用沙箱权限的一步，用于访问外界资源。

source: The finishing manifest section uses the ``finish-args`` property, which can be seen in the Dictionary manifest file:
pt_br: A seção de manifesto de acabamento usa a propriedade ``finish-args``, que pode ser vista no arquivo de manifesto do Dicionário:
ru: Раздел манифеста окончательной обработки использует свойство ``finish-args``, которое можно увидеть в файле манифеста словаря:
zh_cn: finishing清单节点使用 ``finish-args`` 属性，可以在Dictionary的清单文件见到：

source: Cleanup
ko: 마무리 정리(Cleanup)
pt_br: Limpeza
ru: Очистка

source: First, a list of filename patterns can be included::
ru: Во-первых, можно включить список шаблонов имен файлов::

source: Modules
pt_br: Módulos
ru: Модули
zh_cn: 模块

source: The module list specifies each of the modules that are to be built as part of the build process. One of these modules is the application itself, and other modules are dependencies and libraries that are bundled as part of the Flatpak. While simple applications may only specify one or two modules, and therefore have short modules sections, some applications can bundle numerous modules and therefore have lengthy modules sections.
pt_br: A lista de módulos especifica cada um dos módulos que devem ser compilados como parte do processo de compilação. Um desses módulos é o próprio aplicativo e outros módulos são dependências e bibliotecas que fazem parte do Flatpak. Embora aplicativos simples possam especificar apenas um ou dois módulos e, portanto, tenham seções de módulos curtos, alguns aplicativos podem agrupar vários módulos e, portanto, ter seções de módulos longas.
ru: В списке модулей указывается каждый из модулей, которые должны быть построены как часть процесса сборки. Один из этих модулей - это само приложение, а другие модули - это зависимости и библиотеки, которые входят в состав Flatpak. В то время как простые приложения могут указывать только один или два модуля и, следовательно, иметь короткие разделы модулей, некоторые приложения могут объединять множество модулей и, следовательно, иметь длинные разделы модулей.
zh_cn: 这个模块列表作为构建过程的一部分，指明了每个模块。其中一个模块是应用本身，其他的是依赖和库，作为flatpak的一部分进行绑定。当应用比较简单的时候，只有一到两个模块，因此有较短的模块节点，一些应用会有大量的模块需要绑定，因此会有较长的模块节点。

source: As can be seen, each listed module has a ``name`` (which can be freely assigned) and a list of ``sources``. Each source has a ``type``, and available types include:
pt_br: Como pode ser visto, cada módulo listado possui um ``name`` (que pode ser atribuído livremente) e uma lista de ``sources``. Cada fonte possui um ``type``, e os tipos disponíveis incluem:
ru: Как видно, у каждого указанного модуля есть ``имя`` (которое может быть присвоено произвольно) и список ``источники`` У каждого источника есть ``тип``, и доступные типы включают:
zh_cn: 可以看出，每个列出的模块有一个 ``name`` （可以自由分配）和一个 ``sources`` 列表。每个source都有一个 ``type`` ，可用的type有：

source: ``archive`` - ``.tar`` or ``.zip`` archive files
pt_br: ``archive`` – arquivos em ``.tar`` ou ``.zip``
ru: ``archive`` - ``.tar`` или ``.zip`` архивные файлы
zh_cn: ``archive`` - ``.tar`` or ``.zip`` 归档文件

source: ``git`` - Git repositories
pt_br: ``git`` – repositórios Git
ru: ``git`` - Репозитории Git
zh_cn: ``git`` - Git 仓库

source: ``bzr`` - Bazaar repositories
pt_br: ``bzr`` – repositórios Bazaar
ru: ``bzr`` - репозитории Bazaar
zh_cn: ``bzr`` - Bazaar 仓库

source: ``file`` - local/remote files (these are copied into the source directory)
ru: ``file`` - локальные/удаленные файлы (они копируются в исходный каталог)

source: ``dir`` - local directories (these are copied into the source directory)
ru: ``dir`` - локальные каталоги (они копируются в исходный каталог)

source: ``script`` - an array of shell commands (these are put in a shellscript file)
pt_br: ``script`` – um vetor de comandos shell (esses são colocados em um arquivo de script shell)
ru: ``script`` - список команд оболочки (они помещаются в файл сценария оболочки)
zh_cn: ``script`` - 一个shell命令数组（这些都被放在shell脚本文件里）

source: ``shell`` - an array of shell commands that are run during source extraction
pt_br: ``shell`` – um vetor de comandos shell que são executados durante a extração do fonte
ru: ``shell`` - массив команд оболочки, которые запускаются во время извлечения исходного кода
zh_cn: ``shell`` - 再源码抽取期间运行的一组shell命令

source: ``patch`` - a patch (are applied to the source directory)
pt_br: ``patch`` – um patch (são aplicados ao diretório fonte)
ru: ``patch`` - патч (применяются к исходному каталогу)
zh_cn: ``patch`` - 补丁（用于源代码目录）

source: ``extra-data`` - data that can be downloaded at install time; this can include archive or package files
pt_br: ``extra-data`` – dados que podem ser baixados em tempo de instalação; esto pode incluir um arquivo compactado ou arquivos de pacote
ru: ``extra-data`` - данные, которые можно загрузить во время установки; может включать архивные или пакетные файлы
zh_cn: ``extra-data`` - 在安装时下载的数据；可以包含归档文件或者package文件

source: Supported build systems
pt_br: Suporte a sistemas de compilação
ru: Поддерживаемые системы сборки
zh_cn: 受支持的构建系统

source: Modules can be built with a variety of build systems, including:
pt_br: Os módulos podem ser compilados com uma variedade de sistemas de construção, incluindo:
ru: Модули могут быть построены с использованием различных систем сборки, в том числе:
zh_cn: 模块可以用多种构建系统构建，包含：

source: A "simple" build method is also available, which allows a series of commands to be specified.
pt_br: Um método de compilação “simples” também está disponível, o que permite que uma série de comandos seja especificada.
ru: Также доступен «простой» метод сборки, который позволяет указать серию команд.
zh_cn: 一个“简单的”构建方法，需要指定一系列命令。

source: Shared Modules
ru: Общие модули

source: Flatpak Builder Tools
ru: Инструменты для создания Flatpak

source: `Flatpak Builder Tools (or flatpak-builder-tools) <https://github.com/flatpak/flatpak-builder-tools>`_ is a collection of scripts to aid using `flatpak-builder`. In this repository, each directory contains instructions to generate a manifest for the respective platform.
ru: Flatpak Builder Tools (или flatpak-builder-tools) <https://github.com/flatpak/flatpak-builder-tools> — это набор скриптов, помогающих использовать flatpak-builder. В этом репозитории каждый каталог содержит инструкции по созданию манифеста для соответствующей платформы.

source: Example manifests
ko: Manifest 예제
pt_br: Exemplo de manifestos
ru: Примеры манифестов
zh_cn: 实例清单文件

source: Each manifest file should specify basic information about the application that is to be built, including the ``app-id``, ``runtime``, ``runtime-version``, ``sdk`` and ``command`` parameters. These properties are typically specified at the beginning of the file.
pt_br: Cada arquivo de manifesto deve especificar informações básicas sobre o aplicativo a ser criado, incluindo os parâmetros ``app-id``, ``runtime``, ``runtime-version``, ``sdk`` e ``command``. Essas propriedades geralmente são especificadas no início do arquivo.
zh_cn: 每个清单文件应该指明要构建应用的基本信息，包括 ``app-id`` ， ``runtime`` ， ``runtime-version`` ， ``sdk`` 和 ``command`` 。这些属性通常在文件的开头进行声明。

source: ``rename-appdata-file`` - rename the AppData file
pt_br: ``rename-appdata-file`` – renomeia o arquivo AppData
zh_cn: ``rename-appdata-file`` - 重命名AppData文件

source: The second cleanup property is a list of commands that are run during the cleanup phase::
ko: 두 번째 속성은 마무리 정리 단계에서 실행될 명령어 리스트이다::
pt_br: A segunda propriedade de limpeza é uma lista de comandos que são executados durante a fase de cleanup::
zh_cn: 第二个cleanup属性是一系列命令，在cleanup阶段执行::

source: Cleanup properties can be set on a per-module basis, in which case only filenames that were created by that particular module will be matched.
ko: 마무리 정리를 위해 모듈단위로(per-module)로 속성을 설정할 수 있는데, 해당 모듈에 의해 생성된 파일들 중 속성을 통해 지정된 파일 이름에 해당하는 것이 있는지 비교하게 된다.
pt_br: As propriedades de limpeza podem ser definidas por módulo, caso em que apenas os nomes de arquivos criados por esse módulo específico serão correspondidos.
zh_cn: cleanup属性可以根据每个模块进行设置，在这种情况下，只会匹配该特定的模块产生的文件名。

source: GNOME Dictionary's modules section is short, since it just contains the application itself, and looks like:
pt_br: A seção de módulos do Dicionário do GNOME é curta, pois contém apenas o próprio aplicativo e se parece com:
zh_cn: GNOME Dictionary的模块节点是较短的，因为它仅仅包含应用本身，大概如下所示：

source: ``file`` - local file (these are copied into the source directory)
pt_br: ``file`` – arquivo local (esses são copiados para dentro do diretório fonte)
zh_cn: ``file`` - 本地文件（这些复制到源码目录）

source: ``dir`` - local directory (these are copied into the source directory)
pt_br: ``dir`` – diretório local (esses são copiados para dentro do diretório fonte)
zh_cn: ``dir`` - 本地目录 (这些将复制到源码目录)

source: Different properties are available for each source type, which are listed in the :doc:`flatpak-builder-command-reference`.
pt_br: Diferentes propriedades estão disponíveis para cada tipo de fonte, listadas em :doc:`flatpak-builder-command-reference`.
zh_cn: 每种source类型有不同的属性，在 :doc:`flatpak-builder-command-reference` 列出了。

source: the "`Build API <https://github.com/cgwalters/build-api/>`_"
pt_br: a “`Build API <https://github.com/cgwalters/build-api/>`_”
zh_cn: " `Build API <https://github.com/cgwalters/build-api/>`_ "

source: The input to ``flatpak-builder`` is a JSON file that describes the parameters for building an application, as well as instructions for each of the modules that are to be built. This file is called the manifest.
ko: Manifest 파일은 플랫팩 빌더의 입력이며, 응용프로그램 빌드를 위한 매개변수 및 번들로 묶일 모듈들을 빌드하기 위한 방법을 지시하는 JSON 파일이다.

source: The following example is the manifest for the GNOME Dictionary application. It is short, because only one module is built - the application itself::
ko: 다음 예제는 GNOME 사전 응용프로그램(GNOME Dictionary)의 manifest 정보이다. 빌드하고자 하는 모듈이 하나, 즉 응용프로그램 자신 뿐이라서 길이가 짧다::

source: As can be seen, this manifest includes basic information about the application before specifying a single .tar file to be downloaded and built. More complex manifests include a sequence of modules. Module sources can be of several types, including ``.tar`` or ``.zip`` archives, Git or Bzr repositories, patch files or shell commands that are run.
ko: 내용을 보면 알 수 있듯, manifest는 응용프로그램에 대한 기본 정보를 기술하고, 뒤이어 다운로드 되고 설치될 .tar 파일을 지정하고 있다. 더 복잡한 manifest들은 일련의 모듈들을 포함하고 있다. 모듈 소스들은 ``.tar`` 나 ``.zip`` 형식의 묶음 파일이 될 수도 있고, Git이나 Bar 저장소가 될 수도 있으며 패치 파일이나 실행가능한 쉘 명령이 될 수도 있는 등 다양한 형태를 가질 수 있다.

source: Each of the properties that can be specified in a manifest file are listed in the :doc:`flatpak-builder-command-reference`, as well as the ``flatpak-builder`` man page.
ko: 플랫팩의 manifest 파일 내에서 지정할 수 있는 각 속성에 관해서는 :doc:`플랫팩 빌더 명령어 레퍼런스` 또는 플랫팩 빌더의 맨페이지를 참고한다.

source: Flatpaks have extremely limited access to the host environment by default. However, most applications require access to resources outside of their sandbox in order to be useful. This can be achieved with the ``finish-args`` manifest section, which allows sandbox permissions to be configured.
ko: 기본적으로 플랫팩은 호스트 환경에 대한 접근이 극도로 제한된다. 하지만 대부분의 응용프로그램들이 편의 제공을 목적으로 샌드박스 바깥의 자원 접근을 필요로 하는 것도 사실이다. 이를 위해 manifest 파일의 ``finish-args`` 섹션에서 응용프로그램에 허가하고자 하는 샌드박스 권한 목록을 설정할 수 있다.

source: While there are no restrictions on which sandbox permissions an application can use, as good practice, it is recommended to use the minimum number of as permissions possible. Certain permissions, such as blanket access to the system bus (using the ``--socket=system-bus`` option) are strongly discouraged.
ko: 응용프로그램에게 샌드박스 권한을 허용하는 데에는 별도의 제약이 없으나, 되도록 최소한의 권한만을 허용할 것을 권장한다. 시스템 버스에 대한 블랭킷 접근(blanket access) (``—socket=system-bus`` 옵션을 통해 가능)과 같은 것은 권장하지 않는다.

source: A list of ``finish-args`` options can be found in :doc:`sandbox-permissions`.
ko: ``finish-args`` 옵션의 목록은 :doc:`sandbox-permissions`에서 찾아볼 수 있다.

source: After building has taken place, ``flatpak-builder`` performs a cleanup phase. This can be used to remove headers and development documentation, among other things. Two properties in the manifest file are used for this. First, a list of filename patterns can be included::
ko: 빌드가 수행된 후, 플랫팩 빌더는 마무리 정리를 위한 삭제(clean up)를 수행한다. 헤더들 및 개발문서를 지우는 것도 이에 해당한다. manifest 파일의 두 속성이 이러한 일에 사용된다. 첫번째는 파일이름이다::

source: Files that are exported by a flatpak must be prefixed using the application ID. If an application's source files are not named using this convention, flatpak-builder allows them to be renamed as part of the build process. To rename application icons, desktop files and AppData files, use the ``rename-icon``, ``rename-desktop-file`` and ``rename-appdata-file`` properties.
ko: 플랫팩이 내보낸(export) 파일들은 응용프로그램 ID를 사용하여 이름 앞을 수식해야 한다. 플랫팩 빌더는 이러한 약속을 따르지 않는 응용프로그램 소스 파일들을 빌드 과정에서 재명명할 수 있도록 한다. 응용프로그램 아이콘, 데스크탑 파일, `AppData`파일들을 재명명하기 위해서는, ``rename-icon``, ``rename-desktop-file``, ``rename-appdata-file`` 속성을 사용한다.

source: A `complete manifest for GNOME Dictionary built from Git <https://github.com/flathub/org.gnome.Dictionary/blob/master/org.gnome.Dictionary.json>`_. It is also possible to browse `all the manifests hosted by Flathub <https://github.com/flathub>`_.
ko: `Git에서 받아 빌드하는 GNOME 사전용 manifest 파일(완전판) <https://github.com/flathub/org.gnome.Dictionary/blob/master/org.gnome.Dictionary.json>`_) 및 `플랫허브에서 호스팅하는 모든 manifest 파일 <https://github.com/flathub>`_ 을 참고할만 하다.
