Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/multiarch.po
Languages: pt_br, ru

source: Multiarch support
pt_br: Suporte a multiarquitetura
ru: Поддержка MultiArch

source: Flatpak has multiarch/multilib support, but it's not enabled by default and require some additional steps to enable it. This section covers enabling multiarch/multilib in your application bundle.
pt_br: Flatpak tem suporte multiarch/multilib, mas não está habilitado por padrão e requer algumas etapas adicionais para habilitá-lo. Esta seção abrange a ativação de multiarch/multilib em seu pacote de aplicativos.
ru: Flatpak поддерживает multiarch/multilib но по умолчанию она не включена, и для ее включения требуются некоторые дополнительные действия. В этом разделе рассказывается о включении multiarch/multilib в вашем пакете приложений.

source: Running 32-bit programs
pt_br: Executando programas de 32 bits
ru: Запуск 32-битных программ

source: In order to set up the run time environment for 32-bit executables, first you'll need to allow it in ``finish-args``:
pt_br: Para configurar o ambiente de runtime para executáveis de 32 bits, primeiro você precisa permitir isso em ``finish-args``:
ru: Чтобы настроить среду выполнения для 32-битных исполняемых файлов, сначала вам нужно разрешить это в ``finish-args``:

source: This is enough for static binaries, but most real-world GNU/Linux programs are linked dynamically. Those need some shared libraries to work.
pt_br: Isso é suficiente para binários estáticos, mas a maioria dos programas GNU/Linux do mundo real são vinculados dinamicamente. Esses precisam de algumas bibliotecas compartilhadas para funcionar.
ru: Этого достаточно для статических двоичных файлов, но большинство реальных программ GNU / Linux связаны динамически. Им для работы нужны общие библиотеки.

source: Freedesktop.org and GNOME SDKs both provide a special flatpak extension with a set of libraries for corresponding architecture. This extension can be attached to an app of different architecture. In order to enable the extension for your app, define an extension point for it in the app manifest:
pt_br: Os SDKs do Freedesktop.org e do GNOME fornecem uma extensão flatpak especial com um conjunto de bibliotecas para a arquitetura correspondente. Esta extensão pode ser anexada a um aplicativo de arquitetura diferente. Para habilitar a extensão para seu aplicativo, defina um ponto de extensão para ela no manifesto do aplicativo:
ru: Freedesktop.org и GNOME SDKs предоставляют специальное расширение flatpak с набором библиотек для соответствующей архитектуры. Это расширение можно подключить к приложению с другой архитектурой. Чтобы включить расширение для вашего приложения, определите для него точку расширения в манифесте приложения:

source: For GNOME runtime, use ``org.gnome.Platform.Compat.i386`` instead.
pt_br: Para o tempo de execução do GNOME, use ``org.gnome.Platform.Compat.i386`` em vez disso.
ru: Для среды выполнения GNOME используйте вместо этого ``org.gnome.Platform.Compat.i386``.

source: Note that this extension ``version`` must match the ``runtime-version`` of the application.
pt_br: Note que esta extensão ``version`` deve corresponder à ``runtime-version`` do aplicativo.
ru: Обратите внимание, что это расширение ``version`` должно соответствовать ``runtime-version`` приложения.

source: If the 32-bit programs make use of GPU acceleration, or have some graphical UI in general, you'll also need 32-bit GL drivers. Add an extension point for it:
pt_br: Se os programas de 32 bits fizerem uso de aceleração de GPU ou tiverem alguma interface gráfica em geral, você também precisará de drivers GL de 32 bits. Adicione um ponto de extensão para ele:
ru: Если 32-разрядные программы используют ускорение графического процессора или имеют графический интерфейс в целом, вам также понадобятся 32-разрядные драйверы GL. Добавьте для него точку расширения:

source: Note that the ``versions`` property here must contain both ``1.4`` and the same value as in ``runtime-version``.
pt_br: Observe que a propriedade ``versions`` aqui deve conter ``1.4`` e o mesmo valor que em ``runtime-version``.
ru: Обратите внимание, что свойство «versions» здесь должно содержать как «1.4», так и то же значение, что и в «runtime-version».

source: Make sure to create directories where the extensions will be mounted (the mount points are specified in ``directory`` properties and are relative to the app bundle mount point, i.e. to ``/app/``). This can be done at stage of the build.
pt_br: Certifique-se de criar diretórios onde as extensões serão montadas (os pontos de montagem são especificados nas propriedades do ``directory`` e são relativos ao ponto de montagem do pacote de aplicativos, ou seja, para ``/app/``). Isso pode ser feito na fase de compilação.
ru: Обязательно создайте каталоги, в которых будут монтироваться расширения (точки монтирования указаны в свойствах каталога и относятся к точке монтирования пакета приложений, то есть в ``/app/``). Это можно сделать на этапе сборки.

source: Finally, you need to make the dynamic library loader know the paths to 32-bit libraries. In order to do this, you can install a ``/app/etc/ld.so.conf`` file with contents like this:
pt_br: Finalmente, você precisa fazer com que o carregador dinâmico de bibliotecas conheça os caminhos para bibliotecas de 32 bits. Para fazer isso, você pode instalar um arquivo ``/app/etc/ld.so.conf`` com conteúdo como este:
ru: Наконец, вам нужно сделать так, чтобы загрузчик динамических библиотек знал пути к 32-битным библиотекам. Для этого вы можете установить файл ``/app/etc/ld.so.conf`` с таким содержимым:

source: Here ``/app/lib32`` is the directory where you install additional 32-bit libraries, if any.
pt_br: Aqui ``/app/lib32`` é o diretório onde você instala bibliotecas adicionais de 32 bits, se houver.
ru: Здесь ``/app/lib32`` - это каталог, в который вы устанавливаете дополнительные 32-битные библиотеки, если таковые имеются.

source: You can combine the above two steps in a special module, e.g.
pt_br: Você pode combinar as duas etapas acima em um módulo especial, por exemplo.
ru: Вы можете комбинировать выше два шага в специальном модуле, например.

source: Building 32-bit modules
pt_br: Compilando módulos de 32 bits
ru: Сборка 32-битных модулей

source: The section above describes how to run 32-bit programs that are already built. This section will describe the process of building 32-bit components yourself to ship them with the application. It assumes that you are already familiar with building (single-arch) flatpaks. If not, please refer to :doc:`flatpak-builder` guide first.
pt_br: A seção acima descreve como executar programas de 32 bits já compilados. Esta seção descreverá o processo de construção de componentes de 32 bits por conta própria para enviá-los com o aplicativo. Ele pressupõe que você já esteja familiarizado com a construção de flatpaks (arco único). Caso contrário, consulte primeiro o guia :doc:`flatpak-builder`.
ru: В приведенном выше разделе описано, как запускать уже созданные 32-разрядные программы. В этом разделе будет описан процесс самостоятельной сборки 32-разрядных компонентов для их доставки вместе с приложением. Предполагается, что вы уже знакомы с собранными (одноарочными) flatpaks. В противном случае сначала обратитесь к руководству :doc:`flatpak-builder`.

source: First of all, you'll need to enable some SDK extensions at build time:
pt_br: Em primeiro lugar, você precisará habilitar algumas extensões do SDK no momento da compilação:
ru: Прежде всего, вам нужно включить некоторые расширения SDK во время сборки:

source: The first one is the 32-bit portion of the SDK, containing 32-bit libraries and development files.
pt_br: A primeira é a parte de 32 bits do SDK, contendo bibliotecas de 32 bits e arquivos de desenvolvimento.
ru: Первая - это 32-битная часть SDK, содержащая 32-битные библиотеки и файлы разработки.

source: The second one is a cross-compiler. Usually ``gcc -m32`` is used for multilib builds, but the flatpak SDK comes with gcc without multilib support. Thus, you will need a cross-compiler for building x86 on x86_64 just as you would need it for any foreign architecture like aarch64.
pt_br: O segundo é um compilador cruzado. Normalmente ``gcc -m32`` é usado para compilações multilib, mas o SDK flatpak vem com gcc sem suporte a multilib. Assim, você precisará de um compilador cruzado para compilar x86 em x86_64 assim como precisaria para qualquer arquitetura estrangeira como aarch64.
ru: Второй - кросс-компилятор. Обычно для сборок с несколькими библиотеками используется ``gcc -m32`` , но пакет SDK flatpak поставляется с gcc без поддержки нескольких библиотек. Таким образом, вам понадобится кросс-компилятор для сборки x86 на x86_64 так же, как он понадобится для любой зарубежной архитектуры, такой как aarch64.

source: In order to build a 32-bit module, some global build options needs to be overridden. Examples here assume that 32-bit libraries are installed in ``/app/lib32`` directory:
pt_br: Para compilar um módulo de 32 bits, algumas opções globais de compilação precisam ser substituídas. Os exemplos aqui assumem que as bibliotecas de 32 bits estão instaladas no diretório ``/app/lib32``:
ru: Чтобы построить 32-битный модуль, необходимо переопределить некоторые глобальные параметры сборки. Примеры здесь предполагают, что 32-битные библиотеки установлены в каталог ``/app/lib32``:

source: These ``build-options`` need to be set for each 32-bit module. If your app manifest is in YAML format, the YAML anchors can come in handy and save you from copy-pasting the same snippet. You can define the 32-bit ``build-options`` object somewhere in the manifest, add an anchor to it, and then point each 32-bit modules' ``build-options`` to that anchor:
pt_br: Essas ``build-options`` precisam ser definidas para cada módulo de 32 bits. Se o manifesto do seu aplicativo estiver no formato YAML, as âncoras YAML podem ser úteis e evitar que você copie e cole o mesmo trecho de código. Você pode definir o objeto ``build-options`` de 32 bits em algum lugar no manifesto, adicionar uma âncora a ele e então apontar cada ``build-options`` de cada módulo de 32 bits para essa âncora:
ru: Эти ``параметры сборки`` необходимо установить для каждого 32-битного модуля. Если манифест вашего приложения имеет формат YAML, привязки YAML могут пригодиться и избавить вас от копирования-вставки того же фрагмента. Вы можете определить 32-битный объект build-options где-нибудь в манифесте, добавить к нему привязку, а затем указать каждому 32-битному модулю ``build-options`` на эту привязку:

source: Of course, in order to actually use 32-bit modules you've build, you'll also need all the same setup from the previous section.
pt_br: É claro que, para realmente usar os módulos de 32 bits que você construiu, você também precisará da mesma configuração da seção anterior.
ru: Конечно, для того, чтобы использовать созданные вами 32-битные модули, вам также потребуются все те же настройки, что и в предыдущем разделе.
