Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/portals.po
Languages: pt_br, ru

source: Portal support in GTK
pt_br: Suporte a portal no GTK
ru: Поддержка портала в GTK

source: GTK will transparently use portals for some functionality when it detects that it is being used inside a Flatpak sandbox. Here are some hints for what GTK applications should do to benefit from this.
pt_br: O GTK usará de forma transparente portais para algumas funcionalidades quando detectar que está sendo usado dentro de uma sandbox Flatpak. Aqui estão algumas dicas sobre o que os aplicativos GTK devem fazer para se beneficiar disso.
ru: GTK будет прозрачно использовать порталы для некоторых функций, когда обнаружит, что используется внутри песочницы Flatpak. Вот несколько советов о том, что должны делать приложения GTK, чтобы извлечь из этого пользу.

source: Use ``g_get_user_config_dir()``, ``g_get_user_cache_dir()`` and ``g_get_user_data_dir()`` to find the right place to store configuration and data
pt_br: Use ``g_get_user_config_dir()``, ``g_get_user_cache_dir()`` e ``g_get_user_data_dir()`` para encontrar o local certo para armazenar configurações e dados
ru: Используйте ``g_get_user_config_dir()``, ``g_get_user_cache_dir()`` и ``g_get_user_data_dir()`` Чтобы найти правильное место для хранения конфигурации и данных

source: Use ``GtkFileChooserNative`` (or ``GtkFileChooserButton``) to open files. As of `xdg-desktop-portal-gtk` 1.7.1 it can also open directories.
pt_br: Use ``GtkFileChooserNative`` (ou ``GtkFileChooserButton``) para abrir arquivos. A partir do `xdg-desktop-portal-gtk` 1.7.1 ele também pode abrir diretórios.
ru: Используйте ``GtkFileChooserNative`` (или ``GtkFileChooserButton``), чтобы открыть файлы. Поскольку «xdg-desktop-portal-gtk» 1.7.1 он также может открыть каталоги.

source: Use ``GtkPrintOperation`` for printing
pt_br: Use ``GtkPrintOperation`` para imprimir
ru: Используйте ``GtkPrintOperation`` для печати

source: Use ``gtk_show_uri_on_window()`` or ``g_app_info_launch_default_for_uri()`` to open URIs
pt_br: Use ``gtk_show_uri_on_window()`` ou ``g_app_info_launch_default_for_uri()`` para abrir URIs
ru: Используйте ``gtk_show_uri_on_window()`` или ``g_app_info_launch_default_for_uri()`` Чтобы открыть URI

source: Use ``gtk_application_inhibit()`` if you want to inhibit idle or logout
pt_br: Use ``gtk_application_inhibit()`` se você quiser inibir ociosidade ou encerramento de sessão (logout)
ru: Используйте ``gtk_application_inhibit()`` если вы хотите запретить простаивать или для выхода

source: Use ``g_application_send_notification()`` to show notifications
pt_br: Use ``g_application_send_notification()`` para mostrar notificações
ru: Используйте ``g_application_send_notification()`` для отображения уведомлений

source: Use the ``GtkApplication::screensaver-active`` property to monitor scrensaver status
pt_br: Use a propriedade ``GtkApplication::screensaver-active`` para monitorar o status da proteção de tela
ru: Используйте свойство ``GtkApplication::screensaver-active`` для отслеживания статуса экранной заставки

source: Additionally, xdg-desktop-portal-gtk is required for GTK themes and fonts. It is also used as a fallback for the filepicker if the main xdg-desktop-portal implementation doesn't support filepicking.
pt_br: Além disso, xdg-desktop-portal-gtk é necessário para temas e fontes GTK. Ele também é usado como substituto para o selecionador de arquivos se a implementação principal do xdg-desktop-portal não suportar seleção de arquivos.
ru: Кроме того, для тем и шрифтов GTK требуется xdg-desktop-portal-gtk. Он также используется в качестве запасного варианта для сборщика файлов, если основная реализация xdg-desktop-portal не поддерживает сбор файлов.

source: Portal support in Qt and KDE
pt_br: Suporte a portal no Qt e KDE
ru: Поддержка портала в Qt и KDE

source: Qt and KDE libraries will transparently use portals for some functionality when they detect that they are being used inside a Flatpak sandbox. Here are some hints for what Qt or KDE applications should do to benefit from this.
pt_br: As bibliotecas do Qt e do KDE usarão portais de forma transparente para algumas funcionalidades quando detectarem que estão sendo usadas dentro de uma caixa de areia Flatpak. Aqui estão algumas dicas sobre o que os aplicativos Qt ou KDE devem fazer para se beneficiar disso.
ru: Библиотеки Qt и KDE будут прозрачно использовать порталы для некоторых функций, когда обнаружат, что они используются внутри песочницы Flatpak. Вот несколько советов о том, что следует делать приложениям Qt или KDE, чтобы извлечь из этого пользу.

source: Use ``QDesktopServices::openUrl(const QUrl &url)`` or ``KIO::OpenUrlJob`` to open URIs or send an email when using ``mailto`` URL
pt_br: Use ``QDesktopServices::openUrl(const QUrl &url)`` ou ``KIO::Krun`` para abrir URIs ou enviar um e-mail por meio de URL ``mailto``
ru: Используйте ``QDesktopServices::openUrl(const QUrl &url)`` или ``KIO::OpenUrlJob``, чтобы открыть URI или отправить электронное письмо при использовании URL-адреса ``mailto``

source: Use ``QFileDialog`` class to open files and, as of Qt ``5.18.90``, directories. Avoid using ``QFileDialog::DontUseNativeDialog``. Note that portals cannot currently give access to directories on the host filesystem
pt_br: Use a classe ``QFileDialog`` para abrir arquivos e, a partir do Qt ``5.18.90``, diretórios. Evite usar ``QFileDialog::DontUseNativeDialog``. Observe que portais não podem atualmente dar acesso a diretórios no sistema de arquivos host
ru: Используйте ``QFileDialog`` для открытия файлов и, начиная с Qt ``5.18.90``, каталогов. Избегайте использования ``QFileDialog::DontUseNativeDialog``. Обратите внимание, что в настоящее время порталы не могут предоставлять доступ к каталогам в файловой системе хоста

source: Use ``KNotification::notify()`` to show notification
pt_br: Use ``KNotification::notify()`` para mostrar notificação
ru: Используйте ``KNotification::notify()``, чтобы показать уведомление
