Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/python.po
Languages: pt_br, ru

source: Python applications that use supported build systems like Meson, CMake, or Autotools can be built using the standard method. However, many Python applications use custom install scripts or are expected to be installed through Setuptools and ``pip``.
pt_br: Aplicativos em Python que usam sistemas de compilação suportados, como Meson, CMake ou Autotools, podem ser criados usando o método padrão. No entanto, muitos aplicativos Python usam scripts de instalação personalizados ou espera-se que sejam instalados através do Setuptools e do ``pip``.
ru: Приложения Python, использующие поддерживаемые системы сборки, такие как Meson, CMake или Autotools, могут быть созданы стандартным методом. Однако многие приложения Python используют настраиваемые сценарии установки или, как ожидается, будут установлены с помощью Setuptools и ``pip``.

source: For these cases, ``flatpak-builder`` provides the ``simple`` buildsystem. Rather than automating the build process, ``simple`` accepts a ``build-commands`` array of strings, which are executed in sequence.
pt_br: Nesses casos, o ``flatpak-builder`` fornece o sistema de compilação ``simple``. Em vez de automatizar o processo de compilação, ``simple`` aceita um conjunto de strings ``build-commands``, que são executados em sequência.
ru: Для этих случаев ``flatpak-builder`` предоставляет простую систему сборки. Вместо того, чтобы автоматизировать процесс сборки, ``simple`` принимает массив строк ``build-commands``, которые выполняются последовательно.

source: For example, the following YAML makes building the popular requests module rather straightforward:
pt_br: Por exemplo, o seguinte YAML simplifica bastante a construção do módulo de solicitações populares:
ru: Например, следующие YAML делает создание популярных запросов модуля довольно простым:

source: Here, ``build-commands`` is an array containing the commands required to build and install the module. As can be seen, in this case ``pip`` is run to do this. Here, the ``--prefix=/app`` option is important, because otherwise ``pip`` would try to install the module under ``/usr/`` which, because ``/usr/`` is mounted read-only inside the sandbox, would fail.
pt_br: Aqui, ``build-commands`` é um vetor que contém os comandos necessários para compilar e instalar o módulo. Como pode-se ver, neste caso, ``pip`` é executado para fazer isso. Aqui, a opção ``--prefix=/app`` é importante, porque, caso contrário, ``pip`` tentaria instalar o módulo em ``/usr/`` o que, por causa do ``/usr/`` estar montado como somente leitura dentro do sandbox, falharia.
ru: Здесь ``build-commands`` - это массив, содержащий команды, необходимые для сборки и установки модуля. Как видно, в этом случае для этого запускается ``pip``. Здесь важен параметр ``--prefix=/app``, потому-что в противном случае ``pip`` попытается установить модуль в ``/usr/``, который смонтирован ``/usr/`` только для чтения внутри песочницы и запись в него окончится неудачно.

source: Note that ``--no-deps`` is only used for the purpose of the example - since the requests module has its own dependencies, the build would fail. If multiple dependencies are required, it is better to install them using the method in the next section, instead.
pt_br: Observe que ``--no-deps`` é usado apenas para a finalidade do exemplo – como o módulo requisições tem suas próprias dependências, a compilação falhará. Se várias dependências forem necessárias, é melhor instalá-las usando o método na seção seguinte.
ru: Обратите внимание, что параметр ``--no-deps`` используется только в целях примера - поскольку модуль запросов имеет свои собственные зависимости, сборка завершится ошибкой. Если требуется несколько зависимостей, лучше установить их, используя метод, описанный в следующем разделе.

source: Building multiple Python dependencies
pt_br: Compilando várias dependências Python

source: Even though the example above installs, it won't actually work. This is because the requests module has a number of dependencies that haven't been installed:
pt_br: Mesmo que o exemplo acima seja instalado, ele não funcionará. Isso ocorre porque o módulo requests possui várias dependências que não foram instaladas:
ru: Несмотря на то, что приведенный выше пример устанавливается, на самом деле он не работает. Это связано с тем, что у модуля запросов есть ряд зависимостей, которые не были установлены:

source: Four dependencies aren't very many, and could be installed using the ``simple`` method described above. However, anything more complex than this would quickly become tedious.
pt_br: Quatro dependências não são muitas e podem ser instaladas usando o método ``simple`` descrito acima. No entanto, qualquer coisa mais complexa do que isso rapidamente se tornaria tediosa.
ru: Четырех зависимостей не так много, и их можно установить с помощью ``simple`` метода, описанного выше. Однако что-либо более сложное, чем это, быстро станет утомительным.

source: For these cases, `flatpak-pip-generator <https://github.com/flatpak/flatpak-builder-tools/tree/master/pip>`_ can be used to generate the necessary manifest JSON. This is a Python script that takes a package name and uses ``pip`` to identify its dependencies, along with their tarball URLs and hashes.
pt_br: Nesses casos, `flatpak-pip-generator <https://github.com/flatpak/flatpak-builder-tools/tree/master/pip>`_ pode ser usado para gerar o manifesto JSON necessário. Este é um script Python que pega um nome de pacote e usa ``pip`` para identificar suas dependências, junto com seus URLs e hashes tarball.
ru: В этих случаях можно использовать `flatpak-pip-generator <https://github.com/flatpak/flatpak-builder-tools/tree/master/pip>`_ для генерации необходимого манифеста JSON. Это скрипт Python, который принимает имя пакета и использует pip для определения его зависимостей, а также их URL-адресов и хэшей архивов.

source: Using ``flatpak-pip-generator`` is as simple as running::
pt_br: Usar ``flatpak-pip-generator`` é tão simples quanto executar::
ru: Использовать ``flatpak-pip-generator`` так же просто, как запустить::

source: Or if you have a ``requirements.txt`` file you can generate modules for every listed package::
pt_br: Ou se você tem um arquivo ``requirements.txt`` você pode gerar módulos para cada pacote listado::
ru: Или если у вас есть файл ``requirements.txt`` , которым вы можете генерировать модули для каждого перечисленного пакета::

source: This will output a file called ``python3-requests.json``, containing the necessary manifest JSON, which can then be included in your application's manifest file. Even if your manifest uses YAML, you can still include JSON like this::
pt_br: Isso produzirá um arquivo chamado ``python3-requests.json``, contendo o manifesto JSON necessário, que pode ser incluído no arquivo de manifesto do seu aplicativo. Mesmo que seu manifesto use YAML, você ainda pode incluir JSON assim::
ru: В результате будет выведен файл с именем ``python3-requests.json``, содержащий необходимый манифест JSON, который затем можно будет включить в файл манифеста вашего приложения. Даже если ваш манифест использует YAML, вы все равно можете включать в себя JSON, как это::

source: Building multiple python dependencies
ru: Создание нескольких зависимостей Python
