Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/repositories.po
Languages: ko, pt_br, ru, zh_cn

source: Repositories
ko: 저장소
pt_br: Repositórios
ru: Репозитории
zh_cn: 仓库

source: Flatpak repositories are the primary mechanism for publishing applications, so that they can be installed by users.
ko: 플랫팩 저장소는 응용프로그램들을 발행(publish)하여 사용자가 설치할 수 있도록 하기 위한 주요 메커니즘이다.
pt_br: Os repositórios do Flatpak são o principal mecanismo de publicação de aplicativos, para que possam ser instalados pelos usuários.
ru: Репозитории Flatpak - это основной механизм публикации приложений, реализуемый так, чтобы они могли быть установлены пользователями.
zh_cn: Flatpak存储库是发布应用程序的主要机制，因此可以由用户安装。

source: Some aspects of repositories are addressed by other sections of the documentation. Basic commands for adding, removing and inspecting repositories can be found in the :doc:`using-flatpak` section. Additionally, the section on :doc:`flatpak-builder` covers the most common method for adding applications to repositories.
ko: 저장소에 관한 사항은 문서의 다른 장에서 다루고 있다. 저장소를 추가하고 제거하고 조회하기 위한 기본적인 명령들은 :doc:`플랫팩 사용하기`에서 찾을 수 있다. 추가적으로 :doc:`플랫팩 빌더`문서는 저장소에 응용프로그램을 추가하기 위한 일반적인 방법을 설명한다.
pt_br: Alguns aspectos dos repositórios são abordados por outras seções da documentação. Comandos básicos para adicionar, remover e inspecionar repositórios podem ser encontrados na seção :doc:`using-flatpak`. Além disso, a seção :doc:`flatpak-builder` cobre o método mais comum para adicionar aplicativos aos repositórios.
ru: Некоторые аспекты репозиториев рассматриваются в других разделах документации. Основные команды для добавления, удаления и проверки репозиториев можно найти в разделе :doc:`using-flatpak`. Кроме того, в разделе :doc:`flatpak-builder` описывается наиболее распространенный метод добавления приложений в репозитории.
zh_cn: 存储库的某些方面由文档的其他部分解决。 可以在 :doc:`using-flatpak` 部分中找到用于添加，删除和检查存储库的基本命令。 此外， :doc:`flatpak-builder` 上的部分介绍了将应用程序添加到存储库的最常用方法。

source: To use a repository to publish an application, it is possible to either host your own (covered in the next section, :doc:`hosting-a-repository`) or use `Flathub <http://flathub.org>`_, the primary publishing and hosting service for Flatpak applications.
ko: 응용프로그램의 발행을 위해 자신만의 저장소를 운영하는 것도 가능하며 (:doc:`저장소 운영하기` 문서에서 다룬다) , 플랫팩 응용프로그램을 발생하고 호스팅하는 서비스인 `플랫허브(Flathub) <http://flathub.org>`_를 사용할 수도 있다.
pt_br: Para usar um repositório para publicar um aplicativo, é possível hospedar o seu próprio (abordado na próxima seção :doc:`hosting-a-repository`) ou usar o `Flathub <http://flathub.org>`_, o principal serviço de publicação e hospedagem de aplicativos Flatpak.

source: Software center applications like GNOME Software or KDE Discover allow browsing repositories, and can also dynamically promote new or popular applications. If you use Flathub, the repository will typically have already been added by users, so adding an application to the repository is sufficient to make it available to them.
ko: GNOME Software나 KDE Discover와 같은 소프트웨어 센터 응용프로그램들은 저장소를 브라우징하고 최신 혹은 인기있는 응용프로그램을 동적으로 조회할 수 있도록 지원한다. 플랫허브는 많은 사용자들이 추가하는 저장소이므로, 빌드한 프로그램을 플랫허브에 추가하는 것 만으로도 사용자들에게 공개하기에 충분하다.
pt_br: Os aplicativos do centro de software, como o GNOME Programas ou o KDE Discover, permitem navegar nos repositórios e também podem promover dinamicamente aplicativos novos ou populares. Se você usa o Flathub, o repositório normalmente já foi adicionado pelos usuários; portanto, adicionar um aplicativo ao repositório é suficiente para torná-lo disponível para eles.
ru: Приложения центра программного обеспечения, такие как GNOME Software или KDE Discover, позволяют просматривать репозитории, а также могут динамически продвигать новые или популярные приложения. Если вы используете Flathub, репозиторий, как правило, уже был добавлен пользователями, поэтому добавления приложения в репозиторий достаточно, чтобы сделать его доступным для них.
zh_cn: GNOME软件或KDE Discover等软件中心应用程序允许浏览存储库，还可以动态地推广新的或流行的应用程序。 如果使用Flathub，则用户通常已添加存储库，因此向存储库添加应用程序足以使其可用。

source: .flatpakref files
ko: .flatpakref 파일
pt_br: Arquivos .flatpakref
ru: Файлы .flatpakref
zh_cn: .flatpakref 文件

source: ``.flatpakref`` files can be used in combination with repositories to provide an additional, easy way for users to install an application, often by clicking on the file or a download link.
ko: 사용자에게 응용프로그램을 쉽게 설치하도록 지원하는 추가적인 수단으로 ``.flatpakref`` 파일과 저장소를 함께 이용할 수 있다.사용자는 ``.flatpakref`` 파일 또는 파일의 링크만 클릭하면 된다.
pt_br: Os arquivos ``.flatpakref`` podem ser usados em combinação com repositórios para fornecer uma maneira fácil e adicional para os usuários instalarem um aplicativo, geralmente clicando no arquivo ou no link para download.
ru: Файлы ``.flatpakref`` могут использоваться в сочетании с репозиториями, чтобы предоставить пользователям дополнительный, простой способ установки приложения, часто путем нажатия на файл или ссылку для загрузки.
zh_cn: ``.flatpakref`` 文件可以与存储库结合使用，为用户安装应用程序提供额外的简便方法，通常是通过单击文件或下载链接。

source: Internally, ``.flatpakref`` files are simple description files that include information about a Flatpak application. An example::
ko: 내부적으로 ``.flatpakref`` 파일은 플랫팩 응용프로그램에 관한 정보를 담고 있는 단순 설명 파일이다. 예를 들면 이렇다::
pt_br: Internamente, os arquivos ``.flatpakref`` são arquivos de descrição simples que incluem informações sobre um aplicativo Flatpak. Um exemplo::
ru: Внутри файлы .flatpakref представляют собой простые файлы описания, которые включают информацию о приложении Flatpak. Пример::
zh_cn: 在内部， ``.flatpakref`` 文件是简单的描述文件，其中包含有关Flatpak应用程序的信息。一个例子：

source: As can be seen, the file includes the ID of the application and the location of the repository that contains it, as well a link to information about the repository that provides the application's runtime. ``.flatpakref`` files therefore contain all the information needed to install an application.
ko: 보이는 바와 같이 파일은 응용프로그램의 ID와 해당 프로그램을 올려둔 저장소의 위치, 그리고 해당 프로그램의 런타임을 제공하는 저장소 정보를 담고 있다. 따라서 응용프로그램 설치에 필요한 모든 정보가 ``.flatpakref`` 파일에 담겨있다고 할 수 있다.
pt_br: Como pode-se ver, o arquivo inclui o ID do aplicativo e o local do repositório que o contém, além de um link para informações sobre o repositório que fornece o runtime do aplicativo. Os arquivos ``.flatpakref`` contêm, portanto, todas as informações necessárias para instalar um aplicativo.
ru: Как видно, файл включает в себя идентификатор приложения и расположение репозитория, который его содержит, а также ссылку на информацию о репозитории, который обеспечивает среду выполнения приложения. Таким образом, файлы ``.flatpakref`` содержат всю информацию, необходимую для установки приложения.
zh_cn: 如你所见，该文件包括应用程序的ID以及包含它的存储库的位置，以及指向提供应用程序运行时存储库信息的链接。 ``.flatpakref`` 文件包含安装应用程序所需的所有信息。

source: ``.flatpakref`` files should include the base64-encoded version of the GPG key that was used to sign the repository. This can be obtained with the following command::
ko: ``.flatpakref`` 파일은 저장소 서명에 사용된 GPG 키의 base64 인코딩 버전을 포함해야 한다. 다음과 같은 명령을 실행하여 통해 얻을 수 있다::
pt_br: Os arquivos ``.flatpakref`` devem incluir a versão codificada em base64 da chave GPG que foi usada para assinar o repositório. Isso pode ser obtido com o seguinte comando::
ru: Файлы ``.flatpakref`` должны включать в себя версию ключа GPG в кодировке base64, который использовался для подписи репозитория. Это можно получить с помощью следующей команды::
zh_cn: ``.flatpakref`` 文件应包含用于对存储库进行签名的GPG密钥的base64编码版本。 这可以使用以下命令获得：

source: One advantage of ``.flatpakref`` files is that they can be used to install applications even if their repository hasn't been added by the user. In this case the repository that contains the application will either be automatically installed, or the user will be prompted to install it. This will also happen if the necessary runtime isn't present.
ko: ``.flatpakref`` 파일을 이용할 때의 장점은 사용자가 저장소를 추가하지 않았더라도 해당 저장소에 있는 응용프로그램을 설치할 수 있도록 한다는 것이다. 이 경우 해당 저장소는 자동으로 설치되거나 사용자에게 설치할 것인지 여부를 묻게된다. 필요한 런타임이 설치되어 있지 않은 경우에도 동일한 과정을 거친다.
pt_br: Uma vantagem dos arquivos ``.flatpakref`` é que eles podem ser usados para instalar aplicativos, mesmo que seu repositório não tenha sido adicionado pelo usuário. Nesse caso, o repositório que contém o aplicativo será instalado automaticamente ou o usuário será solicitado a instalá-lo. Isso também acontecerá se o runtime necessário não estiver presente.
ru: Одним из преимуществ файлов ``.flatpakref`` является то, что их можно использовать для установки приложений, даже если их репозиторий не был добавлен пользователем. В этом случае репозиторий, содержащий приложение, либо будет установлен автоматически, либо пользователю будет предложено установить его. Это также произойдет, если необходимая среда выполнения отсутствует.
zh_cn: ``.flatpakref`` 文件的一个优点是，即使用户尚未添加其存储库，它们也可用于安装应用程序。 在这种情况下，将自动安装包含应用程序的存储库，或者将提示用户安装它。 如果不存在必要的运行时，也会发生这种情况。

source: ``.flatpakref`` can be used to install applications from the command line as well as with graphical software installers. This is done with the standard ``flatpak install`` command, which accepts both local and remote ``.flatpakref`` files. For example::
ko: ``.flatpakref`` 은 커맨드라인이나 GUI기반 설치관리자를 통해 응용프로그램을 설치할 때에도 사용할 수 있다. ``flatpak install`` 명령어를 실행하면 로컬 또는 원격의 ``.flatpakref`` 파일 링크를 이용하여 응용프로그램을 설치한다. 예를 들면::
pt_br: O ``.flatpakref`` pode ser usado para instalar aplicativos a partir da linha de comando e também com instaladores gráficos de software. Isso é feito com o comando padrão ``flatpak install``, que aceita arquivos ``.flatpakref`` locais e remotos. Por exemplo::
ru: ``.flatpakref`` можно использовать для установки приложений из командной строки, а также с помощью графических установщиков программного обеспечения. Это делается с помощью стандартной команды ``flatpak install``, которая принимает как локальные, так и удаленные файлы ``.flatpakref``. Например::
zh_cn: ``.flatpakref`` 可用于从命令行以及图形软件安装程序安装应用程序。 这是通过标准的 ``flatpak install`` 命令完成的，该命令接受本地和远程 ``.flatpakref`` 文件。 例如：

source: Or, if the same file has been downloaded::
ko: 해당 파일이 이미 다운로드 되어 있는 경우에는::
pt_br: Ou, se o mesmo arquivo tiver sido baixado::
ru: Или, если был загружен тот же файл::
zh_cn: 或者是下载好的文件：

source: Publishing updates
ko: 발행 내역 갱신 (publishing updates)
pt_br: Publicando atualizações
ru: Публикация обновлений
zh_cn: 发布更新

source: Flatpak repositories are similar a Git repositories, in that they store every version of an application by keeping a record of the difference between each version. This makes updating efficient, since only the difference (or "delta") between two versions needs to be downloaded when an update is performed.
ko: 플랫팩 저장소는 응용프로그램의 버전 간 차이를 저장 해 둠으로써, 해당 소프트웨어의 모든 버전을 제공할 수 있다는 점에서 Git 저장소와 유사하다. 응용프로그램을 업데이트 할 때, 버전 간의 차이 (즉 델타, “delta”) 만 다운로드하면 되므로, 업데이트가 매우 효율적으로 이루어진다.

source: When a new version of an application is added to a repository, it immediately becomes available to users. Software centers are able to automatically check for and install new versions. Those who are using the command line have to manually run ``flatpak update`` to check for and install new versions of any applications they have installed.
ko: 저장소에 새 버전의 응용프로그램이 추가되면, 사용자는 즉시 이를 사용할 수 있다. 소프트웨어 센터들은 자동으로 새 버전을 검사하고 설치할 수 있다. 명령 행을 사용하는 경우에는 수동으로``flatpak update`` 명령을 입력하여, 설치한 응용프로그램의 새 버전을 검사하고 설치할 수 있다.
pt_br: Quando uma nova versão de um aplicativo é adicionada a um repositório, ela fica imediatamente disponível para os usuários. Os centros de software podem procurar e instalar automaticamente novas versões. Aqueles que estão usando a linha de comando precisam executar manualmente ``flatpak update`` para verificar e instalar novas versões de todos os aplicativos que instalaram.
ru: Когда новая версия приложения добавляется в репозиторий, она сразу становится доступной для пользователей. Центры программного обеспечения могут автоматически проверять и устанавливать новые версии. Те, кто использует командную строку, должны вручную запустить ``flatpak update``, чтобы проверить и установить новые версии любых приложений, которые они установили.
zh_cn: 将新版本的应用程序添加到存储库时，它立即可供用户使用。 软件中心能够自动检查并安装新版本。 那些使用命令行的人必须手动运行flatpak update来检查并安装他们已安装的任何应用程序的新版本。

source: Flatpak repositories are similar to Git repositories, in that they store every version of an application by keeping a record of the difference between each version. This makes updating efficient, since only the difference (or "delta") between two versions needs to be downloaded when an update is performed.
pt_br: Os repositórios Flatpak são semelhantes aos repositórios Git, pois armazenam todas as versões de um aplicativo, mantendo um registro da diferença entre cada versão. Isso torna a atualização eficiente, pois apenas a diferença (ou “delta”) entre duas versões precisa ser baixada quando uma atualização é executada.
ru: Репозитории Flatpak похожи на репозитории Git в том, что они хранят каждую версию приложения, записывая разницу между каждой версией. Это делает обновление эффективным, поскольку при выполнении обновления необходимо загружать только разницу (или «дельту») между двумя версиями.
zh_cn: Flatpak存储库类似于Git存储库，因为它们通过记录每个版本之间的差异来存储应用程序的每个版本。 这使得更新有效，因为在执行更新时仅需要下载两个版本之间的差异（或“增量”）。

source: To use a repository to publish an application, it is possible to either host your own (covered in the next section, :doc:`hosting-a-repository`) or use `Flathub <https://flathub.org>`_, the primary publishing and hosting service for Flatpak applications.
ru: Чтобы использовать репозиторий для публикации приложения, можно либо разместить свой собственный (рассмотренный в следующем разделе, :doc:`hosting-a-repository`), либо использовать `Flathub <https://flathub.org>`_ , основная служба публикации и размещения приложений Flatpak.
