Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/runtimes-sdks.po
Languages: ko, ru, zh_hans_cn

source: Runtimes and SDKs
ko: 런타임과 SDK
ru: Среды выполнения и SDK
zh_hans_cn: Runtime 和 SDK

source: Each Flatpak app is required to have a runtime. This provides the environment that the app runs in, and includes a set of libraries that it can access. The app's runtime must be present on a system for it to run.
ko: 각 플랫팩 응용프로그램은 실행을 위해 런타임을 필요로 한다. 런타임은 응용프로그램이 실행될 환경을 제공하며 필요한 라이브러리 집합을 포함한다. 응용프로그램 실행을 위해서는 실행에 필요한 런타임을 시스템에서 찾을 수 있어야 한다.
ru: Каждое приложение Flatpak должно иметь среду выполнения. Это обеспечивает среду, в которой работает приложение, и включает в себя набор библиотек, к которым оно может получить доступ. Среда выполнения приложения должна присутствовать в системе для его запуска.
zh_hans_cn: 每个flatpak应用要求有一个runtime。runtime提供了app的运行环境和供app访问的一系列库。runtime必须在系统上部署app才可以运行。

source: Each runtime is paired with an SDK (Software Develpment Kit). For example, for the Freedesktop 1.6 runtime, there is also a Freedesktop 1.6 SDK. The SDK includes the same things as the regular runtime, but also includes all the additional development resources and tools that are required to build an app, such as build and packaging tools, header files, compilers and debuggers.
ko: 각 런타임은 SDK와 짝을 이룬다. 이를테면 Freedesktop 1.6 런타임과 한 짝인 Freedesktop 1.6 SDK가 존재하는 식이다. SDK는 일반적인 런타임에 더하여, 빌드 및 패키지 도구, 헤더 파일, 컴파일러와 디버거와 같이 개발과 빌드에 필요한 도구들을 추가로 제공한다고 보면 된다.
ru: Каждая среда выполнения связана с SDK (Software Develpment Kit). Например, для среды выполнения Freedesktop 1.6 также существует Freedesktop 1.6 SDK. SDK включает в себя то же, что и обычная среда выполнения, но также включает в себя все дополнительные ресурсы и инструменты разработки, необходимые для создания приложения, такие как инструменты сборки и упаковки, заголовочные файлы, компиляторы и отладчики.
zh_hans_cn: 每个runtime是和SDK配套的。举个例子，Freedesktop 1.6 runtime 对应 Freedesktop 1.6 SDK。SDK包含的东西和普通的runtime一样，同时还包括构建应用需要的开发资源和工具，例如构建和打包工具、头文件、编译器和调试器。

source: Applications must be built with the SDK that corresponds to their runtime. For example, an application that uses the Freedesktop 1.6 runtime in order to run must be built with the Freedesktop 1.6 SDK.
ko: 응용프로그램은 런타임과 짝을 이루는 SDK를 이용하여 빌드해야 한다. 즉 Freedesktop 1.6 런타임을 사용하는 응용프로그램은 Freedesktop 1.6 SDK를 사용하여 빌드해야 한다.
ru: Приложения должны создаваться с помощью SDK, соответствующего их среде выполнения. Например, приложение, использующее для работы среду выполнения Freedesktop 1.6, должно быть создано с помощью Freedesktop 1.6 SDK.
zh_hans_cn: 应用必须用和其runtime对应的SDK来构建。举个例子，使用Freedesktop 1.6 runtime的应用必须用Freedesktop 1.6 SDK来进行构建。

source: Choosing a runtime
ko: 런타임 선택하기
ru: Выбор среды выполнения
zh_hans_cn: 选择一个runtime

source: When you come to build a Flatpak app, you will need to decide which runtime it will use. An overview of the runtimes that are available can be found in the :doc:`available-runtimes` page. There are deliberately only a small number of runtimes to choose from.
ko: 플랫팩 응용프로그램을 빌드할 때에는 어떤 런타임을 사용할 것인지 결정해야 한다. :doc:`available-runtimes` 페이지에서 사용 가능한 런타임들을 소개하고 있다. 해당 페이지에는 일부러 소수의 런타임만을 열거하였다.
ru: Когда вы приступите к созданию приложения Flatpak, вам нужно будет решить, какую среду выполнения оно будет использовать. Обзор доступных сред выполнения можно найти на странице :doc:`available-runtimes`. Существует намеренно только небольшое количество сред выполнения на выбор.
zh_hans_cn: 当你开始构建一个flatpak应用时，你需要觉得它使用哪一个runtime。在 :doc:`available-runtimes`页面可以找到关于runtime的概述。故意的只有少量的runtime供选择。

source: Runtimes require regular maintenance, and application developers should generally not consider creating their own.
ko: 런타임은 주기적으로 유지보수를 해 주어야 하며, 응용 프로그램 개발자는 특수한 경우를 제외하고는 런타임을 생성하지 말 것을 권장한다.
ru: Среды выполнения требуют регулярного обслуживания, и разработчикам приложений, как правило, не следует думать о создании собственных.
zh_hans_cn: runtime需要定期维护，应用开发者通常不需要考虑自己创建一个runtime。

source: Installing a runtime and SDK
ko: 런타임과 SDK 설치
ru: Установка среды выполнения и SDK
zh_hans_cn: 安装runtime和SDK

source: Once you have chosen a runtime for your application, it is necessary to install it as well as the matching SDK. (Runtimes and SDKs are installed in exactly the same way.)
ko: 응용프로그램을 위한 런타임을 선택한 후, 그와 짝을 이루는 SDK를 설치할 필요가 있다 (런타임의 설치방법은 SDK 설치방법과 동일하다).
ru: После того, как вы выбрали среду выполнения для своего приложения, необходимо установить ее, а также соответствующий SDK. (Среды выполнения и SDK устанавливаются точно так же.)
zh_hans_cn: 一旦为你的应用选择了一个runtime，也必须安装一个配套的SDK。（runtime和SDK使用相同的安装方法。）

source: For example, the command to install the GNOME 3.25 runtime and SDK is::
ko: GNOME 3.25 런타임과 SDK를 설치하는 명령어를 예로 들면 다음과 같다::
ru: Например, команда для установки среды выполнения GNOME 3.25 и SDK::
zh_hans_cn: 举个例子，安装GNOME 3.25 runtime和SDK的命令是::

source: A number of the examples in these docs use this runtime and SDK, so it is a good idea to try this command yourself.
ko: 이 문서 내에서 런타임과 SDK를 사용하는 예제가 여러 번 등장하므로, 명령어 실행을 연습해 두는 것이 좋다.
ru: В ряде примеров в этих документах используется эта среда выполнения и SDK, поэтому рекомендуется попробовать эту команду самостоятельно.
zh_hans_cn: 这些文档里大量的例子使用这个runtime和SDK，所以自行尝试执行这个命令是极好的。
