Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/sandbox-permissions-reference.po
Languages: pt_br, ru

source: Sandbox Permissions Reference
pt_br: Permissões de referência do sandbox
ru: Разрешения песочницы

source: Sandbox permissions can be configured from an application manifest file (see :doc:`manifests`). They can also be set with the ``build-finish``, ``run`` and ``override`` commands.
pt_br: As permissões do sandbox podem ser configuradas a partir de um arquivo de manifesto do aplicativo (consulte :doc:`manifests`). Eles também podem ser configurados com os comandos ``build-finish``, ``run`` e ``override``.
ru: Разрешения песочницы можно настроить из файла манифеста приложения (см: :doc:`manifests`). Их также можно установить с помощью команд ``build-finish``, ``run`` и ``override``.

source: The following list includes many of the most useful permission options. A complete list can be viewed using ``flatpak build-finish --help``.
pt_br: A lista a seguir inclui muitas das opções de permissão mais úteis. Uma lista completa pode ser visualizada usando ``flatpak build-finish --help``.
ru: В следующем списке представлены многие из наиболее полезных вариантов разрешений. Полный список можно просмотреть с помощью команды ``flatpak build-finish --help``.

source: Show windows using X11
pt_br: Mostra janelas usando X11
ru: Показать окна с помощью X11

source: Grant X11 access when Wayland is not available
pt_br: Concede acesso a X11 quando o Wayland não está disponível

source: Share IPC namespace with the host [#f1]_
pt_br: Compartilha espaço de nome IPC com o host [#f1]_
ru: Совместное использование пространства имен IPC с хостом [#f1]_

source: Allow access to Bluetooth
pt_br: Permite acesso ao Bluetooth
ru: Разрешить доступ к Bluetooth

source: OpenGL rendering
pt_br: Renderização OpenGL
ru: Отрисовка OpenGL

source: Show windows using Wayland
pt_br: Mostra janelas usando Wayland
ru: Показать окна с помощью Wayland

source: Play sounds using PulseAudio
pt_br: Reproduz sons usando PulseAudio
ru: Воспроизведение звуков с помощью PulseAudio

source: Access the network [#f2]_
pt_br: Acessa a rede [#f2]_
ru: Доступ к сети [#f2]_

source: Talk to a named service on the session bus
pt_br: Conversa com o serviço dado no barramento de sessão
ru: Общение с названной службой на сеансовой шине

source: Talk to a named service on the system bus
pt_br: Conversa com o serviço dado no barramento de sistema
ru: Общение с указанной службой на системной шине

source: Talk to the CUPS printing system
pt_br: Conversa com o sistema de impressão CUPS

source: Talk to the GPG agent
pt_br: Conversa com o agente do GPG

source: Grant access to smart card
pt_br: Concede acesso a cartão inteligente

source: SSH authentication
pt_br: Autenticação SSH

source: Unlimited access to user's D-Bus session
pt_br: Acesso ilimitado à sessão D-Bus do usuário

source: Unlimited access to all of D-Bus
pt_br: Acesso ilimitado a tudo de D-Bus
ru: Неограниченный доступ ко всем интерфейсам D-Bus

source: Filesystem permissions
pt_br: Permissões de sistema de arquivos
ru: Разрешения файловой системы

source: Each of the following permissions configure filesystem access, and should be added to ``--filesystem=``:
pt_br: Cada uma das seguintes permissões configura o acesso ao sistema de arquivos e deve ser adicionada a ``--filesystem =``:
ru: Каждое из следующих разрешений настраивает доступ к файловой системе и должно быть добавлено в ``--filesystem=``:

source: Access all files [#f3]_
pt_br: Acessa todos os arquivos [#f3]_
ru: Доступ ко всем файлам [#f3]_

source: Access all files in /etc
pt_br: Acessa todos os arquivos em /etc

source: Access the home directory
pt_br: Acessa a pasta pessoal
ru: Доступ к домашнему каталогу

source: ``/some/dir``
pt_br: ``/algum/dir``

source: Access an arbitrary path
pt_br: Acessa um caminho arbitrário
ru: Доступ к случайному пути

source: ``~/some/dir``
pt_br: ``~/algum/dir``

source: Access an arbitrary path relative to the home directory
pt_br: Acessa um caminho relativo arbitrário à pasta pessoal
ru: Доступ к случайному пути относительно домашнего каталога

source: Access the XDG desktop directory
pt_br: Acesse o diretório XDG da área de trabalho
ru: Доступ к каталогу рабочего стола XDG

source: Access the XDG documents directory
pt_br: Acesse o diretório XDG de documentos
ru: Доступ к каталогу документов XDG

source: Access the XDG download directory
pt_br: Acesse o diretório XDG de downloads
ru: Доступ к каталогу загрузки XDG

source: Access the XDG music directory
pt_br: Acesse o diretório XDG de músicas
ru: Доступ к музыкальному каталогу XDG

source: Access the XDG pictures directory
pt_br: Acesse o diretório XDG de imagens
ru: Доступ к каталогу изображений XDG

source: Access the XDG public directory
pt_br: Acesse o diretório XDG público
ru: Доступ к общедоступному каталогу XDG

source: Access the XDG videos directory
pt_br: Acesse o diretório XDG de vídeos
ru: Доступ к видеокаталогу XDG

source: Access the XDG templates directory
pt_br: Acesse o diretório XDG de modelos
ru: Доступ к каталогу шаблонов XDG

source: Access the XDG config directory
pt_br: Acesse o diretório XDG de configuração
ru: Доступ к каталогу конфигурации XDG

source: Access the XDG cache directory
pt_br: Acesse o diretório XDG de cache
ru: Доступ к каталогу кеша XDG

source: Access the XDG data directory
pt_br: Acesse o diretório XDG de dados
ru: Доступ к каталогу данных XDG

source: Access subdirectories of the XDG runtime directory (where path is any subdirectory)
pt_br: Acesse subdiretórios do diretório XDG de runtimes (onde caminho é qualquer subdiretório)
ru: Доступ подкаталогии XDG Runtime Directory (где путь любой подкаталог)

source: Paths can be added to all the above filesystem options. For example, ``--filesystem=xdg-documents/path``. The following permission options can also be added:
pt_br: Os caminhos podem ser adicionados a todas as opções do sistema de arquivos acima. Por exemplo, ``--filesystem=xdg-documents/caminho``. As seguintes opções de permissão também podem ser adicionadas:
ru: Пути могут быть добавлены ко всем указанным выше параметрам файловой системы. Например, ``--filesystem=xdg-documents/path``. Также можно добавить следующие параметры разрешений:

source: ``:ro`` - read-only access
pt_br: ``:ro`` – acesso somente leitura
ru: ``:ro`` - доступ только для чтения

source: ``:rw`` - read/write access (this is the default)
pt_br: ``:rw`` – acesso de leitura/escrita (esse é o padrão)
ru: ``:rw`` - доступ для чтения/записи (по умолчанию)

source: ``:create`` - read/write access, and create the directory if it doesn't exist
pt_br: ``:create`` – acesso de leitura/escrita, e cria o diretório se ele não existir
ru: ``:create`` - доступ для чтения/записи и создание каталога, если он не существует

source: Footnotes
pt_br: Notas de rodapé
ru: Сноски

source: This is not necessarily required, but without it the X11 shared memory extension will not work, which is very bad for X11 performance.
pt_br: Não é necessariamente exigido, mas sem isso a extensão de memória compartilhada do X11 não funcionará, o que é muito ruim para o desempenho do X11.
ru: Это не обязательно, но без него расширение разделяемой памяти X11 не будет работать, что очень плохо для производительности X11.

source: Giving network access also grants access to all host services listening on abstract Unix sockets (due to how network namespaces work), and these have no permission checks. This unfortunately affects e.g. the X server and the session bus which listens to abstract sockets by default. A secure distribution should disable these and just use regular sockets.
pt_br: Conceder o acesso à rede também o faz a todos os serviços host que escutam soquetes abstratos do Unix (devido à maneira como os espaços de nomes de rede funcionam), e eles não têm verificação de permissão. Infelizmente, isso afeta, por exemplo, o servidor X e o barramento de sessão que atende soquetes abstratos por padrão. Uma distribuição segura deve desativá-los e usar soquetes regulares.
ru: Предоставление доступа к сети также предоставляет доступ ко всем службам хоста, прослушивающим абстрактные сокеты Unix (из-за того, как работают сетевые пространства имен), и для них нет проверок разрешений. К сожалению, это влияет, например, на X-сервер и сеансовую шину, которая по умолчанию прослушивает абстрактные сокеты. Безопасный дистрибутив должен отключить их и просто использовать обычные сокеты.

source: Except for the blacklisted paths mentioned in :doc:`sandbox-permissions`.
pt_br: Exceto pelos caminhos na lista negra mencionados em :doc:`sandbox-permissions`.
ru: За исключением черных списков, упомянутых в :doc:`sandbox-permissions`.
