Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/sandbox-permissions.po
Languages: ko, pt_br, ru, zh_cn

source: While not ideal, ``--device=all`` can be used to access devices like controllers or webcams.
pt_br: Embora não seja o ideal, ``--device=all`` pode ser usado para acessar dispositivos como controladores ou webcams.
ru: Хотя это и не совсем хорошо, ``--device=all`` можно использовать для доступа к таким устройствам, как контроллеры или веб-камеры.
zh_cn: 尽管不理想， `` --device=all `` 可以用来访问控制器和网络摄像头之类的设备。

source: dconf access
pt_br: Acesso a dconf
ru: доступ к dconf
zh_cn: dconf访问

source: As of xdg-desktop-portal 1.1.0 and glib 2.60.5 (in the runtime) you do not need direct DConf access in most cases.
pt_br: No xdg-desktop-portal 1.1.0 e glib 2.60.5 (no runtime), você não precisa de acesso direto ao DConf na maioria dos casos.
ru: По состоянию на xdg-desktop-portal 1.1.0 и glib 2.60.5 (во время выполнения) вам не нужен прямой доступ DConf в большинстве случаев.

source: As of now this glib version is included in ``org.freedesktop.Platform//19.08`` and ``org.gnome.Platform//3.34`` and newer.
pt_br: A partir de agora, esta versão do glib está incluída em ``org.freedesktop.Platform//19.08`` e ``org.gnome.Platform//3.34`` e mais novos.
ru: На данный момент эта версия glib включена в ``org.freedesktop.Platform//19.08`` and ``org.gnome.Platform//3.34`` и новее.

source: If an application existed prior to these runtimes you can tell Flatpak (>= 1.3.4) to migrate the DConf settings on the host into the sandbox by adding ``--metadata=X-DConf=migrate-path=/org/example/foo/`` to ``finish-args``. The path must be similar to your app-id or it will not be allowed (case is ignored and ``_`` and ``-`` are treated equal).
pt_br: Se um aplicativo existia antes desses runtimes, você pode dizer ao Flatpak (>= 1.3.4) para migrar as configurações do DConf no host para o sandbox, adicionando ``--metadata=X-DConf=migrate-path=/org/exemplo/foo/`` para ``finish-args``. O caminho deve ser semelhante ao seu ID de aplicativo ou não será permitido (não diferencia maiúsculo de minúsculo, e ``_`` e `` -`` são tratados da mesma forma).
ru: Если приложение существовало до этих runtimes, вы можете сообщить flatpak (>= 1.3.4), чтобы перенести настройки DConf на хосте в песочницу, добавив ``--metadata=X-DConf=migrate-path=/org/example/foo/`` в ``finish-args``. Путь должен быть похож на ваше ID приложения или его не допущено (случай игнорируется и ``_`` и ``-`` , обработанные одинаково).

source: If you are targeting older runtimes or require direct DConf access for other reasons you can use these permissions::
pt_br: Se você estiver direcionando runtimes mais antigos ou precisar de acesso direto ao DConf por outros motivos, poderá usar estas permissões::
ru: Если вы нацеливаете более старые runtimes или требуют прямых доступа DConf по другим причинам, вы можете использовать эти разрешения::

source: With those permissions glib will continue using dconf directly.
pt_br: Com essas permissões, o glib continuará usando o dconf diretamente.
ru: С этими разрешениями glib продолжит использовать dconf напрямую.

source: gvfs access
pt_br: Acesso a gvfs
ru: gvfs-доступ

source: As of gvfs 1.48, the gvfs daemons and applications use an on-disk socket to communicate, rather than an abstract socket so that the gvfs infrastructure still works when network support is disabled in the application's sandbox.
pt_br: A partir do gvfs 1.48, os daemons e aplicativos do gvfs usam um soquete no disco para se comunicar, em vez de um soquete abstrato, para que a infraestrutura do gvfs ainda funcione quando o suporte à rede estiver desabilitado no isolamento do aplicativo.
ru: Начиная с gvfs 1.48, демоны и приложения gvfs используют для связи сокет на диске, а не абстрактный сокет, поэтому инфраструктура gvfs продолжает работать, когда поддержка сети отключена в изолированной программной среде приложения.

source: A number of different options need to be passed depending on the application's use of gvfs.
pt_br: Várias opções diferentes precisam ser passadas dependendo do uso de gvfs do aplicativo.
ru: В зависимости от того, как приложение использует gvfs, необходимо передать ряд различных параметров.

source: ``--talk-name=org.gtk.vfs.*`` is necessary to talk to the gvfs daemons over D-Bus and list mounts using the GIO APIs.
pt_br: ``--talk-name=org.gtk.vfs.*`` é necessário para falar com os daemons do gvfs sobre D-Bus e listar montagens usando as APIs do GIO.
ru: ``--talk-name=org.gtk.vfs.*`` необходим для связи с демонами gvfs через D-Bus и составления списка подключений с использованием GIO APIs.

source: ``--filesystem=xdg-run/gvfsd`` is necessary to use the GIO APIs to list and access non-native files using the GIO APIs, using URLs rather than FUSE paths.
pt_br: ``--filesystem=xdg-run/gvfsd`` é necessário usar as APIs do GIO para listar e acessar arquivos não nativos usando as APIs do GIO, usando URLs em vez de caminhos FUSE.
ru: ``--filesystem=xdg-run/gvfsd`` необходимо использовать API-интерфейсы GIO для просмотра и доступа к неродным файлам с использованием API-интерфейсов GIO, используя URL-адреса, а не пути FUSE.

source: ``--filesystem=xdg-run/gvfs`` is necessary to give access to the FUSE mounts non-GIO and legacy applications can use. This is what will make native files appear under ``/run/user/`id -u`/gvfs/``.
pt_br: ``--filesystem=xdg-run/gvfs`` é necessário para dar acesso às montagens FUSE não-GIO e aplicativos legados podem usar. Isto é o que fará com que os arquivos nativos apareçam em ``/run/user/`id -u`/gvfs/``.
ru: ``--filesystem=xdg-run/gvfs`` необходим для предоставления доступа к монтированию FUSE, которое могут использовать не-GIO и устаревшие приложения. Это то, что заставит родные файлы появиться в ``/run/user/`id -u`/gvfs/``.

source: Typical GNOME and GTK applications should use::
pt_br: Os aplicativos GNOME e GTK típicos devem usar::
ru: Типичные приложения GNOME и GTK должны использовать::

source: Typical non-GNOME and non-GTK applications should use::
pt_br: Os aplicativos não-GNOME e não-GTK típicos devem usar::
ru: Типичные приложения, отличные от GNOME и GTK, должны использовать::

source: No application should be using ``--talk-name=org.gtk.vfs`` in its manifest, as there are no D-Bus services named ``org.gtk.vfs``.
pt_br: Nenhum aplicativo deve usar ``--talk-name=org.gtk.vfs`` em seu manifesto, pois não há serviços D-Bus chamados ``org.gtk.vfs``.
ru: Ни одно приложение не должно использовать ``--talk-name=org.gtk.vfs`` в своем манифесте, так как нет сервисов D-Bus с именем ``org.gtk.vfs``.

source: No access to any host files except the runtime, the app and ``~/.var/app/$APPID``. Only the last of these is writable.
zh_cn: 无法访问除runtime、app目录和 `` ~/.var/app/$APPID `` 目录以外的文件。而且只有最后一个目录（译者注：即 `` ~/.var/app/$APPID `` 目录）有写权限。

source: Portals have already been mentioned in the :doc:`introduction`. They are a framework for providing access to resources outside of the sandbox, including:
zh_cn: 门户已经在 :doc:`introduction`提到过。他们是一个提供沙箱外资源访问的框架。包括这些资源：

source: Interface toolkits like GTK3 and Qt5 implement transparent support for portals, meaning that applications don't need to any additional work to use them (it is worth checking which portals each toolkit supports). Applications that aren't using a toolkit with support for portals can refer to the `xdg-desktop-portal API documentation <https://flatpak.github.io/xdg-desktop-portal/portal-docs.html>`_ for information on how to use them.
zh_cn: 像GTK3和Qt5这样的接口工具包实现了对门户的透明支持，这意味着应用程序不需要做任何额外的工作来使用它们(每个工具包支持哪些门户值得了解)。没有使用受支持工具包的应用可以参考`xdg-desktop-portal API 文档 <https://flatpak.github.io/xdg-desktop-portal/portal-docs.html>`_。

source: Talk permissions can be freely used, although it is recommended to use the minumum required.
zh_cn: Talk权限可以自由使用，尽管如此还是推荐使用应用所需的最小权限。

source: It is common for applications to require access to different parts of the host filesystem,and Flatpak provides a flexible set of options for this. Some examples include:
zh_cn: 应用要求范围主机文件系统的不同部分是很正常的，flatpak为此提供了一套灵活的选项。下面是一些例子：

source: As a general rule, Filesystem access should be limited as much as possible. This includes using:
zh_cn: 作为一个通用规则，对文件系统的访问应该尽可能地进行限制。这包括：

source: The full list the available filesystem options can be found in the :doc:`sandbox-permissions-reference`. Other filesystem access guidelines include:
zh_cn: 完整的文件系统可用选项列表可以在 :doc:`sandbox-reference`找到。其它文件系统访问指南包含：

source: Sandbox permissions can be configured from an application manifest (see :doc:`manifests`). They can also be set with the ``build-finish``, ``run`` and ``override`` commands.
ko: 샌드박스 권한은 응용프로그램의 manifest파일에서 설정할 수 있다(:doc:`manifests` 참조). 또한 ``build-finish``, ``run``, ``override``명령을 이용하여 설정할 수 있다.

source: Permission options
ko: 권한 옵션

source: The following list includes some of the most useful permission options. The full list can be viewed using ``flatpak build-finish --help``
ko: 유용한 권한 설정 옵션을 다음 목록에 열거하였다. 전체 목록은 ``flatpak build-finish —help`` 명령을 통해 볼 수 있다.

source: Access all files
ko: 모든 파일에 접근

source: Access the home directory
ko: 홈 디렉토리 접근

source: Access the home directory, read-only
ko: 홈 디렉토리 읽기 접근

source: Access paths
ko: 디렉토리 경로 접근

source: Access the XDG download directory
ko: XDG 다운로드 디렉토리 접근

source: Undo some of the above
ko: 위 옵션 중 일부를 철회

source: Show windows using X11 [#f1]_
ko: X11 [#f1]_ 을 이용하여 윈도우 표시

source: OpenGL rendering
ko: OpenGL 렌더링

source: Show windows using Wayland
ko: Wayland를 이용하여 윈도우 표시

source: Play sounds using PulseAudio
ko: PulseAudio를 이용하여 소리 재생

source: Access the network [#f2]_
ko: 네트워크 [#f2]_ 접근

source: Talk to a named service on the session bus
ko: 세션 버스 상에서 이름으로 지정 가능한 (네임드, named) 서비스와 통신

source: Talk to a named service on the system bus
ko: 시스템 버스 상의 네임드 서비스와 통신

source: Unlimited access to all of D-Bus
ko: 모든 D-Bus에 대한 자유로운 접근

source: Until a sandbox-compatible backend is available, access to dconf needs to be enabled using the following options::
ko: 다음과 같은 옵션을 통해, 샌드박스 호환가능한 백엔드(backend)가 지원될 때까지 dconf에 대한 접근을 활성화할 수 있다::

source: Footnotes
ko: 각주

source: ``--share=ipc`` means that the sandbox shares IPC namespace with the host. This is not necessarily required, but without it the X shared memory extension will not work, which is very bad for X performance.
ko: ``—share=ipc`` 는 샌드박스가 호스트와 IPC 네임스페이스를 공유하도록 한다. 필수적이지는 않지만, 공유를 허용하지 않을 경우 X 공유메모리 확장이 제대로 동작하지 않아 성능이 저하될 수 있다.

source: Giving network access also grants access to all host services listening on abstract Unix sockets (due to how network namespaces work), and these have no permission checks. This unfortunately affects e.g. the X server and the session bus which listens to abstract sockets by default. A secure distribution should disable these and just use regular sockets.
ko: 네트워크 접근을 허용하면 (네트워크 namespaces의 동작 원리 상) 추상 유닉스 소켓(abstract Unix socket)을 사용하여 대기 중인 호스트 서비스로의 접근을 모두 허용하게 되고, 이러한 접근 시 권한을 검사하지 않게된다. 이 결과, 불행하게도, 기본적으로 추상 소켓을 열어 대기하는 X 서버와 세션 버스에 영향을 준다. 보안에 민감한 경우, 이들을 비활성화(disable)하고 일반 소켓을 사용하도록 할 필요가 있다.
