Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/sandbox-permissions.po
Languages: ko, pt_br, ru, zh_cn

source: Sandbox Permissions
ko: 샌드박스 권한
pt_br: Permissões de sandbox
ru: Разрешения песочницы
zh_cn: 沙箱权限

source: One of Flatpak's main goals is to increase the security of desktop systems by isolating applications from one another. This is achieved using sandboxing and means that, by default, applications that are run with Flatpak have extremely limited access to the host environment. This includes:
pt_br: Um dos principais objetivos do Flatpak é aumentar a segurança dos sistemas de desktop, isolando os aplicativos uns dos outros. Isso é alcançado usando sandbox e significa que, por padrão, os aplicativos executados com o Flatpak têm acesso extremamente limitado ao ambiente host. Isso inclui:
ru: Одна из основных целей Flatpak - повысить безопасность настольных систем за счет изоляции приложений друг от друга. Это достигается с помощью песочницы и означает, что по умолчанию приложения, запускаемые с Flatpak, имеют чрезвычайно ограниченный доступ к среде хоста. Это включает:
zh_cn: flatpak的一个主要目标就是通过应用间的隔离来提高桌面系统的安全性。这通过使用沙箱来实现，默认地，应用运行的环境对主机的访问很有限。这包括：

source: No access to any host files except the runtime, the app, ``~/.var/app/$FLATPAK_ID``, and ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID``. Only the latter two being writable.
pt_br: Sem acesso a nenhum arquivo host, exceto o runtime, o aplicativo e ``~/.var/app/$FLATPAK_ID`` e ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID``. Apenas o último deles pode ser escrito.
ru: Нет доступа к каким-либо файлам хоста, кроме среды выполнения, приложения, ``~/.var/app/$FLATPAK_ID``, and ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID``. Только два последних доступны для записи.

source: No access to the network.
pt_br: Sem acesso à rede.
ru: Нет доступа к сети.
zh_cn: 无法访问网络。

source: No access to any device nodes (apart from ``/dev/null``, etc).
pt_br: Sem acesso a nenhum nó do dispositivo (além de ``/dev/null``, etc).
ru: Нет доступа к каким-либо узлам устройства (кроме ``/dev/null``, etc).
zh_cn: 无法访问任何设备节点的（除了 `` /dev/null `` ，等等）。（译者注：可能有访问所有null设备的权限）

source: No access to processes outside the sandbox.
pt_br: Sem acesso a processos fora do sandbox.
ru: Нет доступа к процессам вне песочницы.
zh_cn: 无法访问沙箱之外进程

source: Limited syscalls. For instance, apps can't use nonstandard network socket types or ptrace other processes.
pt_br: Chamadas de sistema limitados. Por exemplo, os aplicativos não podem usar tipos de soquete de rede fora do padrão ou rastrear outros processos.
ru: Ограниченные счета. Например, приложения не могут использовать нестандартные типы сетевых сокетов или отслеживать другие процессы ptrace.
zh_cn: 有限的系统调用。举个例子，应用无法使用非标准的网络socket或者ptrace其他进程。

source: Limited access to the session D-Bus instance - an app can only own its own name on the bus.
pt_br: Acesso limitado à instância do D-Bus da sessão – um aplicativo pode possuir apenas seu próprio nome no barramento.
ru: Ограниченный доступ к экземпляру сеанса D-Bus - приложение может владеть только собственным именем на шине.
zh_cn: 有限地访问D-Bus实例的session——一个应用在总线上只能拥有它自己的名字。

source: No access to host services like X11, system D-Bus, or PulseAudio.
pt_br: Sem acesso a serviços de host como X11, D-Bus do sistema ou PulseAudio.
ru: Нет доступа к хост-службам, таким как X11, системный D-Bus или PulseAudio.
zh_cn: 无法访问主机服务，像X11，system D-Bus或PulseAudio这些。

source: Most applications will need access to some of these resources in order to be useful. This is primarily done during the finishing build stage, which can be configured through the ``finish-args`` section of the manifest file (see :doc:`manifests`).
pt_br: A maioria dos aplicativos precisará acessar alguns desses recursos para ser útil. Isso é feito principalmente durante o estágio de compilação de acabamento, que pode ser configurado através da seção ``finish-args`` do arquivo de manifesto (consulte :doc:`manifests`).
ru: Большинству приложений, чтобы быть полезными, потребуется доступ к некоторым из этих ресурсов. В первую очередь это делается на этапе завершающей сборки, который можно настроить в разделе ``finish-args`` файла манифеста (см. :doc:`manifestests`).
zh_cn: 大部分应用需要访问这些资源。这些主要是在finishing构建步骤完成的，通过清单文件（查看 :doc:`manifests`）的 `` finish-args `` 部分来配置。

source: Portals
pt_br: Portais
ru: Порталы
zh_cn: 门户（译者注：英文portals）

source: Portals have already been mentioned in :doc:`basic-concepts`. They are a framework for providing access to resources outside of the sandbox, including:
pt_br: Os portais já foram mencionados em :doc:`basic-concepts`. Eles são um framework para fornecer acesso a recursos fora da área isolada, incluindo:
ru: Порталы уже упоминались в :doc:`basic-concepts`. Они представляют собой основу для предоставления доступа к ресурсам за пределами песочницы, в том числе:

source: Opening files with a native file chooser dialog
pt_br: Abertura de arquivos com um diálogo nativo de seleção de arquivos
ru: Открытие файлов с помощью собственного диалогового окна выбора файлов
zh_cn: 用一个本地的文件选择对话框打开文件

source: Opening URIs
pt_br: Abertura de URLs
ru: Открытие URIs
zh_cn: 打开URL

source: Printing
pt_br: Impressão
ru: Печать
zh_cn: 打印

source: Showing notifications
pt_br: Mostrar notificações
ru: Отображение уведомлений
zh_cn: 显示通知

source: Taking screenshots
pt_br: Obtenção de capturas de tela
ru: Снятие скриншотов
zh_cn: 截取屏幕

source: Inhibiting the user session from ending, suspending, idling or getting switched away
pt_br: Inibir que a sessão do usuário seja encerrada, suspensa, fique inativa ou seja trocada
ru: Запрет пользовательского сеанса на завершение, приостановку, простой или отключение
zh_cn: 禁止用户会话结束、暂停、空转或切换。

source: Getting network status information
pt_br: Obtendo informações de status da rede
ru: Получение информации о состоянии сети
zh_cn: 获取网络状态信息

source: In many cases, portals use a system component to implicitly ask the user for permission before granting access to a particular resource. For example, in the case of opening a file, the user's selection of a file using the file chooser dialog is interpreted as implicitly granting the application access to whatever file is chosen.
pt_br: Em muitos casos, portais usam um componente do sistema para pedir implicitamente permissão ao usuário antes de conceder acesso a um recurso específico. Por exemplo, no caso de abrir um arquivo, a seleção de um arquivo pelo usuário usando a caixa de diálogo do seletor de arquivos é interpretada como concedendo implicitamente ao aplicativo o acesso a qualquer arquivo escolhido.
ru: Во многих случаях порталы используют системный компонент, чтобы неявно запрашивать разрешение у пользователя перед предоставлением доступа к определенному ресурсу. Например, в случае открытия файла выбор файла пользователем с помощью диалогового окна выбора файла интерпретируется как неявное предоставление приложению доступа к любому выбранному файлу.
zh_cn: 在许多情况下，门户通过使用系统组件在获取访问某些特定资源的权限之前隐式地向用户获得了许可。举个例子，在打开一个文件的时候，用户用文件选择对话框进行文件选择，可以理解为隐式地授予了应用对选中文件的访问。

source: This approach enables applications to avoid having to configure blanket access to large amounts of data or services and gives users control over what their applications have access to.
pt_br: Essa abordagem permite que os aplicativos evitem configurar o acesso geral a grandes quantidades de dados ou serviços e oferece aos usuários controle sobre o que seus aplicativos têm acesso.
ru: Такой подход позволяет приложениям избежать необходимости настраивать общий доступ к большим объемам данных или службам и дает пользователям контроль над тем, к чему их приложения имеют доступ.

source: Interface toolkits like GTK3 and Qt5 implement transparent support for portals, meaning that applications don't need to do any additional work to use them (it is worth checking which portals each toolkit supports). Applications that aren't using a toolkit with support for portals can refer to the `xdg-desktop-portal API documentation <https://flatpak.github.io/xdg-desktop-portal/portal-docs.html>`_ for information on how to use them.
pt_br: Os kits de ferramentas de interface como GTK3 e Qt5 implementam suporte transparente a portais, o que significa que os aplicativos não precisam fazer nenhum trabalho adicional para usá-los (vale a pena verificar quais portais cada kit de ferramentas suporta). Os aplicativos que não estão usando um kit de ferramentas com suporte para portais podem consultar a `documentação da API do xdg-desktop-portal <https://flatpak.github.io/xdg-desktop-portal/portal-docs.html>`_ para informações sobre como usá-los.
ru: Наборы инструментов интерфейса, такие как GTK3 и Qt5, реализуют прозрачную поддержку порталов, а это означает, что приложениям не требуется дополнительной работы для их использования (стоит проверить, какие порталы поддерживает каждый набор инструментов). Приложения, которые не используют инструментарий с поддержкой порталов, могут обратиться к документации `xdg-desktop-portal API <https://flatpak.github.io/xdg-desktop-portal/portal-docs.html>`_ для получения информации о том, как их использовать.

source: Permissions guidelines
pt_br: Diretrizes de permissões
ru: Рекомендации по разрешениям
zh_cn: 权限手册

source: While application developers have control over the sandbox permissions they wish to configure, good practice is encouraged and can be enforced. For example, the Flathub hosting service places requirements on which permissions can be used, and software on the host may warn users if certain permissions are used.
pt_br: Embora os desenvolvedores de aplicativos tenham controle sobre as permissões do sandbox que desejam configurar, as boas práticas são incentivadas e podem ser aplicadas. Por exemplo, o serviço de hospedagem Flathub impõe requisitos nos quais as permissões podem ser usadas, e o software no host pode avisar os usuários se determinadas permissões forem usadas.
ru: Хотя разработчики приложений имеют контроль над разрешениями песочницы, которые они хотят настроить, рекомендуется применять передовые методы, которые могут применяться. Например, служба хостинга Flathub предъявляет требования к тому, какие разрешения могут использоваться, а программное обеспечение на хосте может предупреждать пользователей, если используются определенные разрешения.
zh_cn: 虽然应用程序开发人员可以控制他们想要配置的沙箱权限，但是鼓励进行良好的实践。举个例子，Flathub主机托管服务对权限的使用提出了要求，如果使用了某些权限，主机上的软件可能会警告用户。

source: The following guidelines describe which permissions can be freely used, which can be used on an as-needed basis, and which should be avoided.
pt_br: As diretrizes a seguir descrevem quais permissões podem ser usadas livremente, quais podem ser usadas conforme a necessidade e quais devem ser evitadas.
ru: Следующие рекомендации описывают, какие разрешения можно использовать свободно, какие можно использовать по мере необходимости, а каких следует избегать.
zh_cn: 后面的手册描述了哪些权限可以任意使用，哪些可以根据需要使用，哪些应该避免使用。

source: Standard permissions
pt_br: Permissões padrão
ru: Стандартные разрешения
zh_cn: 标准权限

source: The following permissions provide access to basic resources that applications commonly require, and can therefore be freely used:
pt_br: As seguintes permissões fornecem acesso aos recursos básicos que os aplicativos geralmente exigem e, portanto, podem ser usados livremente:
ru: Следующие разрешения обеспечивают доступ к основным ресурсам, которые обычно требуются приложениям и поэтому могут быть свободно использованы:
zh_cn: 以下权限提供了应用通常需要访问的基本资源，因此可以自由使用：

source: ``--share=network`` - access the network
pt_br: ``--share=network`` – acessa a rede
ru: ``--share=network`` - доступ к сети
zh_cn: `` --share=network `` - 访问网络

source: ``--socket=x11`` - show windows using X11
pt_br: ``--socket=x11`` – mostra janelas usando X11
ru: ``--socket=x11`` - показать окна с помощью X11
zh_cn: `` --socket=x11 `` - 用X11显示窗口

source: ``--socket=fallback-x11`` - show windows using X11, if Wayland is not available, overrides ``x11`` socket permission. Note that you must still use ``--socket=wayland`` for wayland permission
pt_br: ``--socket=fallback-x11`` - mostra janelas usando X11, se Wayland não estiver disponível, substitui a permissão de soquete ``x11``. Observe que você ainda deve usar ``--socket=wayland`` para permissão de wayland
ru: ``--socket=fallback-x11`` - показывать окна с использованием X11, если Wayland недоступен, переопределяет разрешение сокета ``x11``. Обратите внимание, что вы все равно должны использовать ``--socket=wayland`` для разрешения wayland

source: ``--share=ipc`` - share IPC namespace with the host (necessary for X11)
pt_br: ``--share=ipc`` – compartilha espaço de nome IPC com o host (necessário para X11)
ru: ``--share=ipc`` - совместно использовать пространство имен IPC с хостом (необходимо для X11)
zh_cn: `` --share=ipc `` - 和主机共享IPC命名空间 (对于X11是必要的)

source: ``--socket=wayland`` - show windows with Wayland
pt_br: ``--socket=wayland`` – mostra janelas com Wayland
ru: ``--socket=wayland`` - показать окна Wayland
zh_cn: `` --socket=wayland `` - 使用Wayland显示窗口

source: ``--device=dri`` - OpenGL rendering
pt_br: ``--device=dri`` – renderização OpenGL
ru: ``--device=dri`` - отрисовка OpenGL
zh_cn: `` --device=dri `` - OpenGL 渲染

source: ``--socket=pulseaudio`` - play sound with PulseAudio
pt_br: ``--socket=pulseaudio`` – reproduz som com PulseAudio
ru: ``--socket=pulseaudio`` - воспроизводить звук с PulseAudio
zh_cn: `` --socket=pulseaudio `` - 使用PulseAudio播放音频

source: D-Bus access
pt_br: Acesso a D-Bus
ru: Доступ к D-Bus
zh_cn: D-Bus访问

source: Access to the entire bus with ``--socket=system-bus`` or ``--socket=session-bus`` should be avoided, unless the application is a development tool.
pt_br: O acesso a todo o barramento com ``--socket=system-bus`` ou ``--socket=session-bus`` deve ser evitado, a menos que o aplicativo seja uma ferramenta de desenvolvimento.
ru: Следует избегать доступа ко всей шине с помощью ``--socket=system-bus`` или ``--socket=session-bus`` если только приложение не является инструментом разработки.
zh_cn: 避免使用 `` --socket=system-bus `` 或 `` --socket=session-bus `` 访问整个总线，除非应用是一个开发工具。

source: **Ownership**
pt_br: **Propriedade**
ru: **Право собственности**

source: Applications are automatically granted access to their own namespace. Ownership beyond this is typically unnecessary, although there are a small number of exceptions, such as using `MPRIS to provide media controls <https://www.freedesktop.org/wiki/Specifications/mpris-spec/>`_.
pt_br: Os aplicativos recebem acesso automaticamente ao seu próprio espaço de nome. A propriedade além disso é normalmente desnecessária, embora haja um pequeno número de exceções, como o uso de `MPRIS para fornecer controles de mídia <https://www.freedesktop.org/wiki/Specifications/mpris-spec/>`_.
ru: Приложениям автоматически предоставляется доступ к их собственному пространству имен. Право собственности сверх этого обычно не требуется, хотя есть небольшое количество исключений, таких как использование `MPRIS для обеспечения управления мультимедиа <https://www.freedesktop.org/wiki/Specifications/mpris-spec/>`_.
zh_cn: 应用会自动为他们自己命名空间授予访问权限，通常不需要有所有权，尽管如此还是有少量的例外，例如使用`MPRIS来提供媒体控制`<https://www.freedesktop.org/wiki/Specifications/mpris-spec/>`_。

source: **Talk**
pt_br: **Conversa**
ru: **Разговор**

source: Talk permissions can be freely used, although it is recommended to use the minimum required.
pt_br: As permissões de conversa podem ser usadas livremente, embora seja recomendável usar o mínimo necessário.
ru: Разрешения на разговоры можно использовать свободно, хотя им рекомендуется пользоваться минимально.

source: Filesystem access
pt_br: Acesso ao sistema de arquivos
ru: Доступ к файловой системе
zh_cn: 文件系统访问

source: It is common for applications to require access to different parts of the host filesystem, and Flatpak provides a flexible set of options for this. Some examples include:
pt_br: É comum que os aplicativos exijam acesso a diferentes partes do sistema de arquivos host, e o Flatpak fornece um conjunto flexível de opções para isso. Alguns exemplos incluem:
ru: Обычно приложениям требуется доступ к разным частям файловой системы хоста, и Flatpak предоставляет для этого гибкий набор опций. Вот некоторые примеры:

source: ``--filesystem=host`` - access normal files on the host, not including host os or system internals described below
pt_br: ``--filesystem=host`` – acessa arquivos normais no host, sem incluir o sistema operacional do host ou componetnes internos do sistema descritos abaixo
ru: ``--filesystem=host`` - доступ к обычным файлам на хосте, за исключением операционной системы хоста или внутренних систем, описанных ниже
zh_cn: `` --filesystem=host `` - 访问主机的常规文件，不包含一下提到的主机操作系统或者系统内部

source: ``--filesystem=home`` - access the user's home directory
pt_br: ``--filesystem=home`` – acessa a pasta pessoal (home) do usuário
ru: ``--filesystem=home`` - доступ к домашнему каталогу пользователя
zh_cn: `` --filesystem=home `` - 访问用户home目录

source: ``--filesystem=/path/path`` - access specific paths
pt_br: ``--filesystem=/caminho/caminho`` – acessa caminhos específicos
ru: ``--filesystem=/path/path`` - доступ к определенным путям
zh_cn: `` --filesystem=/path/path `` - 访问特定路径

source: ``--filesystem=xdg-download`` - access a specific XDG folder
pt_br: ``--filesystem=xdg-download`` – acessa uma pasta XDG específica
ru: ``--filesystem=xdg-download`` - доступ к определенной папке XDG
zh_cn: `` --filesystem=xdg-download `` - 访问特定的XDG文件夹

source: As a general rule, Filesystem access should be limited as much as possible. This includes:
pt_br: Como regra geral, o acesso ao sistema de arquivos deve ser limitado o máximo possível. Isso inclui o uso de:
ru: Как правило, доступ к файловой системе должен быть максимально ограничен. Это включает:

source: Using portals as an alternative to blanket filesystem access, wherever possible.
pt_br: Usar portais como uma alternativa ao acesso geral ao sistema de arquivos, sempre que possível
ru: Использование порталов в качестве альтернативы общему доступу к файловой системе везде, где это возможно.
zh_cn: 尽量使用门户来代替文件系统访问。

source: Using read-only access wherever possible, using the ``:ro`` option.
pt_br: Usar acesso somente leitura sempre que possível, usando a opção ``:ro``.
ru: Использование доступа только для чтения везде, где это возможно, с использованием параметра ``:ro``.
zh_cn: 尽量使用读取权限来访问，使用 `` :ro `` 选项。

source: If some home directory access is absolutely required, using XDG directory access only.
pt_br: Se for absolutamente necessário algum acesso à pasta pessoal do usuário, usar apenas o acesso ao diretório XDG.
ru: Если точно необходим доступ к домашнему каталогу, используйте только доступ к каталогу XDG.
zh_cn: 如果一定要访问home目录，只使用XDG目录访问。

source: The full list of available filesystem options can be found in the :doc:`sandbox-permissions-reference`. Other filesystem access guidelines include:
pt_br: A lista completa das opções disponíveis do sistema de arquivos pode ser encontrada em :doc:`sandbox-permissions-reference`. Outras diretrizes de acesso ao sistema de arquivos incluem:
ru: Полный список доступных параметров файловой системы можно найти в :doc:`sandbox-permissions-reference`. Другие правила доступа к файловой системе включают:

source: The ``--persist=path`` option can be used to map paths from the user's home directory into the sandbox filesystem. This makes it possible to avoid configuring access to the entire home directory, and can be useful for applications that hardcode file paths in ``~/``.
pt_br: A opção ``--persist=path`` pode ser usada para mapear caminhos do diretório inicial do usuário para o sistema de arquivos sandbox. Isso torna possível evitar a configuração do acesso a todo o diretório pessoal e pode ser útil para aplicativos que codificam os caminhos do arquivo em ``~/``.
ru: Параметр ``--persist=path`` может использоваться для отображения путей из домашнего каталога пользователя в файловую систему песочницы. Это позволяет избежать настройки доступа ко всему домашнему каталогу и может быть полезно для приложений, которые жестко шифруют пути к файлам в ``~/``.
zh_cn: `` --persist=path `` 选项可以用来将用户目录映射到沙箱的文件系统。这可以避免配置整个home目录访问权限。并且对于在硬编码使用 `` ~/ `` 文件路径的应用程序非常有用。

source: If an application uses ``$TMPDIR`` to contain lock files you may want to add a wrapper script that sets it to ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID``.
pt_br: Se um aplicativo usa ``$TMPDIR`` para conter arquivos de trava, você pode querer adicionar um script wrapper que o defina como ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID``.
ru: Если приложение использует ``$TMPDIR`` , чтобы содержать файлы блокировки, вы можете добавить скрипт обертки, который устанавливает его на ``$XDG_RUNTIME_DIR/app/$FLATPAK_ID``.

source: Retaining and sharing configuration with non-Flatpak installations is to be avoided.
pt_br: Reter e compartilhar a configuração com instalações que não sejam do Flatpak deve ser evitado.
ru: Сохранение и совместное использование конфигурация с установкой отличной от Flatpak следует избегать.
zh_cn: 应该避免与非flatpak安装的应用共享配置。

source: As mentioned above the ``host`` option does not actually provide complete access to the host filesystem. The main rules are:
pt_br: Como mencionado acima, a opção ``host`` na verdade não fornece acesso completo ao sistema de arquivos host. As principais regras são:
ru: Как упоминалось выше, опция ``host`` фактически не обеспечивает полный доступ к файловой системе хоста. Основные правила:
zh_cn: 如上所述， `` host `` 选项实际上没有提供主机文件系统的完整访问。主要的规则是：

source: These directories are blacklisted: ``/lib``, ``/lib32``, ``/lib64``, ``/bin``, ``/sbin``, ``/usr``, ``/boot``, ``/root``, ``/tmp``, ``/etc``, ``/app``, ``/run``, ``/proc``, ``/sys``, ``/dev``, ``/var``
pt_br: Esses diretórios estão na lista negra: ``/lib``, ``/lib32``, ``/lib64``, ``/bin``, ``/sbin``, ``/usr``, ``/boot``, ``/root``, ``/tmp``, ``/etc``, ``/app``, ``/run``, ``/proc``, ``/sys``, ``/dev``, ``/var``
ru: Эти каталоги занесены в черный список: ``/lib``, ``/lib32``, ``/lib64``, ``/bin``, ``/sbin``, ``/usr``, ``/boot``, ``/root``, ``/tmp``, ``/etc``, ``/app``, ``/run``, ``/proc``, ``/sys``, ``/dev``, ``/var``
zh_cn: 这些目录是屏蔽掉的： `` /lib `` , `` /lib32 `` , `` /lib64 `` , `` /bin `` , `` /sbin `` , `` /usr `` , `` /boot `` , `` /root `` , `` /tmp `` , `` /etc `` , `` /app `` , `` /run `` , `` /proc `` , `` /sys `` , `` /dev `` , `` /var ``

source: Exceptions from the blacklist: ``/run/media``
pt_br: Exceções da lista de negra: ``/run/media``
ru: Исключения из черного списка: ``/run/media``
zh_cn: `` /run/media `` 例外

source: These directories are mounted under ``/var/run/host``: ``/etc``, ``/usr``
pt_br: Esses diretórios são montados sob ``/var/run/host``: ``/etc``, ``/usr``
ru: Эти каталоги смонтированы в ``/var/run/host``: ``/etc``, ``/usr``
zh_cn: 这些目录被挂载到 `` /var/run/host `` : `` /etc `` ， `` /usr ``

source: The reason many of the directories are blacklisted is because they already exist in the sandbox such as ``/usr`` or are not usable in the sandbox.
pt_br: A razão pela qual muitos diretórios estão na lista negra é porque eles já existem no sandbox, como ``/usr`` ou não são usáveis no sandbox.
ru: Причина, по которой многие каталоги занесены в черный список, заключается в том, что они уже существуют в песочнице, например, ``/usr`` или не могут использоваться в песочнице.
zh_cn: 许多目录被屏蔽的原因是他们已经在沙箱里存在了：例如 `` /usr `` 或者是一些在沙箱中不可用的目录。

source: The ``home`` permission also has exceptions as it does not grant access to the subdirectories for other applications in ``~/.var/app/``.
pt_br: A permissão ``home`` também tem exceções, pois ela não concede acesso aos subdiretórios para outros aplicativos em ``~/.var/app/``.
ru: Разрешение ``home`` также имеет исключения, поскольку оно не предоставляет доступ к подкаталогам для других приложений в ``~/.var/app/``.

source: Device access
pt_br: Acesso a dispositivo
ru: Доступ к устройству
zh_cn: 设备访问
