Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/tips-and-tricks.po
Languages: pt_br, ru

source: Tips and Tricks
pt_br: Dicas e truques
ru: Секреты и хитрости

source: This page explains a few useful features of the Flatpak CLI.
pt_br: Esta página explica alguns recursos úteis da CLI do Flatpak.
ru: Эта страница объясняет несколько полезных функций Flatpak CLI.

source: Testing an app with a different runtime
pt_br: Testando um aplicativo com um runtime diferente
ru: Тестирование приложения с другой средой выполнения

source: You can (for testing) run an application with a different runtime than it typically uses. For instance, to run stable gedit with the latest unstable gnome runtime you can do::
pt_br: Você pode (para testar) executar um aplicativo com um runtime diferente do que normalmente usa. Por exemplo, para executar o gedit estável com o ultimo runtime instável do GNOME, você pode::
ru: Вы можете (для тестирования) запустить приложение с другой средой выполнения, чем обычно. Например, чтобы запустить стабильный gedit с последней нестабильной средой выполнения gnome, вы можете сделать::

source: You can also use a completely different runtime (but same version number)::
pt_br: Você também pode usar um runtime completamente diferente (mas o mesmo número de versão)::
ru: Вы также можете использовать совершенно другую среду выполнения (но с тем же номером версии)::

source: If you just want to use the sdk instead of the platform like the above, a better approach is to use ``-d``.
pt_br: Se você deseja apenas usar o sdk em vez da plataforma como a acima, uma abordagem melhor é usar ``-d``.
ru: Если вы просто хотите использовать SDK вместо платформы, подобной указанной выше, лучше использовать ``-d``.

source: Running against a runtime with a completely different ABI is undefined and unsupported behavior.
pt_br: A execução em um runtime com uma ABI completamente diferente é um comportamento indefinido e sem suporte.
ru: Работа со средой выполнения с совершенно другим ABI является неопределенным и неподдерживаемым поведением.

source: Downgrading
pt_br: Fazendo downgrade
ru: Откат

source: It is possible to downgrade an installed application (or runtime) to an older build.
pt_br: É possível fazer o downgrade de um aplicativo instalado (ou runtime) para uma compilação mais antiga.
ru: Можно понизить версию установленного приложения (или среды выполнения) до более старой сборки.

source: First you look for the commit you are interested in::
pt_br: Primeiro você procura o commit no qual está interessado::
ru: Сначала вы ищите интересующий вас коммит::

source: Then you deploy the commit::
pt_br: Então, você implanta o commit::
ru: Затем вы развертываете коммит::

source: The example here uses ``sudo`` for system installations because, unlike normal updates, downgrades are considered a privileged action. If the application is installed per-user you would run it as that user.
pt_br: O exemplo aqui usa o ``sudo`` para instalações do sistema porque, diferentemente das atualizações normais, os downgrades são considerados uma ação privilegiada. Se o aplicativo for instalado por usuário, você o executará como esse usuário.
ru: В этом примере для установки системы используется ``sudo``, потому что, в отличие от обычных обновлений, переход на более раннюю версию считается привилегированным действием. Если приложение установлено для каждого пользователя, вы должны запустить его от имени этого пользователя.

source: If you have Flatpak 1.5.0 or later, you can also prevent the app from being included in updates (either manual or automatic)::
pt_br: Se você possui o Flatpak 1.5.0 ou posterior, também pode impedir que o aplicativo seja incluído nas atualizações (manuais ou automáticas)::

source: Bisecting regressions in application builds
pt_br: Fazendo bisect em regressões em compilações de aplicativos
ru: Поперечная регрессия в сборках приложений

source: In case the newest builds of an application introduce regressions, you can use ``flatpak-bisect`` to discover which commit introduced the regression. It works just like ``git bisect``.
pt_br: Caso as versões mais recentes de um aplicativo introduzam regressões, você pode usar ``flatpak-bisect`` para descobrir qual commit introduziu a regressão. Funciona como ``git bisect``.
ru: В случае, если новейшие сборки приложения вызывают регрессию, вы можете использовать команду flatpak-bisect, чтобы узнать, какая фиксация привела к регрессии. Он работает так же, как ``git bisect``.

source: In case your distribution doesn't install the ``flatpak-bisect`` utility, you can find it distributed alongside the Flatpak source code, in https://github.com/flatpak/flatpak/blob/main/scripts/flatpak-bisect
pt_br: Caso sua distribuição não instale o utilitário `` flatpak-bisect``, você poderá encontrá-lo distribuído juntamente com o código-fonte Flatpak, em https://github.com/flatpak/flatpak/blob/main/scripts/flatpak-bisect
ru: Если ваш дистрибутив не устанавливает утилиту ``flatpak-bisect``, вы можете найти ее вместе с исходным кодом Flatpak по адресу: https://github.com/flatpak/flatpak/blob/main/scripts/flatpak-bisect

source: First you update the application and get its history::
pt_br: Primeiro, você atualiza o aplicativo e obtém seu histórico::
ru: Сначала вы обновляете приложение и получаете его историю::

source: Then, you should set the current commit as the first bad commit::
pt_br: Em seguida, você deve definir o commit atual como o primeiro commit incorreto::
ru: Затем вы должны установить текущий коммит как первый ошибочный коммит::

source: Now you need to find the hash of the first known good commit. For that, you can see the build history by running::
pt_br: Agora você precisa encontrar o hash do primeiro bom commit conhecido. Para isso, você pode ver o histórico da compilação executando::
ru: Теперь вам нужно найти хеш первого удачного коммита. Для этого вы можете просмотреть историю сборки, запустив::

source: To start bisecting, checkout the first known good commit you find::
pt_br: Para começar a dividir, faça o checkout do primeiro commit conhecido que você encontrar::
ru: Чтобы начать деление пополам, проверьте первый известный удачный коммит, который вы найдете::

source: After setting the bad commit and the first known good commit, you can launch the application to verify if the current commit in the bisecting session is a good or a bad one.
pt_br: Após definir o commit incorreto e o primeiro commit válido, é possível iniciar o aplicativo para verificar se o commit atual na sessão de divisão é bom ou ruim.
ru: После установки плохой фиксации и первой известной хорошей фиксации вы можете запустить приложение, чтобы проверить, является ли текущая фиксация в сеансе разделения на две части: хорошей или плохой.

source: To mark a commit as good or bad, run::
pt_br: Para marcar um commit como bom ou ruim, execute::
ru: Чтобы пометить фиксацию как хорошую или плохую, запустите::

source: Or::
pt_br: Ou::
ru: Или::

source: ``flatpak-bisect`` will inform you when the first bad commit is found.
pt_br: ``flatpak-bisect`` vai lhe informar quando o primeiro commit ruim for encontrado.
ru: ``flatpak-bisect`` сообщит вам, когда будет обнаружена первая плохая фиксация.

source: Adding a custom installation
pt_br: Adicionando uma instalação personalizada
ru: Добавление выборочной установки

source: By default Flatpak installs apps system-wide, and can also be made to install per-user with the ``--user`` option accepted by most commands. A third option is to set up a custom installation, which could be stored on an external hard drive.
pt_br: Por padrão, o Flatpak instala aplicativos em todo o sistema e também pode ser instalado por usuário com a opção ``--user`` aceita pela maioria dos comandos. Uma terceira opção é configurar uma instalação personalizada, que pode ser armazenada em um disco rígido externo.
ru: По умолчанию Flatpak устанавливает приложения в масштабе всей системы, а также может быть настроен для установки для каждого пользователя с параметром --user, принятым большинством команд. Третий вариант - настроить выборочную установку, которая может храниться на внешнем жестком диске.

source: First ensure that the config directory exists::
pt_br: Primeiro, certifique-se de que o diretório de configuração existe::
ru: Сначала убедитесь, что каталог конфигурации существует::

source: Then open a file in that directory as root::
pt_br: Em seguida, abra um arquivo nesse diretório como root::
ru: Затем откройте файл в этом каталоге как root::

source: And write something like this::
pt_br: E escreva algo assim::
ru: И напишите что-нибудь вроде этого::

source: See `flatpak-installation(5) <https://docs.flatpak.org/en/latest/flatpak-command-reference.html#flatpak-installation>`_ for the full format specification. Replace the path with the actual path you want to use. You can use ``df`` to see mounted file systems and ``mkdir`` to create a ``flatpak`` directory so the path specified by ``Path=`` exists.
pt_br: Veja `flatpak-installation(5) <https://docs.flatpak.org/pt_BR/latest/flatpak-command-reference.html#flatpak-installation>`_ para a especificação completa do formato. Substitua o caminho pelo caminho real que você deseja usar. Você pode usar ``df`` para ver sistemas de arquivos montados e ``mkdir`` para criar um diretório ``flatpak`` para que o caminho especificado por ``Path=`` exista.
ru: Полную спецификацию формата см. в разделе `flatpak-installation(5) <https://docs.flatpak.org/en/latest/flatpak-command-reference.html#flatpak-installation>`_. Замените путь фактическим путем, который вы хотите использовать. Вы можете использовать ``df`` для просмотра смонтированных файловых систем и ``mkdir`` для создания каталога ``flatpak``, чтобы существовал путь, указанный в ``Path=``.

source: Then you can add a remote using a command like::
pt_br: Então você pode adicionar um controle remoto usando um comando como::
ru: Затем вы можете добавить удалённый компьютер с помощью такой команды, как::

source: And install to it with::
pt_br: E instale nele com::
ru: И установите его с помощью::

source: If your custom installation is the only one with the remote you're installing from, ``--installation`` can be omitted.
pt_br: Se sua instalação personalizada for a única com o controle remoto do qual você está instalando, ``--installation`` pode ser omitido.
ru: Если ваша пользовательская установка является единственной с удаленным компьютером, с которого вы выполняете установку, параметр ``--installation`` можно не указывать.

source: And run apps from it with::
pt_br: E execute aplicativos a partir dele com::
ru: И запускать из него приложения с помощью::

source: If your custom installation is the only one with the app you're running, ``--installation`` can be omitted.
pt_br: Se sua instalação personalizada for a única com o aplicativo que você está executando, ``--installation`` pode ser omitido.
ru: Если ваша пользовательская установка является единственной с приложением, которое вы используете, ``--installation`` можно не указывать.

source: Configuring resource limits for apps
pt_br: Configurando limites de recursos para aplicativos
ru: Настройка лимитов ресурсов для приложений

source: When systemd is available, Flatpak tries to put app processes in a scope such as ``app-com.brave.Browser-*.scope`` (in the case of Brave), with ``*`` replaced by an arbitrary suffix. This means you can create a file like ``~/.config/systemd/user/app-flatpak-com.brave.Browser-.scope.d/memory.conf`` with contents like::
pt_br: Quando o systemd está disponível, o Flatpak tenta colocar os processos do aplicativo em um escopo como ``app-com.brave.Browser-*.scope`` (no caso do Brave), com ``*`` substituído por um sufixo arbitrário . Isso significa que você pode criar um arquivo como ``~/.config/systemd/user/app-flatpak-com.brave.Browser-.scope.d/memory.conf`` com conteúdos como::

source: Then after a ``systemctl --user daemon-reload``, those ``systemd.resource-control(5)`` parameters will apply to all instances of that app.
pt_br: Então, após um ``systemctl --user daemon-reload``, esses parâmetros ``systemd.resource-control(5)`` serão aplicados a todas as instâncias desse aplicativo.
ru: Затем после ``systemctl --user daemon-reload`` эти параметры ``systemd.resource-control(5)`` будут применяться ко всем экземплярам этого приложения.

source: When systemd is available, Flatpak tries to put app processes in a scope such as ``app-flatpak-com.brave.Browser-*.scope`` (in the case of Brave), with ``*`` replaced by an arbitrary suffix. This means you can create a file like ``~/.config/systemd/user/app-flatpak-com.brave.Browser-.scope.d/memory.conf`` with contents like::
ru: Когда доступен systemd, Flatpak пытается поместить процессы приложения в область действия, такую как app-flatpak-com.brave.Browser-*.scope (в случае Brave), где ``*`` заменяется произвольным суффиксом. Это означает, что вы можете создать файл вида ``~/.config/systemd/user/app-flatpak-com.brave.Browser-.scope.d/memory.conf`` с таким содержимым::
