Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/under-the-hood.po
Languages: pt_br, ru, zh_cn

source: Under the Hood
pt_br: Sob o capô
ru: Скрытое содержимое Flatpak
zh_cn: Flatpak原理

source: This page provides an overview of how Flatpak works internally. While it isn't necessary to be familiar with this in order to use Flatpak, some people might find it interesting. Knowing about Flatpak's architecture also helps to get a better understanding of how and why it works the way it does, from a user and application developer perspective.
pt_br: Esta página fornece uma visão geral de como o Flatpak funciona internamente. Embora não seja necessário estar familiarizado com isso para usar o Flatpak, algumas pessoas podem achar interessante. Conhecer a arquitetura do Flatpak também ajuda a entender melhor como e por que funciona da maneira que funciona, da perspectiva do usuário e do desenvolvedor de aplicativos.
ru: На этой странице представлен обзор внутренней работы Flatpak. Хотя не обязательно знать это, чтобы использовать Flatpak, некоторым это может показаться интересным. Знание об архитектуре Flatpak также помогает лучше понять, как и почему она работает именно так, с точки зрения пользователя и разработчика приложений.
zh_cn: 本页面简单介绍了Flatpak内部工作原理。虽然仅仅是使用Flatpak没必要熟悉这些，但是有些人可会会觉得这很有趣。从用户和应用开发者的角度来看，了解Flatpak的体系结构还有助于更好地理解它的工作方式和原因。

source: "Git for apps"
pt_br: “Git para aplicativos”
zh_cn: 应用级Git

source: Flatpak is built on top of a technology called `OSTree <https://ostreedev.github.io/ostree/introduction/>`_, which is influenced by and very similar to the Git version control system. Like Git, OSTree allows versioned data to be tracked and to be distributed between different repositories. However, where Git is designed to track source files, OSTree is designed to track binary files and other large data.
pt_br: O Flatpak é construído sobre uma tecnologia chamada `OSTree <https://ostreedev.github.io/ostree/introduction/>`_, que é influenciada e muito semelhante ao sistema de controle de versão Git. Como o Git, o OSTree permite que os dados versionados sejam rastreados e distribuídos entre diferentes repositórios. Porém, enquanto o Git é projetado para rastrear arquivos fonte, o OSTree é projetado para rastrear arquivos binários e outros dados grandes.
ru: Flatpak построен на основе технологии под названием `OSTree <https://ostreedev.github.io/ostree/introduction/>`_, которая находится под влиянием системы контроля версий Git и очень похожа на нее. Как и Git, OSTree позволяет отслеживать версионные данные и распределять их между различными репозиториями. Однако там, где Git предназначен для отслеживания исходных файлов, OSTree предназначен для отслеживания двоичных файлов и других больших данных.

source: Internally, Flatpak therefore works in a similar way to Git, and many Flatpak concepts are analogous to Git concepts. Like Git, Flatpak uses repositories to store data, and it tracks the differences between versions.
pt_br: Internamente, o Flatpak, portanto, funciona de maneira semelhante ao Git, e muitos conceitos do Flatpak são análogos aos conceitos do Git. Como o Git, o Flatpak usa repositórios para armazenar dados e rastreia as diferenças entre as versões.
ru: Таким образом, внутри Flatpak работает аналогично Git, и многие концепции Flatpak аналогичны концепциям Git. Как и Git, Flatpak использует репозитории для хранения данных и отслеживает различия между версиями.

source: With Flatpak, each application, runtime and extension is a branch in a repository. An identifier triple, such as ``com.company.App/x86_64/stable`` is a reference to that branch. The output of a Flatpak build process is a directory of files which is committed to one of these branches.
pt_br: Com o Flatpak, cada aplicativo, runtime e extensão é um ramo em um repositório. Um trio identificador, como ``com.empresa.Aplicativo/x86_64/stable`` é uma referência a esse ramo. A saída de um processo de compilação do Flatpak é um diretório de arquivos do qual é feito commit para um desses ramos.

source: When an application is installed with Flatpak, it is pulled from the remote into a new branch in a local repository. Links are then generated which point from the right places in the filesystem to the application's files in the repository (these are `hard links <https://en.wikipedia.org/wiki/Hard_link>`_, which are fast to resolve and disk space efficient). In other words, every application that is installed is stored in a local version control repository, and is then mapped into the local filesystem.
pt_br: Quando um aplicativo é instalado com o Flatpak, ele é extraído do remoto para um novo ramo em um repositório local. Em seguida, são gerados links que apontam dos lugares certos no sistema de arquivos para os arquivos do aplicativo no repositório (estes são `links físicos <https://pt.wikipedia.org/wiki/Link_físico>`_, que são rápidos para resolver e espaço em disco eficiente). Em outras palavras, todos os aplicativos instalados são armazenados em um repositório de controle de versão local e, em seguida, são mapeados no sistema de arquivos local.
ru: Когда приложение устанавливается с помощью Flatpak, оно переносится с удалённой в новую ветку в локальном репозитории. Затем генерируются ссылки, которые указывают из нужных мест в файловой системе на файлы приложения в репозитории (это `жесткие ссылки <https://en.wikipedia.org/wiki/Hard_link>`_, которые быстро разрешаются и освобождают дисковое пространство, занимая мало места на диске). Другими словами, каждое установленное приложение хранится в локальном репозитории управления версиями, а затем сопоставляется с локальной файловой системой.
zh_cn: 使用Flatpak安装应用时，会将其从远程仓库中拉入到本地仓库中的新分支。 然后生成从文件系统指向仓库的链接（这些链接是快速解析和高效利用的磁盘空间`硬链接 <https://en.wikipedia.org/wiki/Hard_link>`）。 换句话说，安装的每个应用程序都存储在本地版本控制仓库中，然后映射到本地文件系统。

source: Version tracking is therefore a core part of Flatpak's architecture, and this makes updating software to the latest version very efficient. Versioning also makes rollbacks possible, so it's easy to go back to a previous version, should that be required.
pt_br: O rastreamento de versão é, portanto, uma parte essencial da arquitetura do Flatpak, e isso torna a atualização do software para a versão mais recente muito eficiente. O controle de versão também possibilita reversões, por isso é fácil voltar para uma versão anterior, se necessário.
ru: Таким образом, отслеживание версий является основной частью архитектуры Flatpak, и это делает обновление программного обеспечения до последней версии очень эффективным. Управление версиями также делает возможными откаты, поэтому при необходимости легко вернуться к предыдущей версии.
zh_cn: 因此，版本跟踪是Flatpak架构的核心部分，这使得更新软件非常高效。 版本控制也使回滚成为可能，因此如果需要，可以很容易地回滚到以前的版本。

source: Storing applications in a local OSTree repository has other advantages. For example, it allows files that are stored on disk to be deduplicated, so the same file that belongs to multiple applications (or runtimes) is only stored once.
pt_br: Armazenar aplicativos em um repositório OSTree local tem outras vantagens. Por exemplo, ele permite que os arquivos armazenados no disco sejam deduplicados, portanto, o mesmo arquivo que pertence a vários aplicativos (ou runtimes) é armazenado apenas uma vez.
ru: Хранение приложений в локальном репозитории OSTree имеет и другие преимущества. Например, он позволяет удалять дубликаты файлов, хранящихся на диске, поэтому один и тот же файл, принадлежащий нескольким приложениям (или средам выполнения), сохраняется только один раз.
zh_cn: 将应用程序存储在本地OSTree存储库中具有其他优点。 例如，它允许对存储在磁盘上的文件去重，所以属于多个应用程序（或运行时）的同一文件仅存储一次。

source: Underlying technologies
pt_br: Tecnologias subjacentes
ru: Базовые технологии
zh_cn: 基础技术

source: Flatpak utilises a number of pre-existing technologies. These include:
pt_br: O Flatpak utiliza várias tecnologias preexistentes. Esses incluem:
ru: Flatpak использует ряд уже существующих технологий. К ним относятся:
zh_cn: Flatpak使用了许多已经存在的技术。如：

source: The `bubblewrap <https://github.com/containers/bubblewrap>`_ utility from `Project Atomic <https://projectatomic.io/>`_, which lets unprivileged users set up and run containers, using kernel features such as:
pt_br: O utilitário `bubblewrap <https://github.com/containers/bubblewrap>`_ do `Project Atomic <https://projectatomic.io/>`_, que permite que usuários sem privilégios configurem e executem contêineres, usando recursos do kernel, como:

source: Namespaces
pt_br: Espaços de nomes

source: Bind mounts
pt_br: Montagens vinculadas ("bind")

source: Seccomp rules
pt_br: Regras seccomp

source: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_ to set up cgroups for sandboxes
pt_br: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_ para configurar cgroups para sandboxes
ru: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`_ для настройки контрольных групп для песочниц
zh_cn: `systemd <https://www.freedesktop.org/wiki/Software/systemd/>`为沙盒启动cgroups

source: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, a well-established way to provide high-level APIs to applications
pt_br: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, uma maneira bem estabelecida de fornecer APIs de alto nível para aplicativos
ru: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_, - хорошо зарекомендовавший себя способ предоставления высокоуровневых API для приложений
zh_cn: `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`，一种成熟的为应用程序提供高级API的方法

source: The `OSTree <https://ostree.readthedocs.io/en/latest/>`__ system for versioning and distributing filesystem trees
pt_br: O sistema `OSTree <https://ostree.readthedocs.io/en/latest/>`__ para versionamento e distribuição de árvores de sistema de arquivos
ru: Система `OSTree <https://ostree.readthedocs.io/en/latest/>`_ для управления версиями и распространения различных файловых систем

source: The OCI format from the `Open Container Initiative <https://opencontainers.org/>`_, as an alternative to OSTree used by the `Fedora infrastructure <https://blog.fishsoup.net/2018/12/04/flatpaks-in-fedora-now-live/>`__
pt_br: O formato OCI da `Open Container Initiative <https://opencontainers.org/>`_, como uma alternativa ao OSTree usado pela `infraestrutura do Fedora <https://blog.fishsoup.net/2018/12/04/flatpaks-in-fedora-now-live/>`__

source: Flatpak can use either OSTree or OCI for single-file bundles.
pt_br: Flatpak pode usar OSTree ou OCI para pacotes de arquivo único.
ru: Flatpak может использовать OSTree или OCI для однофайловых пакетов.

source: `Appstream <https://www.freedesktop.org/software/appstream/docs/>`_ metadata, to allow Flatpak applications to show up nicely in software center applications
pt_br: Metadados de `Appstream <https://www.freedesktop.org/software/appstream/docs/>`_, para permitir que os aplicativos Flatpak apareçam bem nos aplicativos de centros de software
ru: `Appstream <https://www.freedesktop.org/software/appstream/docs/>`_ - метаданные, предназначенные для того, чтобы приложения Flatpak хорошо отображались в приложениях центра программ
zh_cn: `Appstream <https://www.freedesktop.org/software/appstream/docs/>`元数据，允许Flatpak应用在软件中心友好的展示

source: With Flatpak, each application, runtime and extension is a branch in a repository. An identifier triple, such as ``com.company.App/i386/stable`` is a reference to that branch. The output of a Flatpak build process is a directory of files which is committed to one of these branches.
ru: В Flatpak каждое приложение, среда выполнения и расширение - это ветка в репозитории. Тройная идентификация, например ``com.company.App/i386/stable``, является ссылкой на эту ветку. Результатом процесса сборки Flatpak является каталог файлов, который привязан к одной из этих веток.
zh_cn: 使用Flatpak，每个应用程序，运行时和扩展都是仓库中的一个分支。 标识符三元组，例如``com.company.App/i386/stable``是对该分支的引用。 Flatpak构建过程的输出是一个文件目录，它提交给其中一个分支。

source: The `bubblewrap <https://github.com/projectatomic/bubblewrap>`_ utility from `Project Atomic <http://www.projectatomic.io/>`_, which lets unprivileged users set up and run containers, using kernel features such as:
ru: Утилита `bubblewrap <https://github.com/projectatomic/bubblewrap>`_ из `Project Atomic <http://www.projectatomic.io/>`_, которая позволяет непривилегированным пользователям настраивать и запускать контейнеры, используя такие функции ядра, как:

source: The OCI format from the `Open Container Initiative <https://www.opencontainers.org/>`_, as an alternative to OSTree used by the `Fedora infrastructure <https://blog.fishsoup.net/2018/12/04/flatpaks-in-fedora-now-live/>`__
ru: Формат OCI из `Open Container Initiative <https://www.opencontainers.org/>`_, как альтернатива OSTree, используемый инфраструктурой Fedora <https://blog.fishsoup.net/2018/12/04/flatpaks-in-fedora-now-live/>`__

source: Flatpak is built on top of a technology called `OSTree <https://ostree.readthedocs.io/en/latest/manual/introduction/>`_, which is influenced by and very similar to the Git version control system. Like Git, OSTree allows versioned data to be tracked and to be distributed between different repositories. However, where Git is designed to track source files, OSTree is designed to track binary files and other large data.
zh_cn: Flatpak建立在一种名为`OSTree <https://ostree.readthedocs.io/en/latest/manual/introduction/>`的技术之上，该技术受Git版本控制系统的影响，非常类似Git。与Git一样，OSTree允许跟踪版本化数据并在不同的仓库间分发。不同的是，Git为跟踪源文件设计，OSTree为跟踪二进制文件和其他大数据设计。

source: Internally, Flatpak therefore works in a similar way to Git, and many Flatpak concepts are analagous to Git concepts. Like Git, Flatpak uses repositories to store data, and it tracks the differences between versions.
zh_cn: 在内部，Flatpak的工作方式与Git类似，许多Flatpak概念与Git概念类似。 与Git一样，Flatpak使用仓库来存储数据，并跟踪版本之间的差异。

source: The OCI format from the `Open Container Initiative <https://www.opencontainers.org/>`_, as a convenient transport format for single-file bundles
zh_cn: `Open Container Initiative <https://www.opencontainers.org/>`的OCI格式，作为单文件包的便捷传输格式

source: The `OSTree <https://ostree.readthedocs.io/en/latest/>`_ system for versioning and distributing filesystem trees
zh_cn: `OSTree <https://ostree.readthedocs.io/en/latest/>`系统，版本化和分布式文件系统树
