Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/usb-drives.po
Languages: pt_br, ru

source: USB Drives
pt_br: Unidades USB
ru: USB-накопители

source: One can distribute flatpaks along with their dependencies on USB drives (or network shares, etc.) which is especially helpful in situations where Internet access is limited or non-existent.
pt_br: Pode-se distribuir flatpaks junto com suas dependências em unidades USB (ou compartilhamentos de rede, etc.), o que é especialmente útil em situações onde o acesso à Internet é limitado ou inexistente.
ru: Можно распространять flatpaks-пакеты вместе с их зависимостями на USB-накопителях (или общих сетевых ресурсах и т. Д.), Что особенно полезно в ситуациях, если доступ в Интернет ограничен или отсутствует.

source: For offline distribution to work there are a few prerequisites:
pt_br: Para que a distribuição offline funcione, existem alguns pré-requisitos:
ru: Для работы автономного распространения есть несколько предварительных условий:

source: the remote repositories providing the app or any of its dependencies must utilize GPG signatures
pt_br: os repositórios remotos que fornecem o aplicativo ou qualquer uma de suas dependências devem utilizar assinaturas GPG
ru: удаленные репозитории, предоставляющие приложение или любые его зависимости, должны использовать подписи GPG

source: the remote repos must all have a collection ID set on the server side
pt_br: todos os repositórios remotos devem ter um ID de coleção definido no lado do servidor
ru: все удаленные репозитории должны иметь идентификатор коллекции, установленный на стороне сервера

source: the locally configured remotes must have a collection ID set (on the client side)
pt_br: os remotos configurados localmente devem ter um conjunto de ID de coleção (no lado do cliente)
ru: локально настроенные удалённые репозитории должны иметь набор идентификаторов (на стороне клиента)

source: the relevant remotes must be configured on the receiving computer (the one installing from the drive)
pt_br: os controles remotos relevantes devem ser configurados no computador receptor (aquele que está instalando a partir da unidade)
ru: соответствующие удалённые репозитории должны быть настроены на принимающем компьютере (тот, который устанавливается с накопителя)

source: Apps can then be copied to USB drives using `the flatpak create-usb command <https://docs.flatpak.org/en/latest/flatpak-command-reference.html#flatpak-create-usb>`_. You can refer to `this blog post <https://blogs.gnome.org/mclasen/2018/08/26/about-flatpak-installations/>`__ for an introduction.
pt_br: Os aplicativos podem ser copiados para unidades USB usando o `comando flatpak create-usb <https://docs.flatpak.org/pt_BR/latest/flatpak-command-reference.html#flatpak-create-usb>`_. Você pode consultar `esta postagem do blog <https://blogs.gnome.org/mclasen/2018/08/26/about-flatpak-installations/>`__ para uma introdução.
ru: Затем приложения можно скопировать на USB-накопители с помощью команды `the flatpak create-usb <https://docs.flatpak.org/en/latest/flatpak-command-reference.html#flatpak-create-usb>`_. Вы можете обратиться к `этому сообщению в блоге <https://blogs.gnome.org/mclasen/2018/08/26/about-flatpak-installations/>`__ for an introduction.

source: For example, if you want to put Gedit on a USB drive:
pt_br: Por exemplo, se você quiser colocar o Gedit em uma unidade USB:
ru: Например, если вы хотите поместить Gedit на USB-накопитель:

source: First identify the Application ID using ``flatpak list --app``. In the case of Gedit it is ``org.gnome.gedit``. Use ``flatpak info -o org.gnome.gedit`` to determine the origin remote. For example that may be ``flathub``.
pt_br: Primeiro identifique o ID do aplicativo usando ``flatpak list --app``. No caso do Gedit é ``org.gnome.gedit``. Use ``flatpak info -o org.gnome.gedit`` para determinar o remoto de origem. Por exemplo, pode ser ``flathub``.
ru: Сначала определите идентификатор приложения с помощью ``flatpak list --app``. В случае Gedit это org.gnome.gedit. Используйте flatpak info -o org.gnome.gedit, чтобы определить удаленный источник. Например, это может быть ``flathub``.

source: Ensure the origin remote has a collection ID set by using ``flatpak remotes -d`` and checking the "Collection ID" column. If not, configure one with e.g. ``flatpak remote-modify --collection-id=org.flathub.Stable flathub``. If any dependencies come from other remotes, those will also need a collection ID configured.
pt_br: Certifique-se de que o remoto de origem tenha um ID de coleção definido usando ``flatpak remotes -d`` e verificando a coluna "ID de coleção". Caso contrário, configure um com, por exemplo, ``flatpak remote-modify --collection-id=org.flathub.Stable flathub``. Se alguma dependência vier de outros remotos, eles também precisarão de um ID de coleção configurado.
ru: Убедитесь, что исходный удалённый репозиторий имеет идентификатор коллекции, используя команду ``flatpak remotes -d`` и проверив столбец "Collection ID" Если нет, настройте его, например, ``flatpak remote-modify --collection-id=org.flathub.Stable flathub``. Если какие-либо зависимости исходят от других удалённых репозиториев, им также потребуется настроенный идентификатор коллекции.

source: Next, use the ``df`` command to identify the mount point for the USB drive. It may be something like ``/media/user/FLATPAKS``.
pt_br: Em seguida, use o comando ``df`` para identificar o ponto de montagem da unidade USB. Pode ser algo como ``/media/user/FLATPAKS``.
ru: Затем используйте команду ``df``, чтобы определить точку монтирования для USB-накопителя. Это может быть что-то вроде ``/media/user/FLATPAKS``.

source: Now copy the flatpak and its dependencies to the drive::
pt_br: Agora copie o flatpak e suas dependências para a unidade::
ru: Теперь скопируйте flatpak и его зависимости на накопитель::

source: Wait for the copying process to complete, at which point you should get a command prompt (``$``). This process can take tens of minutes especially if the USB drive and USB port aren't USB 3.0+. Then unmount the drive before removing it::
pt_br: Aguarde a conclusão do processo de cópia, nesse ponto você deverá obter um prompt de comando (``$``). Esse processo pode levar dezenas de minutos, especialmente se a unidade USB e a porta USB não forem USB 3.0+. Em seguida, desmonte a unidade antes de removê-la::
ru: Дождитесь завершения процесса копирования, после чего вы должны получить командную строку (``$``). Этот процесс может занять десятки минут, особенно если USB-накопитель и USB-порт не являются USB 3.0+. Затем отключите накопитель перед его извлечением::

source: The process for installing from such a USB drive (for example on an offline machine) differs between Flatpak versions before 1.8.0 and those after. With earlier versions you can simply use the ``flatpak install`` command as you normally would online::
pt_br: O processo de instalação de uma unidade USB (por exemplo, em uma máquina offline) difere entre as versões do Flatpak anteriores a 1.8.0 e posteriores. Com versões anteriores, você pode simplesmente usar o comando ``flatpak install`` como faria normalmente online::
ru: Процесс установки с такого USB-накопителя (например, на автономном компьютере) отличается для версий Flatpak до 1.8.0 и более поздних. В более ранних версиях вы можете просто использовать команду ``flatpak install`` , как и online.::

source: For versions after 1.8.0, if your linux distribution has packaged `the relevant systemd units <https://github.com/flatpak/flatpak/tree/main/sideload-repos-systemd>`__, using ``flatpak install`` with no extra arguments still works. Otherwise, you can use the ``--sideload-repo`` option in your command invocation::
pt_br: Para versões posteriores a 1.8.0, se sua distribuição Linux tiver empacotado `as unidades systemd relevantes <https://github.com/flatpak/flatpak/tree/main/sideload-repos-systemd>`__, usando ``flatpak install`` sem argumentos extras ainda funciona. Caso contrário, você pode usar a opção ``--sideload-repo`` em sua invocação de comando::

source: The ``flatpak update`` command also accepts a ``--sideload-repo`` option.
pt_br: O comando ``flatpak update`` também aceita uma opção ``--sideload-repo``.
ru: Команда ``flatpak update`` также принимает параметр ``--sideload-repo``.

source: Alternatively, it's possible to specify sideload sources using symbolic links placed in system-wide or user-specific directories and such sources will then be used for all Flatpak operations without the need for a ``--sideload-repo`` option. See `the flatpak man page <https://docs.flatpak.org/en/latest/flatpak-command-reference.html#flatpak>`__.
pt_br: Alternativamente, é possível especificar fontes de download local (*sideloaded*) usando links simbólicos colocados em diretórios de todo o sistema ou específicos do usuário e tais fontes serão usadas para todas as operações do Flatpak sem a necessidade de uma opção ``--sideload-repo``. Veja `a página de manual do flatpak <https://docs.flatpak.org/pt_BR/latest/flatpak-command-reference.html#flatpak>`__.
ru: В качестве альтернативы можно указать источники неопубликованной загрузки, используя символические ссылки, размещенные в общесистемных или пользовательских каталогах, и такие источники затем будут использоваться для всех операций Flatpak без необходимости в опции ``--sideload-repo``. См. Справочную страницу по flatpak: <https://docs.flatpak.org/en/latest/flatpak-command-reference.html#flatpak>`__.

source: For versions after 1.8.0, if your linux distribution has packaged `the relevant systemd units <https://github.com/flatpak/flatpak/tree/master/sideload-repos-systemd>`__, using ``flatpak install`` with no extra arguments still works. Otherwise, you can use the ``--sideload-repo`` option in your command invocation::
ru: Для версий после 1.8.0, если в вашем дистрибутиве Linux были упакованы соответствующие модули systemd <https://github.com/flatpak/flatpak/tree/master/sideload-repos-systemd>`__, используя ``flatpak install`` без дополнительных аргументов все еще работает. В противном случае вы можете использовать параметр ``--sideload-repo`` при вызове команды::
