Repository: flatpak/flatpak-docs
Catalog: po/*/LC_MESSAGES/working-with-the-sandbox.po
Languages: de, fr, ru

source: Working with the Sandbox
de: Arbeiten mit der Sandbox
fr: Travailler avec le bac à sable
ru: Работа с песочницей

source: One of Flatpak's main goals is to increase the security of desktop systems by isolating applications from one another. This is done using sandboxing and it means that, by default, a Flatpak has extremely limited access to the host environment. This includes:
de: Eines von Flatpaks Hauptzielen ist es, durch die Isolierung der Anwendungen zueinander, die Sicherheit von Desktop-Systemen zu verbessern. Dies wird erreicht durch sandboxing und bedeutet, dass Flatpak standardmäßig extrem limitierten Zugang zur Hostumgebung hat. Dies beinhaltet:
fr: Un des buts principaux est d'améliorer la sécurité des environnements de bureaux en isolant les applications les unes des autres. C'est effectué à l'aide de bac à sable, et cela signifie que, par défaut, un Flatpak a des accès limités à l'environnement de l'hôte. Cela inclus:
ru: Одной из основных целей Flatpak является повышение безопасности десктопных систем за счет изоляции приложений друг от друга. Это делается с помощью песочницы, и это означает, что по умолчанию Flatpak имеет крайне ограниченный доступ к среде хоста. Это включает в себя:

source: No access to any host files except the runtime, the app and ``~/.var/app/$APPID``. Only the last of these is writable.
de: Kein Zugriff zu irgendwelchen Hostdateien, außer der Runtime, der App und ``~/.var/app/$APPID``. Lediglich die Letztgennante ist beschreibbar.
fr: Pas d'accès à aucun des fichiers de l'hôte excepté le runtome, l'application et ``~/.var/app/$APPID``. Seul le dernier est autorisé en écriture.
ru: Нет доступа к каким-либо файлам хоста, кроме среды выполнения, приложения и ``~/.var/app/$APPID``. Только последний из них доступен для записи.

source: No access to the network.
de: Kein Zugriff auf das Netzwerk.
fr: Pas d'accès au réseau.
ru: Нет доступа к сети.

source: No access to any device nodes (apart from ``/dev/null``, etc).
de: Kein Zugriff auf Gerätedateien (abgesehen von ``/dev/null``, etc).
fr: Pas d'accès à aucun périphérique (à part ``/dev/null``, etc).
ru: Нет доступа ни к каким узлам устройств (кроме ``/dev/null`` и т. д.).

source: No access to processes outside the sandbox.
de: Kein Zugriff auf Prozesse außerhalb der Sandbox.
fr: Pas d'accès aux processus en-dehors du bac à sable.
ru: Нет доступа к процессам вне песочницы.

source: Limited syscalls. For instance, apps can't use nonstandard network socket types or ptrace other processes.
de: Limitierte Systemaufrufe. Zum Beispiel können Apps keine nicht standardisierten Netzwerk-Sockettypen benutzen oder ein `ptrace` auf andere Prozesse ansetzen.
fr: Appels systèmes (syscall) limités. Par exemple, les applications ne peuvent utiliser un type de socket réseau non-standard ou faire un ptrace des autres processus.
ru: Ограниченные системные вызовы. Например, приложения не могут использовать нестандартные типы сетевых сокетов или отслеживать другие процессы.

source: Limited access to the session D-Bus instance - an app can only own its own name on the bus.
de: Limitierter Zugriff auf die Instanz des Session-D-Bus – eine App kann lediglich ihren eigenen Namen besitzen auf dem Bus.
fr: Accès limité à l'instance D-Bus de session - une application peut uniquement posséder son propre nom sur le bus.
ru: Ограниченный доступ к экземпляру сеанса D-Bus — приложение может владеть только своим собственным именем на шине.

source: No access to host services like X, system D-Bus, or PulseAudio.
de: Kein Zugriff auf Hostdienste wie X, den System-D-Bus oder PulseAudio.
fr: Pas d'accès aux services de l'hôte comme X, l'instance D-Bus système, ou PulseAudio.
ru: Нет доступа к хост-сервисам, таким как X, системемная шина D-Bus или PulseAudio.

source: Most applications will need access to some of these resources in order to be useful, and Flatpak provides a number of ways to give an application access to them.
de: Die meisten Anwendungen werden Zugriff zu einigen dieser Ressourcen benötigen, um nützlich zu sein. Flatpak stellt eine Reihe von Wegen zur Verfügung, einer Applikation Zugriff auf diese zu gewähren.
fr: La plupart des applications auront besoin d'accéder à certaines de ces ressources afin d'être utile, et Flatpak fournit un nombre de façon pour donner à une application l'accès à ceux-ci.
ru: Большинству приложений потребуется доступ к некоторым из этих ресурсов, чтобы быть полезными, и Flatpak предоставляет ряд способов предоставить приложению доступ к ним.

source: While there are no restrictions on which sandbox permissions an application can use, as good practice, it is recommended to use the minimum number of as permissions possible. Certain permissions, such as blanket access to the system bus (using the ``--socket=system-bus`` option) are strongly discouraged.
de: Obwohl es keine Restriktionen gibt, welche Sandboxberechtigungen eine Applikation nutzt, ist es gute Praxis, die minimalste Anzahl von Berechtigungen zu verwenden, die möglich ist. Von bestimmten Berechtigungen, wie ein Blankozugriff auf den System-Bus (unter Verwendung der ``--socket=system-bus``-Option), ist massiv abzuraten.
fr: Bien qu'il n'y ait pas de restriction sur les permissions bac à sable qu'une application peut utiliser, comme bonne pratique, il est recommander d'utiliser le nombre minimum de permissions possibles. Certains permissions, comme l'accès général au bus système (à l'aide de l'option ``--socket=system-bus``) sont fortement découragés.
ru: Хотя нет ограничений на то, какие разрешения песочницы может использовать приложение, в качестве хорошей практики рекомендуется использовать минимально возможное количество разрешений. Определенные разрешения, такие как полный доступ к системной шине (с использованием параметра ``--socket=system-bus``) настоятельно не рекомендуются.

source: Configuring sandbox permissions
de: Konfigurieren von Sandboxberechtigungen
fr: Configurer les permissions d'un bac à sable
ru: Настройка разрешений песочницы

source: Using the ``build-finish`` command is the simplest way to configure sandbox permissions. As was seen in a previous example, this can be used to add access to graphics sockets and the network::
de: Die Verwendung des ``build-finish``-Kommandos ist der einfachste Weg, die Sandboxberechtigungen zu konfigurieren. Wie in einem vorherigen Beispiel zu sehen war, kann dies genutzt werden, Zugriff auf Grafik-Sockets und das Netzwerk zu geben.
fr: Utiliser la commande ``build-finish`` est le moyen le plus simple pour configurer les permissions d'un bac à sable. Comme vu dans l'exemple précédent, il peut être utilisé pour ajouter l'accès à la socket et au réseau::
ru: Использование команды ``build-finish`` — это самый простой способ настроить разрешения песочницы. Как было видно в предыдущем примере, это можно использовать для добавления доступа к графическим сокетам и сети::

source: These arguments translate into several properties in the application's metadata file::
de: Diese Argumente werden in diverse Eigenschaften in der Metadatendatei übersetzt::
fr: Ces arguments se traduisent en plusieurs propriétés dans le fichier de meta-données de l'application::
ru: Эти аргументы преобразуются в несколько свойств в файле метаданных приложения::

source: build-finish allows a whole range of resources to be added to an application. These options can also be passed to flatpak-builder as ``finish-args`` properties.
de: ``build-finish`` erlaubt es, einer Applikation eine ganze Reihe von Ressourcen hinzuzufügen. Diese Optionen können ebenso an Flatpak Builder weitergeleitet werden als ``finish-args``-Eigenschaften.
fr: build-finish permet l'ajout de tout une gamme de ressources à une application. Ces options peuvent aussi être passées à flatpak-builder comme propriétés ``finish-args``.
ru: build-finish позволяет добавлять в приложение целый ряд ресурсов. Эти параметры также могут быть переданы в flatpak-builder как свойства ``finish-args``.

source: The table at the bottom of this page provides an overview of many sandbox permissions. The full list can also be viewed using ``flatpak build-finish --help``.
de: Die Tabelle am Ende der Seite beinhaltet eine Übersicht über viele Sandbox-Berechtigungen. Die vollständige Liste kann ebenso angesehen werden mittels ``flatpak build-finish --help``.
fr: Le tableau au page de cette page fournit une vue d'ensemble de beaucoup de permissions des bac à sable. La liste complète peut aussi être vue à l'aide de ``flatpak build-finish --help``.
ru: В таблице внизу этой страницы представлен обзор многих разрешений песочницы. Полный список также можно просмотреть, используя ``flatpak build-finish --help``.

source: Until a sandbox-compatible backend is available, access to dconf needs to be enabled using the following options::
de: Solange, bis ein Sandbox-kompatibles Backend verfügbar ist, muss der Zugriff auf dconf aktiviert werden mittels der folgenden Optionen::
fr: En attendant la disponibilité d'un backend compatible avec le bac à sable, l'accès à dconf nécessite d'être activé à l'aide des options suivantes::
ru: До тех пор, пока бэкэнд, совместимый с песочницей, не будет доступен, доступ к dconf должен быть включен с помощью следующих параметров::

source: Portals
de: Portale
fr: Portails
ru: Порталы

source: Portals are a mechanism through which applications can interact with the host environment from within a sandbox. In this way, they give additional abilities to interact with data, files and services without the need to add sandbox permissions.
de: Portale sind ein Mechanismus durch den Applikationen aus der Sandbox heraus mit der Hostumgebung interagieren können. Über diesen Weg geben sie zusätzliche Möglichkeiten frei mit Daten, Dateien und Diensten zu interagieren, ohne die Notwendigkeit Sandbox-Berechtigungen hinzuzufügen.
fr: Les portails sont des mécanismes à travers lesquels les applications peuvent intéragir avec l'environnement de l'hôte depuis le bac à sable. De cette façon, ils donnent des capacités additionnelles pour intéragir avec les données, les fichiers et les services sans la nécessité d'ajouter des permissions aux bacs à sables.
ru: Порталы — это механизм, с помощью которого приложения могут взаимодействовать с хост-средой из песочницы. Таким образом, они дают дополнительные возможности для взаимодействия с данными, файлами и службами без необходимости добавления разрешений песочницы.

source: Interface toolkits can implement transparent support for portals. If an application uses one of these toolkits, there is no additional work required to access them.
de: Interface-Toolkits können transparenten Support für Portale implementieren. Wenn eine Applikation eines dieser Toolkits nutzt, dann ist keine zusätzliche Arbeit notwendig, um Zugriff auf sie zu erhalten.
fr: Des boîtes à outils d'interface graphique peuvent implémenter un support transparent des portails. Si une application utilise une des ces boîtes à outils, il n'y a pas de travail additionnel requies pour y accèder.
ru: Инструментарий интерфейса может реализовать прозрачную поддержку порталов. Если приложение использует один из этих наборов инструментов, для доступа к ним не требуется никаких дополнительных действий.

source: Examples of capabilities that can be accessed through portals include:
de: Beispiele von Kapazitäten, auf die zugegriffen werden kann durch Portale:
fr: Exemples des capacités qui peuvent être accèdées à travers les portails inclus
ru: Примеры возможностей, к которым можно получить доступ через порталы, включают:

source: Inhibit the user session from ending, suspending, idling or getting switched away
de: Verhindern, dass die Benutzersitzung beendet, unterbrochen, pausiert oder gewechselt wird
fr: Empêcher la session utilisateur de s'arrêter, se susprendre,
ru: Запрет окончания, приостановки, бездействия или отключения сеанса пользователя

source: Network status information
de: Netzwerk-Statusinformation
fr: Information sur le statut réseau
ru: Информация о состоянии сети

source: Notifications
de: Benachrichtigungen
ru: Уведомления

source: Open a URI
de: Einen URI öffnen
fr: Ouvrir une URI
ru: Открытие URI

source: Open files with a native file chooser dialog
de: Dateien öffnen mit einem nativen Dateiwahldialog
fr: Ouvrir des fichiers avec la boîte de dialogue de sélection de fichier natif
ru: Открытие файлов с помощью собственного диалогового окна выбора файлов

source: Printing
de: Drucken
fr: Impression
ru: Печать

source: Screenshots
fr: Captures d'écran
ru: Скриншоты

source: Applications that aren't using a toolkit with support for portals can refer to the `xdg-desktop-portal API documentation <http://flatpak.org/xdg-desktop-portal/portal-docs.html>`_ for information on how to access them.
de: Applikationen, die kein Toolkit für Portale unterstützen, können sich auf die `Dokumentation der xdg-desktop-portal-API (en) <http://flatpak.org/xdg-desktop-portal/portal-docs.html>`_ beziehen, für Informationen, wie man auf sie zugreift.
fr: Les applications qui n'utilisent pas une boîte à outils avec le support des portails peuvent se référer à `la documentation de l'API xdg-desktop-portal <http://flatpak.org/xdg-desktop-portal/portal-docs.html>`_ pour les informations sur comment y accéder.
ru: Приложения, не использующие набор инструментов с поддержкой порталов, можно найти в документации xdg-desktop-portal API <http://flatpak.org/xdg-desktop-portal/portal-docs.html>`_ для получения информации о доступе к ним.

source: Overriding sandbox permissions
de: Überschreiben von Sandbox-Berechtigungen
fr: Passer outre les permissions d'un bac à sable
ru: Переопределение разрешений изолированной среды

source: When developing an application, it can sometimes be useful to override a Flatpak's sandbox configuration. There are several ways to do this. One is to override them using ``flatpak run``, which accepts the same parameters as ``build-finish``. For example, this will let the Dictionary application see your home directory::
de: Beim Entwickeln einer Anwendung kann es manchmal nützlich sein, Flatpaks Sandbox-Konfiguration zu überschreiben. Es gibt verschiedene Wege, dies zu tun. Einer ist es, diese zu überschreiben mittels ``flatpak run``, welches die gleichen Parameter akzeptiert wie ``build-finish``. Dies lässt z. B. die Dictionary-App das Heimverzeichnis sehen::
fr: Lors du développement d'une application, il peut être utile de passer outre la configuration bac à sable Flatpak. Il y a plusieurs façons de faire cela. Une des façons est d'utiliser ``flatpak run`` qui accepte les mêmes paramètres que ``build-finish``. Par exemple, cela permettra à l'application Dictionnaire de voir le répertoire personnel::
ru: При разработке приложения иногда бывает полезно переопределить конфигурацию песочницы Flatpak. Есть несколько способов сделать это. Один из них состоит в том, чтобы переопределить их с помощью ``flatpak run``, который принимает те же параметры, что и «build-finish». Например, это позволит приложению «Словарь» увидеть ваш домашний каталог::

source: ``flatpak override`` can also be used to permanently override an application's permissions::
de: ``flatpak override`` kann ebenso verwendet werden, permanent die Berechtigungen einer Applikation zu überschreiben::
fr: ``flatpak override`` peut aussi être utilisé pour outrepasser les permissions d'une application::
ru: ``flatpak override`` также можно использовать для постоянного переопределения разрешений приложения:

source: It is also possible to remove permissions using the same method. You can use the following command to see what happens when access to the filesystem is removed, for example::
de: Es ist ebenso möglich, Berechtigungen zu entfernen mit dieser Methode. Das folgende Kommando kann verwendet werden, um zu sehen was passiert, wenn bspw. der Zugriff auf das Dateisystem entfernt wird:
fr: Il est aussi possible d'enlever des permissions avec la même méthode. Vous pouvez utiliser la commande suivante pour voir ce qui arrive quand l'accès au système de fichier est supprimé, par exemple::
ru: Также можно удалить разрешения, используя тот же метод. Вы можете использовать следующую команду, чтобы увидеть, что происходит, когда доступ к файловой системе отсутствует, например::

source: Useful sandbox permissions
de: Nützliche Sandbox-Berechtigungen
fr: Permissions bac à sable utiles
ru: Полезные разрешения песочницы

source: Flatpak provides an array of options for controlling sandbox permissions. The following are some of the most useful:
de: Flatpak stellt eine Reihe von Optionen zur Verfügung, um Sandbox-Berechtigungen zu kontrollieren. Die Folgenden sind einige der Nützlichsten:
fr: Flatpak fournit un tableau d'options pour controller les permissions de bac à sable. Les suivants sont parmis les plus utiles:
ru: Flatpak предоставляет множество опций для управления разрешениями песочницы. Ниже приведены некоторые из наиболее полезных:

source: Access all files
de: Zugriff auf alle Dateien
fr: Accès à tous les fichiers
ru: Доступ ко всем файлам

source: Access the home directory
de: Zugriff auf das Heimverzeichnis
fr: Accès au répertoire personnel
ru: Доступ к домашнему каталогу

source: Access the home directory, read-only
de: Zugriff auf das Heimverzeichnis, nur-Lesezugriff
fr: Accès au répertoire personnel en lecture-seule
ru: Доступ к домашнему каталогу, только для чтения

source: Access paths
de: Zugriffspfade
fr: Chemins d'accès
ru: Пути доступа

source: Access the XDG download directory
de: Zugriff auf das XDG-Downloadverzeichnis
fr: Accès au répertoire XDG Téléchargements
ru: Доступ к каталогу загрузки XDG

source: Undo some of the above
de: Etwas rückgängig machen von dem Genannten
fr: Annule certaines options ci-dessus
ru: Отменить некоторые из вышеперечисленных

source: Show windows using X11 [#f1]_
de: Zeige Fenster unter Verwendung von X11 [#f1]_
fr: Affiche les fenêtres à l'aide de X11 [#f1]_
ru: Показать окна с помощью X11 [#f1]_

source: OpenGL rendering
fr: Rendu OpenGL
ru: Рендеринг OpenGL

source: Show windows using Wayland
de: Zeige Fenster unter Verwendung von Wayland
fr: Affiche les fenêtes à l'aide de Wayland
ru: Показать окна с помощью Wayland

source: --socket=pulseaudio
ru: --socket=wayland

source: Play sounds using PulseAudio
de: Spiele Sound mittels PulseAudio ab
fr: Joue les sons à l'aide de PulseAudio
ru: Воспроизведение звуков с помощью PulseAudio

source: Access the network [#f2]_
de: Zugriff auf das Netzwerk [#f2]_
fr: Accès au réseau [#f2]_
ru: Доступ к сети [#f2]_

source: Talk to a named service on the session bus
de: Kommuniziere mit einem benannten Dienst auf dem Session-Bus
fr: Parle à un service nommé sur le bus de session
ru: Общение с именованной службой на сеансовой шине

source: Talk to a named service on the system bus
de: Kommuniziere mit einem benannten Dienst auf dem System-Bus
fr: Parle à un service nommé sur le bus système
ru: Общение с именованной службой на системной шине

source: Unlimited access to all of D-Bus
de: Unlimitierter Zugriff zu allem auf D-Bus
fr: Accès illimité à tout D-Bus
ru: Неограниченный доступ ко всем D-Bus

source: Footnotes
de: Fußnoten
fr: Bas de page
ru: Сноски

source: ``–share=ipc`` means that the sandbox shares IPC namespace with the host. This is not necessarily required, but without it the X shared memory extension will not work, which is very bad for X performance.
de: ``–share=ipc`` bedeutet, dass die Sandbox den IPC-Namensraum mit dem Host teilt. Dies ist nicht zwingend erforderlich, aber ohne dies wird die Erweiterung für Shared Memory unter X11 nicht funktionieren – was sich sehr negativ auf die X-Performance auswirkt.
fr: ``–share=ipc`` signifie que le bac à sable partage l'espace de nom IPC avec l'hôte. Ce n'est pas nécessairement requis, mais sans cela l'extension mémoire partagée de X ne fonctionnera pas, ce qui peut-être pénalisant pour les performance.
ru: ``–share=ipc`` означает, что песочница разделяет пространство имен IPC с хостом. Это не обязательно требуется, но без него расширение разделяемой памяти X не будет работать, что очень плохо сказывается на производительности X.

source: Giving network access also grants access to all host services listening on abstract Unix sockets (due to how network namespaces work), and these have no permission checks. This unfortunately affects e.g. the X server and the session bus which listens to abstract sockets by default. A secure distribution should disable these and just use regular sockets.
de: Die Erteilung des Netzwerkzugriffs gibt zudem Zugriff auf alle Hostdienste frei, die auf abstrakten Unix-Sockets lauschen (aufgrund der Art wie Netzwerk-Namensräume arbeiten) – und diese arbeiten nicht mit Berechtigungsprüfungen. Dies betrifft unglücklicherweise z. B. den X-Server und den Session-Bus, der regulär auf abstrakten Sockets lauscht. Eine sichere Distribution sollte diese deaktivieren und lediglich reguläre Sockets verwenden.
fr: Donner l'accès réseau donne aussi l'accès à tous les services de l'hôte qui écoutent sur une socket Unix abstraite (dû au fonctionnement des espaces de nom réseau), et n'ont pas de vérification de permissions. Cela affecte par exemple le serveur X and le bus de session qui écounte sur des sockets abstraits par défaut. Une distribution sûre devrait les désactiver et utiliser des sockets réguliers.
ru: Предоставление доступа к сети также предоставляет доступ ко всем службам хоста, прослушивающим абстрактные сокеты Unix (из-за того, как работают сетевые пространства имен), и они не имеют проверок разрешений. Это, к сожалению, влияет, например. X-сервер и сеансовая шина, которая по умолчанию слушает абстрактные сокеты. Безопасный дистрибутив должен отключить их и использовать обычные сокеты.
